-- ЗОНА			|ИГРОК1		|ИГРОК2
----------------------------------------
-- Cтолица		|красная	|пурпурная	|
-- Зона т1		|зелёная	|голубая	|
-- Зона т2		|синяя		|жёлтая		|
-- Зона т3		|белая		|серая		|
-- Зона-тренер	|т.зеленая	|оранжевая	|
-- Трежа		|		чёрная			|
----------------------------------------
-- Чёрной зоны касаться: синяя, жёлтая, белая, серая, т.зеленая, оранжевая!

---------------
-- НАСТРОЙКИ

-- режим карты (1 - для игры одним героем; 2 - для классической игры)
local gmode = 1

-- коэффициент сложности (0.6-0.8 легко; 0.8-1 средне; >1 сложно) [страндарт = 0.92]
local kef = 0.92

-- коэффициент разброса силы нейтралов по умолчанию [страндарт = 1.05]
local kr = 1.05

----------------
-- КОД ШАБЛОНА

--Башня магии в зоне 2
function zoneMageResp()
	return {
		{
--			spellTypes = {Spell.Boost, Spell.Lower},
--			value = { min = 1200, max = 1210 },
--			spellLevel = { min = 2, max = 2 },
			spells = { 	yn('g000ss0007'), -- Исцеление
						yn('g000ss0002'), -- быстрота
						yn('g000ss0021'), -- Ледяной щит
						yn('g000ss0023'), -- сила витара
						yn('g000ss0044'), -- Menta minoris
						yn('g000ss0045'), -- tormentio
						yn('g000ss0134'), -- Порченная руна
						yn('g000ss0064'), -- слабость
						yn('g000ss0106'), -- Смятение
						yn('g000ss0101'), -- стая
						
						yn('g000ss0183'), -- сокрушение
						yn('g000ss0197'), -- Заступничество
						
						yn('g000ss0184'), -- прокл.эмира
						yn('g000ss0029'), -- Ритуал исцеления

						yn('g000ss0185'), -- terebrare corde
						yn('g000ss0050'), -- Chronos

						yn('g000ss0124'), -- Отсрочка неизбежного
						yn('g000ss0186'), -- Спешащее время

						yn('g000ss0187'), -- могущество
						yn('g000ss0107'), -- Дикие саженцы

						yn('g000ss0133'), -- Песнь слез
						
						
			},			
			guard = gmm({}, guard2m())
		}
	}
end


--Башня магии в зоне 3
function zoneMageZone34()
	return {
		{
			spells = { 	yn('g000ss0012'), -- Святая броня + 15 Брони
						yn('g000ss0013'), -- Святая сила +15 точн и урон
						yn('g000ss0031'), -- Призыв II: Валькирия
						yn('g000ss0026'), -- Гимн Кланов +15 ини
						yn('g000ss0089'), -- Preces -15 точн и урон
						yn('g000ss0199'), -- Terra oblivionem -25опыт
						yn('g000ss0073'), -- Прикосновение Мортис +20% ХП
						yn('g000ss0074'), -- Туман Смерти
						yn('g000ss0201'), -- Неотвратимая месть (криты)
						yn('g000ss0108'), -- Призыв III: Энт Большой

						yn('g000ss0082'), -- Благословение Всевышнего +20%хп +5 брони 1200
						yn('g000ss0039'), -- Неподкупность
						yn('g000ss0091'), -- Tempus status -33 ини 1200
						yn('g000ss0114'), -- Плесень
						yn('g000ss0116'), -- Благословение Галеана +50хп
						
						yn('g000ss0206'), -- Dominatum ignis -вард огонь
						yn('g000ss0209'), -- Небесный молот -вард воздух
						yn('g000ss0207'), -- Пробирающий холод -вард вода
						yn('g000ss0208'), -- Хворь -вард земля

						yn('g000ss0175'), -- Божественная мудрость (+20 опыт)
						yn('g000ss0144'), -- Затопление
					
			},			
			guard = guard3m()
		}
	}
end


--Башня магии в зоне тренера
function zoneMageTrainer()
	return {
		{
			spells = { 	
						orr5('g000ss0043', 'g000ss0024', 'g000ss0097', 'g000ss0004', 'g000ss0062'), -- Ignis mare / Буран / Кустарник / Молния / Мор	
						orr(orr('g000ss0001', 'g000ss0010'), orr('g000ss0180', 'g000ss0182')), -- / Защита от магии Воздуха / Защита от магии Земли | Ardenti aqua / Спокойствие пламени
						orr('g000ss0119', 'g000ss0022'), -- Водосточный колодец / Хождение по лесу
						orr('g000ss0147', 'g000ss0020'), -- Infernus (-крит,РБ,вампирик) / Приказ сира Аллемона
						orr(orr('g000ss0192','g000ss0191'),'g000ss0177'), -- Песнь Мимира или Проведение Всевышнего / Откровение
						orr('g000ss0152','g000ss0176'), -- Подкуп / Лисья хитрость
						rnd('g000ss0030','g000ss0068','g000ss0041','g000ss0047'), -- Взгляд Сивиллы / Тень / Incantare Hellhound / Incantare Beliarh Illudere
			},			
			guard = gmm({}, PredSkin(80, 87, 100, 100)),
		}
	}
end

----------------------

-- Город т1

local tierTowerResp0 = 1
--local valueTowerResp0 = { min = gmm(250,300)*kef, max = gmm(263,315)*kef }

function zoneTownsResp0()
	return {
	{
		tier = tierTowerResp0,
		stack = {
		subraceTypes = rsub(),		
			value = { min = gmm(250,300)*kef, max = gmm(263,315)*kef },
			loot = {
				itemTypes = { Item.Weapon, Item.Armor, Item.TravelItem }, -- 2+2+7
				value = { min = 300, max = 300 },
				itemValue = { min = 300, max = 300 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = 1, max = 1 }, -- хил100
					orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), -- хил25*2/хил 50
					gmm({ id = 'g000ig7001', min = 1, max = 1 }, { id = 'g000ig7002', min = 1, max = 1 }), -- кольцо50/кольцо100	
					orr({ id = 'g001ig0530', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), -- зелье посмертного зова (талики) / случ.шар манны
					yn(orr({ id = 'g000ig0008', min = 1, max = 1 },{ id = 'g002ig0007', min = 1, max = 1 })), --точность15 / Зелье магической устойчивости 
					{ id = b15(), min = 1, max = 1 }, -- случ. банка15
				}
			}
		}
	}
	}
end

-- Город т2
local tierTowerResp = 2
--local valueTowerResp = { min = gmm(380,430)*kef, max = gmm(400,450)*kef }

function zoneTownsResp(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerResp,
		stack = {
				subraceTypes = rsub(),
			value = { min = gmm(380,430)*kef, max = gmm(400,450)*kef },
			loot = {
--				itemTypes = { Item.Jewel, Item.TravelItem, Item.Weapon, Item.Armor }, --10+2+1+2
--				value = { min = 500, max = 500 },
--				itemValue = { min = 500, max = 500 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = 1, max = 1 }, -- хил100
					{ id = 'g001ig0378', min = 1, max = 2 }, -- хил75
					gmm({ id = 'g000ig7002', min = 1, max = 1 },{ id = 'g000ig7005', min = 1, max = 1 }), --кольцо100/изумруд150
					orr({ id = 'g001ig0524', min = 1, max = 1 },{ id = ExtraMana(playerRace), min = 1, max = 1 }), -- Зелье завоевателя (жезлы)| шар доп маны
					orr({ id = 'g000ig0024', min = 1, max = 1 },{ id = 'g000ig0023', min = 1, max = 1 }), -- вард огня/земли
					{ id = w15(), min = 1, max = 1}, -- случ. вард
					orr({ id = 'g000ig0002', min = 1, max = 1 },{ id = 'g002ig0007', min = 1, max = 1 }), --защита15 / Зелье магической устойчивости
					yn({ id = 'g000ig0008', min = 1, max = 1 }), --точность15

					-- Борода Имира (Реликвия) / Книга воды / Книга воздуха / Книга земли / Книга Огня / Книга тайного знания / 
					-- Медицинский трактат / Оковы долга (Реликвия) / Перчатки дуэлянта (Реликвия) / Череп Танатоса (Реликвия) / 
					-- Сапоги ассасина / Тяжелые сапоги / Счастливая кость (Артефакт) / Амулет Кракена (Артефакт) / Святая чаша (Артефакт) / Талисман щита стихий / Книга постижения  
					{id = rnd('g001ig0421','g000ig4002','g000ig4001','g000ig4003','g000ig4004','g000ig4006','g000ig4007','g001ig0610','g001ig0099','g000ig3020','g001ig0111','g001ig0114','g001ig0182','g001ig0048','g000ig2002','g000ig9120','g001ig0605'), min = 1, max = 1},
				}
			}
		}
	}
	}
end


-- Город т3
local tierTowerZone = 3;
--local valueTowerZone = { min = gmm(780,850)*kef, max = gmm(820,890)*kef }

function zoneTownsZone34(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerZone,
		stack = {
			subraceTypes = NoUndead(),
			value = { min = gmm(780,850)*kef, max = gmm(820,890)*kef },
			loot = {
				itemTypes = { Item.Talisman, Item.Jewel, Item.Weapon, Item.Armor, Item.TravelItem }, --3+5+5+6+1
				value = { min = 800, max = 800 },
				itemValue = { min = 800, max = 800 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 },
					{ id = 'g000ig0006', min = 2, max = 2 },
					orr(orr({ id = 'g001ig0526', min = 1, max = 1 }, { id = 'g001ig0527', min = 1, max = 1 }), { id = ExtraHomeMana(playerRace), min = 1, max = 1}), -- Зелье оруженосца (знамёна) / Зелье постижения (реликвии) | шар родной манны
					gmm({ id = 'g000ig7003', min = 1, max = 1 }, { id = 'g000ig7004', min = 1, max = 1 }), --изумруд150/золотое кольцо200
					orr({ id = 'g000ig9020', min = 1, max = 1 },{ id = 'g000ig9016', min = 1, max = 1 },{ id = 'g001ig0469', min = 1, max = 1 },{ id = 'g001ig0489', min = 1, max = 1 },{ id = 'g001ig0478', min = 1, max = 1 }), -- Сфера Энергии +25все / Сфера Великого исцеления +80-все / Сфера Пожара 55дот / Сфера Угнетения 100урон / Сфера Переохлаждения 40дот
					orr({ id = 'g001ig0128', min = 1, max = 1 },{ id = 'g001ig0125', min = 1, max = 1 }), -- вард оружия/разума
					{ id = e2(), min = 1, max = 1 }, --эликсир200		
					orr({ id = 'g000ig0011', min = 1, max = 1 },{ id = 'g002ig0005', min = 1, max = 1 }), --ини15 / Зелье наблюдательности -15воры
					yn(orr({ id = 'g000ig0014', min = 1, max = 1 },{ id = 'g002ig0007', min = 1, max = 1 })), --атака15 / Зелье магической устойчивости
					yn({ id = 'g000ig0008', min = 1, max = 1 }), --точность15

				}
				
			}
		}
	},
	}
end

-- Город т4
function zoneTownsZone5()
	return {
	{
		tier = 1,
		stack = {
			subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
			value = { min = 1705*kef, max = 1790*kef }, -- было 1550*10%
			loot = {
				items = {
					{ id = 'g000ig0001', min = 2, max = 2 },
					{ id = 'g000ig0006', min = 2, max = 2 }, -- хил100
					{ id = rms(), min = 1, max = 1 }, -- случ.шар манны
					gmm({ id = 'g000ig7004', min = 1, max = 1 },{ id = 'g000ig7005', min = 1, max = 1 }), -- золотое кольцо200/рубин250
					orr(orr({ id = 'g000ig1004', min = 1, max = 1}, { id = 'g000ig1002', min = 1, max = 1}), orr({ id = 'g000ig1008', min = 1, max = 1}, { id = 'g000ig1006', min = 1, max = 1})), -- Знамя битвы, Знамя неуязвимости, Знамя энергии, Знамя скорости		
					{ id = spherex(), min = 1, max = 1 }, -- сфера икс
					orr({ id = 'g000ig0018', min = 1, max = 1 }, { id = e4(), min = 1, max = 1 }), -- хил200/эл400
					yn(orr({ id = 'g000ig0012', min = 1, max = 1 },{ id = 'g002ig0006', min = 1, max = 1 })), --ини30 / Зелье бдительности -30воры
					yn({ id = 'g000ig0015', min = 1, max = 1 }), --урон30
					yn({ id = 'g000ig0003', min = 1, max = 1 }), --защита30
				}
			}
		}
	}
	}
end

----------------------

-- Лавка на Респе
function zoneMerchRespZ0() -- свиток т1
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 200, max = 200 },
			itemValue = { min = 200, max = 200 },
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 2 }, --15
				{ id = 'g000ig0014', min = 1, max = 2 }, --15
				{ id = 'g000ig0011', min = 1, max = 2 }, --15
				{ id = 'g000ig0008', min = 1, max = 2 }, --15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард
				
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости x 2

				orr({ id = 'g001ig0533', min = 1, max = 1 }, { id = 'g001ig0532', min = 1, max = 1 }), -- Зелье ясного взора (+2 обзора) / Зелье дозорного (+1 обзор)

				orr({ id = 'g001ig0530', min = 1, max = 1 }, { id = 'g001ig0006', min = 1, max = 1 }), -- Зелье посмертного зова (талисманы) / Эликсир маскировки
				orr({ id = 'g001ig0526', min = 1, max = 1 }, { id = 'g001ig0527', min = 1, max = 1 }), -- Зелье оруженосца (знамёна) / Зелье постижения (реликвии)
				orr({ id = 'g001ig0529', min = 1, max = 1 }, { id = 'g001ig0531', min = 1, max = 1 }), -- Каталог магических сфер / Зелье слова (свитки)
				orr({ id = 'g001ig0528', min = 1, max = 1 }, { id = 'g001ig0525', min = 1, max = 1 }), -- Честный труд (сапоги) / Эликсир учености (артефакты)

				--сапоги
				orr({ id = 'g001ig0105', min = 1, max = 1 }, { id = 'g001ig0107', min = 1, max = 1 }), -- Литейные сапоги (огонь) / Сапоги ветров (воздух)
				orr({ id = 'g001ig0108', min = 1, max = 1 }, { id = 'g001ig0106', min = 1, max = 1 }), -- Гномьи сапоги (вода) / Сапоги каменщика (земли)

				yn({ id = 'g000ig3001', min = 1, max = 1 }), -- наручи
				yn({ id = 'g000ig2001', min = 1, max = 1 }), -- р.камень
				yn({ id = 'g001ig0418', min = 1, max = 1 }), -- Руна защиты Фрейра (Артефакт)
				yn({ id = 'g001ig0611', min = 1, max = 1 }), -- Цепи жертвенности (Артефакт)300		
				yn({ id = 'g001ig0100', min = 1, max = 1 }), -- Цеп Хана (Артефакт) 300		
				yn({ id = 'g002ig0001', min = 1, max = 1 }), -- Потайной кинжал (Артефакт)
				yn({ id = 'g001ig0609', min = 1, max = 1 }), -- Загробный фонарь (Артефакт)
				
				yn({ id = 'g001ig0421', min = 1, max = 1 }), -- Борода Имира (Реликвия)
				yn({ id = 'g000ig3008', min = 1, max = 1 }), -- обод мёртв.
				yn({ id = 'g001ig0428', min = 1, max = 1 }), -- Кожаные эльфийские доспехи (Реликвия)
				yn({ id = 'g001ig0101', min = 1, max = 1 }), -- Череп Хана (Реликвия)
				yn({ id = 'g000ig4008', min = 1, max = 1 }), -- Фолиант Мысли
				yn({ id = 'g001ig0426', min = 1, max = 1 }), -- Куртка капитана (Реликвия)
				
				--посох
				orr(orr({ id = 'g001ig0383', min = 1, max = 1 }, { id = 'g001ig0387', min = 1, max = 1 }), orr({ id = 'g000ig6001', min = 1, max = 1 }, { id = 'g000ig6003', min = 1, max = 1 })), -- Посох первых побегов (малый энт) / Посох следопыта (хождение по лесу) / Посох грома (15 дамаг) /  Посох святости (30 хила)

				--сфера 100
				yn({ id = 'g001ig0458', min = 1, max = 1}), -- Сфера Каменного проклятия 100
				yn({ id = 'g000ig9031', min = 1, max = 1}), -- Сфера Ливня 100
				yn({ id = 'g000ig9022', min = 1, max = 1}), -- Сфера Углей 100
				yn({ id = 'g001ig0302', min = 1, max = 1}), -- Сфера Шторма 100
				yn({ id = 'g001ig0189', min = 1, max = 1}), -- Сфера Камня 100
				yn({ id = 'g001ig0178', min = 1, max = 1}), -- Сфера Костра 100
				yn({ id = 'g001ig0472', min = 1, max = 1}), -- Сфера Ледяного осколка 100
				yn({ id = 'g001ig0473', min = 1, max = 1}), -- Сфера Статического разряда 100
				yn({ id = 'g001ig0470', min = 1, max = 1}), -- Сфера Подавления 100
				yn({ id = 'g001ig0192', min = 1, max = 1}), -- Сфера Пыток 100
				yn({ id = 'g000ig9033', min = 1, max = 1}), -- Сфера Чумы 100				
				
				--талик
				orr({ id = 'g001ig0265', min = 1, max = 1}, { id = 'g000ig9131', min = 1, max = 1}), -- Талисман кузнеца 200 / Талисман Ливня 200				

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101'), min = 1, max = 1 }, -- свиток л.щит, сила, с.кости, с.витара, свиток устр. гимн, tormentio-броня, слабость, стая
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g001ig0492', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Проведение Всевышнего" (сферы) 
			}
		},
			guard = gmm({}, guard0()),
	}
}
end

-- Лавка т1
function zoneMerchRespZ() -- свиток т1
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 200, max = 200 },
			itemValue = { min = 200, max = 200 },
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5}, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				yn({ id = 'g000ig0002', min = 1, max = 1 }), --15
				yn({ id = 'g000ig0014', min = 1, max = 1 }), --15
				yn({ id = 'g000ig0011', min = 1, max = 1 }), --15
				{ id = 'g000ig0008', min = 1, max = 1 }, --15

				yn({ id = 'g000ig0021', min = 1, max = 2 }), -- вард
				yn({ id = 'g000ig0022', min = 1, max = 2 }), -- вард
				yn({ id = 'g000ig0023', min = 1, max = 2 }), -- вард
				yn({ id = 'g000ig0024', min = 1, max = 2 }), -- вард

				yn({ id = 'g001ig0125', min = 1, max = 1 }), -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти
				
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				yn({ id = d15(), min = 1, max = 1}), -- случ. дотвард
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости x 2
			
				orr({ id = 'g001ig0026', min = 1, max = 1 }, { id = 'g001ig0130', min = 1, max = 1 }), -- Аура регенерации (+10 реген аое) / Эликсир регенерации (+20 реген)
				orr({ id = 'g001ig0332', min = 1, max = 1 }, { id = 'g001ig0342', min = 1, max = 1 }), -- Зелье ихора Танатоса (яд) / Эликсир норн (страх)
				
				-- зелье лорда
				orr(orr({ id = 'g001ig0529', min = 1, max = 1 }, { id = 'g001ig0531', min = 1, max = 1 }), orr({ id = 'g001ig0528', min = 1, max = 1 }, { id = 'g001ig0525', min = 1, max = 1 })), --   Каталог магических сфер / Зелье слова (свитки) | Честный труд (сапоги) / Эликсир учености (артефакты)
				orr({ id = 'g000ig0010', min = 1, max = 1 }, { id = '', min = 1, max = 1 }), -- Эликсир внимательности / Зелье посмертного зова (талисманы)

				yn({ id = 'g000ig2002', min = 1, max = 1 }), -- св.чаша
				yn({ id = 'g000ig3002', min = 1, max = 1 }), -- д.чаша
				yn({ id = 'g001ig0182', min = 1, max = 1 }), -- счастл. кость
				yn({ id = 'g000ig3017', min = 1, max = 1 }), -- кинж. вамп.
				yn({ id = 'g001ig0048', min = 1, max = 1 }), -- Амулет Кракена (Артефакт)
				
				yn({ id = 'g001ig0610', min = 1, max = 1 }), -- Оковы долга (Реликвия)
				yn({ id = 'g001ig0099', min = 1, max = 1 }), -- перчатки
				yn({ id = 'g000ig4001', min = 1, max = 1 }), -- книга возд
				yn({ id = 'g000ig4002', min = 1, max = 1 }), -- книга воды
				yn({ id = 'g000ig4003', min = 1, max = 1 }), -- книга земли				
				yn({ id = 'g000ig4004', min = 1, max = 1 }), -- книга огня				
				yn({ id = 'g000ig4007', min = 1, max = 1 }), -- Медицинский трактат
				--сапоги
				orr({ id = 'g001ig0113', min = 1, max = 1 }, { id = 'g001ig0110', min = 1, max = 1 }), -- сапоги укрепл / лёгкие	

				--посох
				orr(orr({ id = 'g001ig0394', min = 1, max = 1 }, { id = 'g000ig6012', min = 1, max = 1 }), orr({ id = 'g001ig0395', min = 1, max = 1 }, { id = 'g001ig0399', min = 1, max = 1 })), -- Посох северных стражей+10брони / Посох скорости+10ини / Посох наместника Махаля+10брони / Посох раздора-10ини
				
				--сфера 100,200,400
				yn({ id = 'g001ig0133', min = 1, max = 1 }), -- Сфера Брони I +15брони-1 200
				yn({ id = 'g001ig0446', min = 1, max = 1 }), -- Сфера Вампиризма I +20вамп-1 200
				yn({ id = 'g000ig9017', min = 1, max = 1 }), -- Сфера Восстановления 30хил-аое 200
				yn({ id = 'g001ig0471', min = 1, max = 1 }), -- Сфера Охотника 40урона-1 200
				yn({ id = 'g001ig0464', min = 1, max = 1 }), -- Сфера Разрушения доспеха I -15брони-1 200
				yn({ id = 'g001ig0450', min = 1, max = 1 }), -- Сфера Урона I +20урон-1 200				
				yn({ id = 'g001ig0300', min = 1, max = 1 }), -- Сфера Молнии 80 400
				yn({ id = 'g001ig0187', min = 1, max = 1 }), -- Сфера Пламени 80урон 400
				yn({ id = 'g001ig0453', min = 1, max = 1 }), -- Сфера Святой земли 60хил-ряду 400
				yn({ id = 'g001ig0176', min = 1, max = 1 }), -- Сфера Вампиризма II 40-1 400
				
				--знамя
				yn({ id = 'g000ig1001', min = 1, max = 1 }), -- знамя защиты400
				yn({ id = 'g001ig0051', min = 1, max = 1 }), -- знамя выносл400
				yn({ id = 'g000ig1007', min = 1, max = 1 }), -- знамя силы400
				yn({ id = 'g000ig1005', min = 1, max = 1 }), -- знамя быстроты400
				yn({ id = 'g000ig1003', min = 1, max = 1 }), -- знамя сражения	

				--талик
				orr(orr({ id = 'g001ig0267', min = 1, max = 1}, { id = 'g001ig0266', min = 1, max = 1}), orr({ id = 'g001ig0264', min = 1, max = 1}, { id = 'g000ig9101', min = 1, max = 1})), -- Талисман еретика, Талисман лесного воина, Талисман мертвеца, Талисман Сквайра

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101'), min = 1, max = 1 }, -- свиток л.щит, сила, с.кости, с.витара, свиток устр. гимн, tormentio-броня, слабость, стая
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g000ig5022', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Хождение по лесу"
			}
		},
			guard = gmm({}, guard1()),
	}
}
end

-- Лавка т2
function zoneMerchResp() -- свиток т2
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },
				
				yn({ id = 'g000ig0002', min = 1, max = 2 }), --15
				{ id = 'g000ig0014', min = 1, max = 2 }, --15
				yn({ id = 'g000ig0011', min = 1, max = 2 }), --15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард
				
				yn({ id = 'g001ig0125', min = 1, max = 1 }), -- вард разума
				{ id = 'g001ig0036', min = 1, max = 1 }, -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				yn({ id = d15(), min = 1, max = 1}), -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 1 }, --Зелье магической устойчивости 
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости
				
				orr({ id = 'g000ig0004', min = 1, max = 1 }, { id = 'g001ig0028', min = 1, max = 1 }), -- эликсир твердости / аура выносл
				orr({ id = 'g001ig0328', min = 1, max = 1 }, { id = 'g001ig0330', min = 1, max = 1 }), -- Эликсир ледяной плоти (мороз) / Эликсир Неопалимых (горение)

				orr({ id = 'g001ig0528', min = 1, max = 1 }, { id = 'g001ig0525', min = 1, max = 1 }), -- Честный труд (сапоги) / Эликсир учености (артефакты)
				orr({ id = 'g001ig0524', min = 1, max = 1 }, { id = 'g001ig0376', min = 1, max = 1 }), -- Зелье завоевателя (жезлы) / Эликсир обновления (+30 реген)
				
				yn({ id = 'g001ig0047', min = 1, max = 1 }), -- рун.жизн800
				yn({ id = 'g001ig0197', min = 1, max = 1 }), -- прокл.пепел950
				yn({ id = 'g001ig0487', min = 1, max = 1 }), -- Кольцо темных искуств (Артефакт)650
				yn({ id = 'g001ig0558', min = 1, max = 1 }), -- Рог возмездия (Артефакт) 700
				yn({ id = 'g001ig0417', min = 1, max = 1 }), -- Руна верности Моккуркальфи (Артефакт)
				yn({ id = 'g001ig0045', min = 1, max = 1 }), -- кров.свят800
				yn({ id = 'g000ig3003', min = 1, max = 1 }), -- кол.силы800
				yn({ id = 'g001ig0594', min = 1, max = 1 }), -- Щит телохранителя (Артефакт)
				yn({ id = 'g001ig0592', min = 1, max = 1 }), -- Монолитный щит (Артефакт)
				yn({ id = 'g000ig9137', min = 1, max = 1 }), -- серд.эмира800
				yn({ id = 'g001ig0071', min = 1, max = 1 }), -- Эльфийская брошь (Артефакт) 1000 15крит
				
				yn({ id = 'g001ig0104', min = 1, max = 1 }), -- зуб людоеда
				yn({ id = 'g000ig3022', min = 1, max = 1 }), -- р.лютня650
				orr({ id = 'g000ig4006', min = 1, max = 1 }, { id = 'g001ig0497', min = 1, max = 1 }), -- книга т.з. / книга колдовства
				yn({ id = 'g001ig0420', min = 1, max = 1 }), -- Вечные латы (Реликвия)800
				yn({ id = 'g001ig0424', min = 1, max = 1 }), -- Длани ангела (Реликвия)
				yn({ id = 'g001ig0422', min = 1, max = 1 }), -- Кровавый покров (Реликвия)
				
				orr({ id = 'g001ig0114', min = 1, max = 1 }, { id = 'g000ig8003', min = 1, max = 1 }), -- сапоги тяж 500 / Сапоги скорости 700

				--посох
				orr(orr({ id = 'g001ig0404', min = 1, max = 1 }, { id = 'g001ig0401', min = 1, max = 1 }), { id = 'g001ig0398', min = 1, max = 1 }), -- Посох Ниграэля-15урона / Посох проклятой метки-15урона | Посох скальда+15ини
				
				--сфера 400-500
				yn({ id = 'g001ig0456', min = 1, max = 1 }), -- Сфера Прилива 80 400
				yn({ id = 'g001ig0496', min = 1, max = 1 }), -- Сфера Мучений 80 400
				yn({ id = 'g000ig9042', min = 1, max = 1 }), -- Сфера направленного ослабления I -33урон-1 400
				yn({ id = 'g001ig0475', min = 1, max = 1 }), -- Сфера Обширной коррозии I-10броня-аое 400
				yn({ id = 'g000ig9018', min = 1, max = 1 }), -- Сфера Прорицательницы 55хил аое 400
				yn({ id = 'g001ig0134', min = 1, max = 1 }), -- Сфера Урона II +40урон-1 400
				yn({ id = 'g001ig0478', min = 1, max = 1 }), -- Сфера Переохлаждения 40мороз непр. 500
				yn({ id = 'g001ig0467', min = 1, max = 1 }), -- Сфера Бури 66 2x2 500
				yn({ id = 'g001ig0057', min = 1, max = 1 }), -- Сфера защиты от магии Смерти 400
				yn({ id = 'g000ig9024', min = 1, max = 1 }), -- Сфера Жажды 45вамп 500

				--знамя
				yn({ id = 'g001ig0289', min = 1, max = 1 }), -- знамя гор.стр700
				yn({ id = 'g000ig1006', min = 1, max = 1 }), -- знамя скорости700
				yn({ id = 'g001ig0145', min = 1, max = 1 }), -- знамя разум700
				yn({ id = 'g000ig1008', min = 1, max = 1 }), -- знамя энерг700
				yn({ id = 'g001ig0370', min = 1, max = 1 }), -- Знамя искоренителя ереси600
				yn({ id = 'g002ig0003', min = 1, max = 1 }), -- Стяг главаря наемников800

				--талик
				orr3({ id = 'g001ig0184', min = 1, max = 1 }, { id = 'g000ig9109', min = 1, max = 1 }, { id = 'g000ig9120', min = 1, max = 1 }), -- Талисман Восстановления 400 / Талисман призыва нейтралов II 450 / Талисман щита стихий 500

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rnd('g001ig0164','g001ig0253','g001ig0255','g001ig0256','g000ig5050','g001ig0254','g000ig5020','g000ig5069'), min = 1, max = 1 }, -- Свиток "Infernus"-крит, прокл.эмира-урон, спеш.время+ини.урон, могущество+урон, "Chronos"-ини, "Terebrare corde"+точ.урон, "Приказ Сира Аллемона"+точ.урон.ини, "Проклятие Ниграэля"-урон
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g000ig5119', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Водосточный Колодец"
				
			}
		},
		guard = gmm({}, guard2()),
	},
	
		{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },
				
				yn({ id = 'g000ig0002', min = 1, max = 2 }), --15
				yn({ id = 'g000ig0014', min = 1, max = 2 }), --15
				{ id = 'g000ig0011', min = 1, max = 2 }, --ини15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард

				{ id = 'g001ig0125', min = 1, max = 1 }, -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				yn({ id = d15(), min = 1, max = 1}), -- случ. дотвард
				{ id = 'g002ig0005', min = 1, max = 1 }, --Зелье наблюдательности
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости x 2
				
				orr({ id = 'g000ig0016', min = 1, max = 1 }, { id = 'g001ig0022', min = 1, max = 1 }), -- эликсир мощи / Аура меткости
				orr({ id = 'g001ig0344', min = 1, max = 1 }, { id = 'g001ig0346', min = 1, max = 1 }), -- Эликсир предназначения (замедление) / Эликсир неудержимости (ослабление)

				orr({ id = 'g001ig0529', min = 1, max = 1 }, { id = 'g001ig0531', min = 1, max = 1 }), -- Каталог магических сфер / Зелье слова (свитки)
				orr({ id = 'g001ig0524', min = 1, max = 1 }, { id = 'g001ig0561', min = 1, max = 1 }), -- Зелье завоевателя (жезлы) / Эликсир самопожертвования -телохр.25

				yn({ id = 'g001ig0040', min = 1, max = 1 }), -- пер.песк1000
				yn({ id = 'g001ig0155', min = 1, max = 1 }), -- Благословенный браслет (Артефакт)				
				yn({ id = 'g001ig0042', min = 1, max = 1 }), -- клыки бездны
				yn({ id = 'g001ig0196', min = 1, max = 1 }), -- рун.мол800
				yn({ id = 'g001ig0582', min = 1, max = 1 }), -- Камень врат (Артефакт)800
				yn({ id = 'g001ig0559', min = 1, max = 1 }), -- Руна благоволения Тиу (Артефакт) 700
				yn({ id = 'g001ig0557', min = 1, max = 1 }), -- Рог непреклонности (Артефакт) 700
				yn({ id = 'g001ig0416', min = 1, max = 1 }), -- Руна предвидения Вотана (Артефакт) 800
				yn({ id = 'g001ig0589', min = 1, max = 1 }), -- Щит неведения (Артефакт)
				yn({ id = 'g000ig2003', min = 1, max = 1 }), -- Наручи с черепом (Артефакт)
				yn({ id = 'g001ig0591', min = 1, max = 1 }), -- Щит отражения (Артефакт) 900

				yn({ id = 'g000ig2006', min = 1, max = 1 }), -- таира чистоты
				yn({ id = 'g000ig3020', min = 1, max = 1 }), -- череп танатоса
				orr({ id = 'g000ig4006', min = 1, max = 1 }, { id = 'g001ig0497', min = 1, max = 1 }), -- книга т.з. / книга колдовства
				yn({ id = 'g000ig3022', min = 1, max = 1 }), -- р.лютня650
				yn({ id = 'g001ig0423', min = 1, max = 1 }), -- Латы Спасителя (Реликвия)
				yn({ id = 'g001ig0430', min = 1, max = 1 }), -- Роба убийцы (Реликвия)
				yn({ id = 'g002ig0002', min = 1, max = 1 }), -- Промасленная кольчуга (Реликвия) 700
				

				orr({ id = 'g001ig0111', min = 1, max = 1 }, { id = 'g000ig1010', min = 1, max = 1 }), -- сапоги асс 500 / эльфийские сапоги 700

				--посох
				orr({ id = 'g001ig0392', min = 1, max = 1 }, orr({ id = 'g000ig6019', min = 1, max = 1 }, { id = 'g001ig0403', min = 1, max = 1 })), -- Посох знаний Фрегги+40хил | Посох Листвы+лес / Посох неизбежной кары +10 урона и точности
				
				--сфера 400-500	
				yn({ id = 'g001ig0191', min = 1, max = 1 }), -- Сфера Вампира 70 400
				yn({ id = 'g001ig0474', min = 1, max = 1 }), -- Сфера Скалы 80урон-1 400
				yn({ id = 'g001ig0461', min = 1, max = 1 }), -- Сфера Массового ослабления I -33урон аое 400
				yn({ id = 'g001ig0479', min = 1, max = 1 }), -- Сфера Разрушения доспеха II -30брони-1 400
				yn({ id = 'g001ig0454', min = 1, max = 1 }), -- Сфера Помощи 75хил 2x2 400
				yn({ id = 'g001ig0295', min = 1, max = 1 }), -- Сфера Замедления 50-1 400
				yn({ id = 'g001ig0469', min = 1, max = 1 }), -- Сфера Пожара 55крест 500
				yn({ id = 'g001ig0304', min = 1, max = 1 }), -- Сфера Боли 60 ряд 500
				yn({ id = 'g001ig0058', min = 1, max = 1 }), -- Сфера защиты от магии Разума 400
				yn({ id = 'g001ig0468', min = 1, max = 1 }), -- Сфера Оползня 50урон 2колоны 500

				--знамя
				yn({ id = 'g001ig0293', min = 1, max = 1 }), -- знамя бан.неуд700
				yn({ id = 'g001ig0292', min = 1, max = 1 }), -- знамя стяг.конц700
				yn({ id = 'g001ig0361', min = 1, max = 1 }), -- Знамя горна700
				yn({ id = 'g001ig0358', min = 1, max = 1 }), -- Знамя ража
				yn({ id = 'g001ig0357', min = 1, max = 1 }), -- Знамя неистовства
				yn({ id = rnd('g001ig0142','g001ig0140','g001ig0141','g001ig0139'), min = 1, max = 1 }), -- Знамя магии Воды / Воздуха / Земли / Огня700

				--талик
				orr3({ id = 'g001ig0184', min = 1, max = 1 }, { id = 'g000ig9109', min = 1, max = 1 }, { id = 'g000ig9120', min = 1, max = 1 }), -- Талисман Восстановления 400 / Талисман призыва нейтралов II 450 / Талисман щита стихий 500

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rnd('g001ig0164','g001ig0253','g001ig0255','g001ig0256','g000ig5050','g001ig0254','g000ig5020','g000ig5069'), min = 1, max = 1 }, -- Свиток "Infernus"-крит, прокл.эмира-урон, спеш.время+ини.урон, могущество+урон, "Chronos"-ини, "Terebrare corde"+точ.урон, "Приказ Сира Аллемона"+точ.урон.ини, "Проклятие Ниграэля"-урон
				orr({ id = 'g001ig0194', min = 1, max = 1 }, { id = 'g000ig5119', min = 1, max = 1 }), -- Свиток "Лисья хитрость" / Свиток "Водосточный Колодец"

			}
		},
		guard = gmm({}, guard2()),
	},

}
end

-- Лавка т3
function zoneMerchZone34() -- свиток т3
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 550, max = 550 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g000ig0018', min = 1, max = 2 },

				yn({ id = 'g000ig0012', min = 1, max = 2 }), --ини30
				yn({ id = 'g000ig0015', min = 1, max = 2 }), --урон30
				yn({ id = 'g000ig0003', min = 1, max = 2 }), --защита30

				{ id = 'g000ig0002', min = 1, max = 2 }, --защита15
				yn({ id = 'g000ig0014', min = 1, max = 2 }), --атака15
				yn({ id = 'g000ig0011', min = 1, max = 2 }), --ини15
				{ id = 'g000ig0008', min = 1, max = 2 }, --точность15
				
				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард воздух
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард вода
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард земля
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард огонь
				{ id = w15(), min = 1, max = 1 }, -- сл.вард
				{ id = w15(), min = 1, max = 1 }, -- сл.вард
								
				yn({ id = 'g001ig0128', min = 1, max = 1 }), -- вард оружия
				yn({ id = 'g001ig0125', min = 1, max = 2 }), -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости 
				orr({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности
				
				orr({ id = 'g001ig0127', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }), -- Эликсир жизненной силы / целебная мазь

				orr({ id = 'g001ig0563', min = 1, max = 1 }, { id = 'g001ig0021', min = 1, max = 1 }), -- Аура внимательности (крит) / Аура слепой ярости (+10 урона оае)
				orr({ id = 'g001ig0340', min = 1, max = 1 }, { id = 'g001ig0338', min = 1, max = 1 }), -- Эликсир непорочности (превращение) / Эликсир непоколебимости (паралич)
				orr({ id = 'g001ig0523', min = 1, max = 1 }, { id = 'g001ig0548', min = 1, max = 1 }), -- Зелье воеводы (опыт 10) / Зелье удачи (10 крит)
				
				orr({ id = 'g001ig0526', min = 1, max = 1 }, { id = 'g001ig0527', min = 1, max = 1 }), -- Зелье оруженосца (знамёна) / Зелье постижения (реликвии)
				orr({ id = 'g001ig0519', min = 1, max = 1 }, { id = 'g001ig0083', min = 1, max = 1 }), -- Война престолов (-10 воры) 500 / Зелье рвения (+5 ини и точности)


				yn({ id = 'g000ig3004', min = 1, max = 1 }), -- рун.клин1200
				yn({ id = 'g000ig2004', min = 1, max = 1 }), -- рог.всев1200
				yn({ id = 'g001ig0124', min = 1, max = 1 }), -- клин.возв1200
				yn({ id = 'g000ig3019', min = 1, max = 1 }), -- Клинок Танатоса (Артефакт)
				yn({ id = 'g001ig0612', min = 1, max = 1 }), -- Кольцо небесной воли (Артефакт)
				yn({ id = 'g001ig0488', min = 1, max = 1 }), -- Кольцо Несгибаемого стража (Артефакт)
				yn({ id = 'g001ig0413', min = 1, max = 1 }), -- Корни триббога (Артефакт) 1200
				yn({ id = 'g001ig0415', min = 1, max = 1 }), -- Руна кары Тьяцци (Артефакт) 1150
				yn({ id = 'g001ig0590', min = 1, max = 1 }), -- Щит Мизраэля (Артефакт)
				yn({ id = 'g001ig0060', min = 1, max = 1 }), -- Тысяча чешуек (Артефакт)
				yn({ id = 'g001ig0603', min = 1, max = 1 }), -- Чаша жатвы (Артефакт) 1000
				yn({ id = 'g001ig0657', min = 1, max = 1 }), -- Топор палача (Артефакт) 1000
				yn({ id = 'g002ig0013', min = 1, max = 1 }), -- Серп Кровавого Ворона (Артефакт) 1450
				yn({ id = 'g002ig0010', min = 1, max = 1 }), -- Меч рыцаря Феникса (Артефакт) 2250
				
				yn({ id = 'g002ig0015', min = 1, max = 1 }), -- Кираса Кровавого Ворона (Реликвия) 1500
				yn({ id = 'g000ig2006', min = 1, max = 1 }), -- р.таира800
				yn({ id = 'g001ig0156', min = 1, max = 1 }), -- р.шкатулка800
				yn({ id = 'g000ig3022', min = 1, max = 1 }), -- р.лютня650
				yn({ id = 'g000ig4006', min = 1, max = 1 }), -- книга т.з.
				yn({ id = 'g001ig0597', min = 1, max = 1 }), -- Кираса резонанса (Реликвия)
				yn({ id = 'g001ig0427', min = 1, max = 1 }), -- Нагрудник Стража (Реликвия)
				yn({ id = 'g001ig0539', min = 1, max = 1 }), -- Тисовый лук (Реликвия)
				yn({ id = 'g001ig0605', min = 1, max = 1 }), -- Книга постижения
				yn({ id = 'g001ig0602', min = 1, max = 1 }), -- Доспех жатвы (Реликвия)800

				orr({ id = 'g001ig0501', min = 1, max = 1 }, { id = 'g001ig0606', min = 1, max = 1 }), -- Дары Галлеана (лес) 900 | Сапоги родных земель 1000

				--посох
				orr(orr({ id = 'g000ig6020', min = 1, max = 1 }, { id = 'g001ig0380', min = 1, max = 1 }), orr({ id = 'g000ig6021', min = 1, max = 1 }, { id = 'g001ig0391', min = 1, max = 1 })), -- Посох Возни-15точ-10урона / Посох врат Бездны-белик / Посох Зов Леса-энт2 / Посох оракула+60хил

				--сфера 600,700,800-1,x				
				yn({ id = 'g000ig9020', min = 1, max = 1 }), -- Сфера Энергии +25аоеурон 500
				yn({ id = 'g001ig0443', min = 1, max = 1 }), -- Сфера Брони II 25 600
				yn({ id = 'g000ig9021', min = 1, max = 1 }), -- Сфера Вампиризма III 60 700
				yn({ id = 'g000ig9016', min = 1, max = 1 }), -- Сфера Великого исцеления 80 700
				yn({ id = 'g001ig0203', min = 1, max = 1 }), -- Сфера Массового ослабления II 50 700
				yn({ id = 'g001ig0466', min = 1, max = 1 }), -- Сфера Морской пучины 110урон 700
				yn({ id = 'g001ig0480', min = 1, max = 1 }), -- Сфера Горы урон110 800
				yn({ id = 'g001ig0455', min = 1, max = 1 }), -- Сфера Спасения 100хил 2колонны 700
				yn({ id = 'g001ig0489', min = 1, max = 1 }), -- Сфера Угнетения 110 урон 700
				yn({ id = 'g001ig0131', min = 1, max = 1 }), -- Сфера Урона III +урон60 700
				
				orr(orr({ id = 'g001ig0056', min = 1, max = 1 }, { id = 'g001ig0054', min = 1, max = 1 }), orr({ id = 'g001ig0055', min = 1, max = 1 }, { id = 'g001ig0053', min = 1, max = 1 })), -- сфера защиты воды / воздуха / земли / огня
--				yn({ id = spherex(), min = 1, max = 1 }), -- сфера икс

				--знамя
				yn({ id = 'g000ig1002', min = 1, max = 1 }), -- знамя неуязв700
				yn({ id = 'g001ig0362', min = 1, max = 1 }), -- Знамя болот
				yn({ id = 'g001ig0364', min = 1, max = 1 }), -- Знамя ветра перемен
				yn({ id = 'g001ig0587', min = 1, max = 1 }), -- Знамя мастера
				yn({ id = 'g001ig0363', min = 1, max = 1 }), -- Знамя отваги
				yn({ id = 'g001ig0374', min = 1, max = 1 }), -- Знамя стального листопада
				yn({ id = 'g001ig0365', min = 1, max = 1 }), -- Ловец Кошмаров
				yn({ id = 'g001ig0375', min = 1, max = 1 }), -- Знамя наследия
				yn({ id = 'g001ig0373', min = 1, max = 1 }), -- Знамя магического иммунитета
				yn({ id = 'g001ig0373', min = 1, max = 1 }), -- Знамя магического иммунитета

				--талик
				orr(orr({ id = 'g000ig9128', min = 1, max = 1}, { id = 'g001ig0259', min = 1, max = 1}), orr({ id = 'g001ig0063', min = 1, max = 1}, { id = 'g000ig9116', min = 1, max = 1})), -- Талисман Молнии 800 / Талисман призыва нейтралов III 600 / Талисман Прилива 800 / Талисман Святой земли 800

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				orr(orr({ id = 'g000ig5073', min = 1, max = 1 },{ id = 'g000ig5012', min = 1, max = 1 }), orr({ id = 'g000ig5013', min = 1, max = 1 },{ id = 'g000ig5026', min = 1, max = 1 })), -- Свиток "Прикосновение Мортис" / Свиток "Благословение Всевышнего"  | Свиток "Святая сила" / Свиток "Гимн кланов"		
				orr({ id = 'g000ig5119', min = 1, max = 1 }, { id = 'g001ig0492', min = 1, max = 1 }), -- Свиток "Водосточный колодец" / Свиток "Проведение Всевышнего" (сферы) 
			}
		},
		guard = gmm({}, guard3()),
	},
	
}
end

-- Предметы т4 (предметы)
function itemsMerchZone5()
return {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 2, max = 3 }, --хил75
				{ id = 'g000ig0018', min = 1, max = 2 },

				yn({ id = 'g000ig0012', min = 1, max = 2 }), --ини30
				yn({ id = 'g000ig0015', min = 1, max = 2 }), --урон30
				yn({ id = 'g000ig0003', min = 1, max = 2 }), --защита30

				{ id = 'g000ig0002', min = 1, max = 1 }, --15
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				yn({ id = 'g000ig0011', min = 1, max = 1 }), --15
				yn({ id = 'g000ig0008', min = 1, max = 1 }), --15
				
				yn({ id = 'g000ig0021', min = 1, max = 1 }), -- вард
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард вода
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард земля
				yn({ id = 'g000ig0024', min = 1, max = 1 }), -- вард				

				yn({ id = 'g001ig0128', min = 1, max = 1 }), -- вард оружия
				yn({ id = 'g001ig0125', min = 1, max = 1 }), -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости 
				orr({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности

				orr(orr({ id = 'g001ig0534', min = 1, max = 1 }, { id = 'g001ig0352', min = 1, max = 1 }), orr({ id = 'g001ig0356', min = 1, max = 1 }, { id = 'g001ig0312', min = 1, max = 1 })), -- Экстракт таинственной энергии-смена-атак / Эликсир гонителя нечисти-вамп-там / Зелье вознесения-вард-урон / Эликсир предвиденья =15точн-1

				yn({ id = 'g001ig0411', min = 1, max = 1 }), -- Грань реальности (Артефакт)
				yn({ id = 'g001ig0604', min = 1, max = 1 }), -- Кинжал жатвы (Артефакт)
				yn({ id = 'g001ig0585', min = 1, max = 1 }), -- Кольцо создателя (Артефакт)
				yn({ id = 'g001ig0046', min = 1, max = 1 }), -- Кровь Владыки (Артефакт)
				yn({ id = 'g001ig0410', min = 1, max = 1 }), -- Дьявольская булава (Артефакт)
				yn({ id = 'g001ig0102', min = 1, max = 1 }), -- Коготь Пожирателя (Артефакт)
				yn({ id = 'g000ig2005', min = 1, max = 1 }), -- Гравированная диадема (Артефакт)
				yn({ id = 'g000ig9035', min = 1, max = 1 }), -- Слеза Мортис (Артефакт)
				yn({ id = 'g002ig0017', min = 1, max = 1 }), -- Копье Ангела (Артефакт) 1750
				yn({ id = 'g002ig0014', min = 1, max = 1 }), -- Кама Кровавого Ворона (Артефакт) 1750
				yn({ id = 'g002ig0011', min = 1, max = 1 }), -- Щит рыцаря Феникса (Артефакт) 2400
			
				yn({ id = 'g002ig0012', min = 1, max = 1 }), -- Доспех рыцаря Феникса (Реликвия) 2600
				yn({ id = 'g001ig0419', min = 1, max = 1 }), -- Шлем воителя (Реликвия)1000
				yn({ id = 'g001ig0116', min = 1, max = 1 }), -- р.плас.досп1200
				yn({ id = 'g000ig7010', min = 1, max = 1 }), -- р.кор.имп1800
				yn({ id = 'g001ig0038', min = 1, max = 1 }), -- р.тяж.латы1550
				yn({ id = 'g000ig3005', min = 1, max = 1 }), -- р.кор.мьолн1200
--				yn({ id = 'g001ig0596', min = 1, max = 1 }), -- Линарет (Реликвия)

				yn({ id = 'g001ig0115', min = 1, max = 1 }), -- сапоги поступ1100
				yn({ id = 'g001ig0112', min = 1, max = 1 }), -- сапоги ангел800

				--посох
				orr({ id = 'g001ig0097', min = 1, max = 1 }, { id = 'g000ig6019', min = 1, max = 1 }), -- Посох озер / Посох Листвы 

				--сфера 700-1000
				yn({ id = 'g000ig9025', min = 1, max = 1 }), -- Сфера Алчности 60 вамп аое 900
				yn({ id = 'g000ig9014', min = 1, max = 1 }), -- Сфера Массового замедления 50 1000
				yn({ id = 'g001ig0136', min = 1, max = 1 }), -- Сфера Брони III 35 800
				yn({ id = 'g001ig0457', min = 1, max = 1 }), -- Сфера Испепеления 110урон 700
				yn({ id = 'g000ig9028', min = 1, max = 1 }), -- Сфера Грозы 110урон 700
				yn({ id = 'g001ig0183', min = 1, max = 1 }), -- Сфера Обширной коррозии II -20брони аое 700
				yn({ id = 'g001ig0303', min = 1, max = 1 }), -- Сфера Древнего вамп100 800
				yn({ id = 'g001ig0059', min = 1, max = 1 }), -- Сфера защиты от Оружия 800
				yn({ id = 'g001ig0459', min = 1, max = 1 }), -- Сфера Землетрясения 75 колонны 900
				yn({ id = 'g001ig0477', min = 1, max = 1 }), -- Сфера Терзаний 85 ряд 900
				yn({ id = 'g000ig9027', min = 1, max = 1 }), -- Сфера Урагана 99 2x2 900
				yn({ id = 'g000ig9032', min = 1, max = 1 }), -- Сфера цунами 90 неприкр 900
				yn({ id = 'g001ig0462', min = 1, max = 1 }), -- Сфера направленного ослабления II 50 700
				
				--талик
				orr5({id = 'g000ig9130', min = 1, max = 1}, {id = 'g000ig9136', min = 1, max = 1}, {id = 'g001ig0185', min = 1, max = 1}, {id = 'g000ig9123', min = 1, max = 1}, {id = 'g001ig0202', min = 1, max = 1}), -- Талисман Бури 1000 / Талисман Горы 1600 / Талисман Землетрясения 1800 / Талисман Пожара 1000 / Талисман призыва нейтралов IV 1000
				
				--свитки
				orr(orr({ id = 'g000ig5091', min = 1, max = 1 }, { id = 'g000ig5055', min = 1, max = 1 }), orr({ id = 'g000ig5076', min = 1, max = 1 }, { id = 'g000ig5114', min = 1, max = 1 })), -- Tempus status (-33 ини) / Tortio menta (-33 точность) | Гниение (-33 дамаг) / Плесень (-30 броня)
				yn({ id = 'g000ig5029', min = 1, max = 1 }), -- рит. исцеления
				yn({ id = 'g000ig5110', min = 1, max = 1 }), -- Свиток "Излечение" 

}
end

-- Лавка т4
function zoneMerchZone5() -- свитки т2+т3
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 950, max = 950 },
			itemValue = { min = 400, max = 550 },
			items = itemsMerchZone5()
		}
	}
	}
end

----------------------

-- Руины Респ 0

local valueRuinRespZ0 = { min = 165*kef, max = 175*kef }
--local goldRuinRespZ0 = { min = 200, max = 220 } 

function zoneRuinRespZ0()
return {
	{
		gold = { min = gmm(200,300), max = gmm(220,350)},
		loot = {
			items = {
				{id = ruin0(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),		
			value = valueRuinRespZ0
		}
	},
	{
		gold = { min = gmm(220,350), max = gmm(240,385)},
		loot = {
--			itemTypes = { Item.Armor, Item.Weapon, Item.Jewel }, -- 2+2+3
--			value = { min = 300, max = 300 },
--			itemValue = { min = 300, max = 300 }
			items = {
				-- Рунный камень (Артефакт) / Цепи жертвенности (Артефакт) / Гномьи наручи (Артефакт) / Цеп Хана (Артефакт) / Обод мертвых (Реликвия) / Фолиант Мысли / Череп Хана (Реликвия)
				{id = rnd('g000ig2001','g001ig0611','g000ig3001','g001ig0100','g000ig3008','g000ig4008','g001ig0101'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
}
end

-- Руины зона 1
--local valueRuinRespZ = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
--local goldRuinRespZ = { min = 250, max = 275 } 

function zoneRuinRespZ()
return {
	{
		gold = { min = gmm(250,400), max = gmm(275,450)},
		loot = {
--			itemTypes = { Item.Armor, Item.Weapon, Item.Jewel }, --2+1+6
--			value = { min = 400, max = 450 },
--			itemValue = { min = 400, max = 450 }
			items = {
				-- Загробный фонарь (Артефакт) / Руна защиты Фрейра (Артефакт) / Потайной кинжал (Артефакт) / Книга божественных даров / Книга колдовства / Книга наследия / Книга странника / Кожаные эльфийские доспехи (Реликвия) / Куртка капитана (Реликвия) 
				{id = rnd('g001ig0609','g001ig0418','g002ig0001','g001ig0493','g001ig0497','g001ig0495','g001ig0494','g001ig0428','g001ig0426'), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
		}
	},
	{
		gold = { min = gmm(250,400), max = gmm(275,450)},
		loot = {
--			itemTypes = { Item.Banner, Item.Talisman, Item.TravelItem }, --6(-1)+3+2
--			value = { min = 400, max = 500 },
--			itemValue = { min = 400, max = 500 }
			items = {
				-- Знамя мастера / Знамя быстроты / Знамя выносливости / Знамя защиты / Знамя силы / Знамя сражения / Талисман Восстановления / Талисман призыва нейтралов II / Сапоги ассасина / Тяжелые сапоги
				{id = rnd('g001ig0587','g000ig1005','g001ig0051','g000ig1001','g000ig1007','g000ig1003','g001ig0184','g000ig9109','g001ig0111','g001ig0114'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
		}
	},
}
end


-- Руины зона 2
--local valueRuinResp = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
--local goldRuinResp = { min = 300, max = 330 } 

function zoneRuinResp()
return {
	{
		gold = { min = gmm(300,500), max = gmm(330,550)},
		loot = {
--			itemTypes = { Item.Jewel, Item.Weapon }, --6+3
--			value = { min = 550, max = 700 },
--			itemValue = { min = 550, max = 700 },
			items = {
				-- Кровавый покров (Реликвия) / Латы Спасителя (Реликвия) / Лютня Очарования (Реликвия) / Нагрудник Стража (Реликвия) / Промасленная кольчуга (Реликвия) / Дьявольская чаша (Артефакт) / Кинжал Вампиризма (Артефакт) / Кольцо темных искуств (Артефакт)
				{id = rnd('g001ig0422','g001ig0423','g000ig3022','g001ig0427','g002ig0002','g000ig3002','g000ig3017','g001ig0487'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
		}
	},

	{
		gold = { min = gmm(300,500), max = gmm(330,550)},
		loot = {
--			itemTypes = { Item.Armor, Item.TravelItem }, --5+2
--			value = { min = 550, max = 700 },
--			itemValue = { min = 550, max = 700 },
			items = {
				-- Камень врат (Артефакт) / Рог возмездия (Артефакт) / Рог непреклонности (Артефакт) / Руна благоволения Тиу (Артефакт) / Щит телохранителя (Артефакт) / Сапоги скорости / Эльфийские сапоги
				{id = rnd('g001ig0582','g001ig0558','g001ig0557','g001ig0559','g001ig0594','g000ig8003','g000ig1010'), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
		}
	}	
}
end

-- Руины зона 3
--local valueRuinZone = { min = 800*kef, max = 840*kef }
--local goldRuinZone = { min = 350, max = 385 }

function zoneRuinZone34()
return {
	{
		gold = { min = gmm(350,600), max = gmm(385,650)},
		loot = {
--				itemTypes = { Item.Jewel, Item.Weapon, Item.Armor }, --8+3+8
--				value = { min = 850, max = 1090 },
--				itemValue = { min = 850, max = 1090 }
			items = {
				-- Длани ангела (Реликвия) / Кафтан первооткрывателя (Реликвия) / Роба убийцы (Реликвия) / Тисовый лук (Реликвия) / Шкатулка предсказаний (Реликвия) / Шлем воителя (Реликвия) /
				-- Кольцо Несгибаемого стража (Артефакт) / Проклятый пепел (Артефакт) / Топор палача (Артефакт) / Клинок Возвышенного (Артефакт) / Клыки Бездны (Артефакт) / Кольцо небесной воли (Артефакт) / Перстень песков (Артефакт) / 
				-- Чаша жатвы (Артефакт) / Череп шамана (Артефакт) / Щит отражения (Артефакт) / Эльфийская брошь (Артефакт) 
				{id = rnd('g001ig0424','g001ig0425','g001ig0430','g001ig0539','g001ig0156','g001ig0419','g001ig0488','g001ig0197','g001ig0657','g001ig0124','g001ig0042','g001ig0612','g001ig0040','g001ig0603','g001ig0041','g001ig0591','g001ig0071'), min = 1, max = 1},
			},
		
		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(800,900)*kef, max = gmm(840,945)*kef }
		}
	},
	{
		gold = { min = gmm(385,650), max = gmm(420,710)},
		loot = {
--				itemTypes = { Item.Banner }, --22
--				value = { min = 600, max = 750 },
--				itemValue = { min = 600, max = 750 }
			items = {
				-- Баннер неудержимых /  /  /  /  /  / 
				{id = rnd('g001ig0293','g000ig1004','g001ig0361','g001ig0289','g001ig0370','g001ig0142','g001ig0140','g001ig0141','g001ig0139','g001ig0145','g001ig0143','g001ig0373','g001ig0357','g000ig1002','g001ig0363','g000ig1006','g001ig0369','g000ig1008','g001ig0365','g001ig0292','g001ig0367'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(800,900)*kef, max = gmm(840,945)*kef }
		}
	},
	
}
end

-- Руины зона 4
local valueRuinZone5 = { min = 1600*kef, max = 1700*kef }

function zoneRuinZone5()
return {
	{
		gold = { min = gmm(420,700), max = gmm(460,750)},
		loot = {
--				itemTypes = { Item.Weapon, Item.Talisman }, 
--				value = { min = 1150, max = 1500 },
--				itemValue = { min = 1150, max = 1500 }
			items = {
				-- Божественный потир (Артефакт) / Грань реальности (Артефакт) / Дьявольская булава (Артефакт) / Клинок Танатоса (Артефакт) / Корни триббога (Артефакт) / Руна кары Тьяцци (Артефакт) / Рунический клинок (Артефакт) / Серп Кровавого Ворона (Артефакт) / Слеза Мортис (Артефакт) / Талисман призыва нейтралов V
				{id = rnd('g001ig0174','g001ig0411','g001ig0410','g000ig3019','g001ig0413','g001ig0415','g000ig3004','g002ig0013','g000ig9035','g000ig9103'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	{
		gold = { min = gmm(420,700), max = gmm(460,750)},
		loot = {
--				itemTypes = { Item.Armor, Item.Jewel }, 
--				value = { min = 1150, max = 1500 },
--				itemValue = { min = 1150, max = 1500 }
			items = {
				-- Кинжал жатвы (Артефакт) / Кольцо создателя (Артефакт) / Кровь Владыки (Артефакт) / Монолитный щит (Артефакт) / Рог всеведенья (Артефакт) / Тысяча чешуек (Артефакт) / Щит Мизраэля (Артефакт) / Кираса Кровавого Ворона (Реликвия) / Корона Мьольнира (Реликвия) / Пластинчатый доспех (Реликвия) 
				{id = rnd('g001ig0604','g001ig0585','g001ig0046','g001ig0592','g000ig2004','g001ig0060','g001ig0590','g002ig0015','g000ig3005','g001ig0116'), min = 1, max = 1},
			},
		
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},		
	{
		gold = { min = gmm(420,700), max = gmm(460,750)},
		loot = {
			items = {
				orr(orr({ id = 'g001ig0312', min = 1, max = 1}, { id = 'g001ig0310', min = 1, max = 1}), orr({ id = 'g001ig0314', min = 1, max = 1}, { id = 'g001ig0356', min = 1, max = 1})), -- Эликсир предвиденья 15точность, Эликсир опережения 15ини, Эликсир наследия 15урон, Зелье вознесения вард-урон
			},
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	}
end

-- Руины зоны тренера
local valueRuinZoneTrainers = { min = 1900*kef, max = 2000*kef }

function zoneRuinTrainers()
return {
	{
		gold = { min = gmm(500,800), max = gmm(550,850)},
		loot = {
			items = {
				{id = ruinTrainers(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers
		}
	},
}
end

---------------------

-- Источники Респ
function getMinesRespZ(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.lifeMana = 1
	elseif race == Race.Dwarf then
		mines.runicMana = 1
	elseif race == Race.Undead then
		mines.deathMana = 1
	elseif race == Race.Heretic then
		mines.infernalMana = 1
	elseif race == Race.Elf then
		mines.groveMana = 1
	end
		
	return mines
end

-- Источники т1
function getMinesRespZ2(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.runicMana = 1
		mines.groveMana = 1
	elseif race == Race.Dwarf then
		mines.lifeMana = 1
		mines.groveMana = 1
	elseif race == Race.Undead then
		mines.infernalMana = 1
		mines.groveMana = 1
	elseif race == Race.Heretic then
		mines.deathMana = 1
		mines.groveMana = 1
	elseif race == Race.Elf then
		mines.infernalMana = 1
		mines.lifeMana = 1
	end
	return mines		
end

-- Источники т2
function getMinesResp(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.lifeMana = 1
		mines.runicMana = 1
		mines.infernalMana = 1
		mines.deathMana = 1
	elseif race == Race.Dwarf then
		mines.runicMana = 1
		mines.lifeMana = 1
		mines.deathMana = 1
		mines.infernalMana = 1
	elseif race == Race.Undead then
		mines.deathMana = 1
		mines.infernalMana = 1
		mines.runicMana = 1
		mines.lifeMana = 1
	elseif race == Race.Heretic then
		mines.infernalMana = 1
		mines.deathMana = 1
		mines.runicMana = 1
		mines.lifeMana = 1
	elseif race == Race.Elf then
		mines.groveMana = 1
		mines.runicMana = 1
		mines.infernalMana = 1
		mines.deathMana = 1
	end

	return mines
end

-- Источники т3
function getMinesZone34(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.lifeMana = 1
		mines.groveMana = 1
		mines.infernalMana = 1
		mines.deathMana = 1
	elseif race == Race.Dwarf then
		mines.runicMana = 1
		mines.groveMana = 1
		mines.deathMana = 1
		mines.infernalMana = 1
	elseif race == Race.Undead then
		mines.deathMana = 1
		mines.groveMana = 1
		mines.runicMana = 1
		mines.lifeMana = 1
	elseif race == Race.Heretic then
		mines.infernalMana = 1
		mines.groveMana = 1
		mines.runicMana = 1
		mines.lifeMana = 1
	elseif race == Race.Elf then
		mines.groveMana = 1
		mines.runicMana = 1
		mines.lifeMana = 1
		mines.deathMana = 1
	end

	return mines		

end

-- Источники т4
function getMinesZone5(race, race2)
	local tbl = {1,0,0}
	-- перемешать таблицу
		for i = #tbl, 2, -1 do
		local j = math.random(i)
		tbl[i], tbl[j] = tbl[j], tbl[i]
		end
	if race == Race.Human and race2 == Race.Dwarf or race == Race.Dwarf and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, runicMana = 1, deathMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Human and race2 == Race.Undead or race == Race.Undead and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, deathMana = 1, runicMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Human and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, infernalMana = 1, deathMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Human and race2 == Race.Elf or race == Race.Elf and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, groveMana = 1, deathMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}

	elseif race == Race.Dwarf and race2 == Race.Undead or race == Race.Undead and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, deathMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Dwarf and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, infernalMana = 1, deathMana = tbl[1], lifeMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Dwarf and race2 == Race.Elf or race == Race.Elf and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, groveMana = 1, deathMana = tbl[1], infernalMana = tbl[2], lifeMana = tbl[3]}

	elseif race == Race.Undead and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Undead then return 
	{gold = 1, deathMana = 1, infernalMana = 1, lifeMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}

	elseif race == Race.Undead and race2 == Race.Elf or race == Race.Elf and race2 == Race.Undead then return 
	{gold = 1, deathMana = 1, groveMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}

	elseif race == Race.Heretic and race2 == Race.Elf or race == Race.Elf and race2 == Race.Heretic then return 
	{gold = 1, infernalMana = 1, groveMana = 1, deathMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3]}

	end	
end
 
-- Источники зона-тренер
function getMinesX(race, race2)
	local tbl = {1,0,0}
	-- перемешать таблицу
		for i = #tbl, 2, -1 do
		local j = math.random(i)
		tbl[i], tbl[j] = tbl[j], tbl[i]
		end
	-- (в сводных таблицах зоны не по порядку, поэтому инверсия)		
	if race == Race.Human and race2 == Race.Dwarf then return {runicMana = 1, deathMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Human and race2 == Race.Undead then return {deathMana = 1, runicMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Human and race2 == Race.Heretic then return {infernalMana = 1, deathMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Human and race2 == Race.Elf then return {groveMana = 1, deathMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}
	elseif race == Race.Dwarf and race2 == Race.Undead then return {deathMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Dwarf and race2 == Race.Heretic then return {infernalMana = 1, deathMana = tbl[1], lifeMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Dwarf and race2 == Race.Elf then return {groveMana = 1, deathMana = tbl[1], infernalMana = tbl[2], lifeMana = tbl[3]}
	elseif race == Race.Undead and race2 == Race.Heretic then return {infernalMana = 1, lifeMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Undead and race2 == Race.Elf then return {groveMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}
	elseif race == Race.Heretic and race2 == Race.Elf then return {groveMana = 1, deathMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3]}
--
	elseif race == Race.Dwarf and race2 == Race.Human then return {lifeMana = 1, deathMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Undead and race2 == Race.Human then return {lifeMana = 1, runicMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Heretic and race2 == Race.Human then return {lifeMana = 1, deathMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Elf and race2 == Race.Human then return {lifeMana = 1, deathMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}
	elseif race == Race.Undead and race2 == Race.Dwarf then return {runicMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Heretic and race2 == Race.Dwarf then return {runicMana = 1, deathMana = tbl[1], lifeMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Elf and race2 == Race.Dwarf then return {runicMana = 1, deathMana = tbl[1], infernalMana = tbl[2], lifeMana = tbl[3]}
	elseif race == Race.Heretic and race2 == Race.Undead then return {deathMana = 1, lifeMana = tbl[1], runicMana = tbl[2], groveMana = tbl[3]}
	elseif race == Race.Elf and race2 == Race.Undead then return {deathMana = 1, lifeMana = tbl[1], infernalMana = tbl[2], runicMana = tbl[3]}
	elseif race == Race.Elf and race2 == Race.Heretic then return {infernalMana = 1, deathMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3]}
	end	
end

----------------
--НАЁМНИКИ

-- нейтралы Мили2
function MercM2()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g003uu5030' -- Агент
	elseif radn == 1 then
	return 'g000uu5031' -- Головорез
	elseif radn == 2 then
	return 'g001uu7545' -- Сегаш
	elseif radn == 3 then
	return 'g000uu5028' -- Тритон
	elseif radn == 4 then
	return 'g000uu5033' -- Упырь
	elseif radn == 5 then
	return 'g000uu7611' -- Страж домн
	end
end

-- нейтралы Лучники2
function MercA2()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu5007' -- Кентавр
	elseif radn == 1 then
	return 'g000uu6103' -- Элементаль Воздуха
	end
end

-- нейтралы Маги2
function MercMg2()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g001uu7553' -- Ведунья
	elseif radn == 1 then
	return 'g000uu8201' -- Скальд
	elseif radn == 2 then
	return 'g000uu8190' -- Сущность искажения
	end
end

-- нейтралы Поддержка2
function MercH2()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu2006' -- Наяда
	elseif radn == 1 then
	return 'g000uu6113' -- Оккультист
	end
end

---
-- нейтралы Мили3
function MercM3()
	local radn = math.random(0,8)
	if radn == 0 then
	return 'g000uu6121' -- Дхампир
	elseif radn == 1 then
	return 'g000uu7608' -- Каменщик
	elseif radn == 2 then
	return 'g000uu8306' -- Экзекутор
	elseif radn == 3 then
	return 'g000uu7588' -- Отлученный
	elseif radn == 4 then
	return 'g000uu8247' -- Разоритель
	elseif radn == 5 then
	return 'g000uu8041' -- Темный Эльф Мясник
	elseif radn == 6 then
	return 'g000uu8151' -- Фурия
	elseif radn == 7 then
	return 'g003uu5031' -- Гонитель Ереси
	elseif radn == 8 then
	return 'g000uu8276' -- Последователь
	end
end

-- нейтралы Лучники3
function MercA3()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001uu7612' -- Королевский арбалетчик
	elseif radn == 1 then
	return 'g000uu8274' -- Медуза-охотница
	elseif radn == 2 then
	return 'g000uu8042' -- Темный Эльф Потрошитель
	elseif radn == 3 then
	return 'g001uu7617' -- Тень культа
	elseif radn == 4 then
	return 'g000uu8045' -- Траппер
	elseif radn == 5 then
	return 'g001uu8282' -- Тенистый паук
	end
end

-- нейтралы Маги3
function MercMg3()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu8046' -- Шаманка
	elseif radn == 1 then
	return 'g000uu8048' -- Старейшина Гоблинов
	end
end

-- нейтралы Поддержка3
function MercH3()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu8213' -- Гоблин-шаман
	elseif radn == 1 then
	return 'g000uu7619' -- Слуга культа
	end
end

---
-- нейтралы Мили4
function MercM4()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001uu7560' -- Каратель
	elseif radn == 1 then
	return 'g000uu6106' -- Принцесса гномов
	elseif radn == 2 then
	return 'g000uu5032' -- Вождь варваров
	elseif radn == 3 then
	return 'g001uu7613' -- Огнеборец
	elseif radn == 4 then
	return 'g003uu0023' -- Предатель
	end
end

-- нейтралы Лучники4
function MercA4()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g000uu8174' -- Вестник распада
	elseif radn == 1 then
	return 'g001uu7594' -- Инеит
	elseif radn == 2 then
	return 'g000uu7566' -- Первородная сущность
	elseif radn == 3 then
	return 'g000uu7567' -- Первородная сущность
	elseif radn == 4 then
	return 'g000uu8237' -- Первородная сущность
	end
end

-- нейтралы Маги4
function MercMg4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8005' -- Дух волка
	elseif radn == 1 then
	return 'g000uu8275' -- Медуза
	elseif radn == 2 then
	return 'g001uu7624' -- Неприкаянная
	end
end

-- нейтралы Поддержка4
function MercH4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu5006' -- Великий Оракул
	elseif radn == 1 then
	return 'g000uu8218' -- Волхв
	elseif radn == 2 then
	return 'g000uu7544' -- Настоятельница
	end
end

-- нейтралы Велики1
function MercB1()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu5038' -- Бурый медведь 285
	elseif radn == 1 then
	return 'g000uu5037' -- Белый медведь 490
	elseif radn == 2 then
	return 'g000uu8189' -- Сущность искажения 500
	elseif radn == 3 then
	return 'g001uu8309' -- Триббог 625
	end
end

-- нейтралы Велики2
function MercB2()
	local radn = math.random(0,8)
	if radn == 0 then
	return 'g001uu8281' -- Горный ткач 1350
	elseif radn == 1 then
	return 'g000uu8160' -- Каменная сущность 1150
	elseif radn == 2 then
	return 'g001uu7551' -- Ларней 1090
	elseif radn == 3 then
	return 'g000uu8159' -- Ледяная сущность 1150
	elseif radn == 4 then
	return 'g000uu5015' -- Людоед 1090
	elseif radn == 5 then
	return 'g001uu8271' -- Огр 1250
	elseif radn == 6 then
	return 'g000uu8158' -- Сущность бури 1150
	elseif radn == 7 then
	return 'g000uu8161' -- Сущность пламени 1150
	elseif radn == 8 then
	return 'g000uu5035' -- Черный паук 1350
	end
end

-- нейтралы Велики3
function MercB3()
	local radn = math.random(0,9)
	if radn == 0 then
	return 'g001uu0025' -- Голем 2000
	elseif radn == 1 then
	return 'g001uu7554' -- Йорм 1300
	elseif radn == 2 then
	return 'g001uu7597' -- Кадавр 1850
	elseif radn == 3 then
	return 'g000uu5027' -- Кракен 1850
	elseif radn == 4 then
	return 'g001uu7586' -- Легат 1480
	elseif radn == 5 then
	return 'g001uu7620' -- Одержимый великан 1560
	elseif radn == 6 then
	return 'g001uu8280' -- Пещерный паук 1450
	elseif radn == 7 then
	return 'g000uu8166' -- Стихийный голем 1850
	elseif radn == 8 then
	return 'g000uu5016' -- Тролль 2100
	elseif radn == 9 then
	return 'g001uu7548' -- Черный тролль 2250
	end
end

-- нейтралы Велики4 - не использую пока
function MercB4()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001uu0051' -- Каменный предок 3500
	elseif radn == 1 then
	return 'g001uu0107' -- Мститель 3500
	elseif radn == 2 then
	return 'g000uu5010' -- Облачная Погибель 2370
	elseif radn == 3 then
	return 'g005uu6111' -- Пожиратель 2600
	elseif radn == 4 then
	return 'g001uu7596' -- Сюзерен бездны 2620
	elseif radn == 5 then
	return 'g001uu0104' -- Танатос 3500
	end
end

---
-- Юниты для наёмников (зона тренера)
function unitsMercenX(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = 'g000uu0006', level = 1, unique = false } i = i + 1 -- Лучник
unitsm[i] = { id = 'g000uu0011', level = 1, unique = false } i = i + 1 -- Послушница
unitsm[i] = { id = 'g000uu0008', level = 1, unique = false } i = i + 1 -- Ученик
unitsm[i] = { id = 'g000uu7628', level = 1, unique = true } i = i + 1 -- Имперский гвардеец
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = 'g004uu5039', level = 1, unique = false } i = i + 1 -- Снежный волк
unitsm[i] = { id = 'g000uu0026', level = 1, unique = false } i = i + 1 -- Метатель топоров
unitsm[i] = { id = 'g000uu0033', level = 1, unique = false } i = i + 1 -- Травница
unitsm[i] = { id = 'g000uu7627', level = 1, unique = true } i = i + 1 -- Советник Витара
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = 'g001uu7539','g000uu0086', level = 1, unique = false } i = i + 1 -- Колотун / Мертвец
unitsm[i] = { id = 'g000uu0080', level = 1, unique = false } i = i + 1 -- Адепт
unitsm[i] = { id = 'g000uu0078', level = 1, unique = false } i = i + 1 -- Привидение
unitsm[i] = { id = 'g001uu7592', level = 1, unique = true } i = i + 1 -- Торхот
unitsm[i] = { id = 'g000uu0092', level = 1, unique = true } i = i + 1 -- Оборотень
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
unitsm[i] = { id = 'g000uu0055', level = 1, unique = true } i = i + 1 -- Горгулья
unitsm[i] = { id = 'g000uu0057', level = 1, unique = true } i = i + 1 -- Черт
unitsm[i] = { id = 'g000uu7605', level = 1, unique = true } i = i + 1 -- Скульптор лжи
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0069', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = 'g000uu8018', level = 1, unique = false } i = i + 1 -- Разведчик
unitsm[i] = { id = 'g000uu8025', level = 1, unique = false } i = i + 1 -- Послушник леса
unitsm[i] = { id = 'g000uu8031', level = 1, unique = false } i = i + 1 -- Дух
unitsm[i] = { id = 'g000uu7629', level = 1, unique = true } i = i + 1 -- Благородный эльф
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

return unitsm
end


-- Наёмники в зоне тренера
function zoneMercenZoneX(race)
return {
	{
		units = unitsMercenX(race),
	}
}
end


-- Юниты для наёмников зоны 2 (начальные)
function unitsMercen12(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = rnd('g000uu0006','g000uu0011','g000uu0008'), level = 1, unique = false } i = i + 1 -- Лучник / Послушница / Ученик
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = rnd('g000uu0026','g000uu0033'), level = 1, unique = false } i = i + 1 -- Метатель топоров / Травница
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
unitsm[i] = { id = rnd('g000uu0080','g000uu0078'), level = 1, unique = false } i = i + 1 -- Адепт / Привидение
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6120', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Горгулья / Черт / Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0055','g000uu0057','g000uu0069'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = rnd('g000uu8018','g000uu8025','g000uu8031'), level = 1, unique = false } i = i + 1 -- Разведчик / Послушник леса / Дух
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

return unitsm
end

-- Наёмники в зоне 2
function zoneMercenZone12(race)
return {
	{
		units = unitsMercen12(race),
		guard = gmm({}, guard2n()),
		}
	}
end


-- Юниты для наёмников зоны 3 (основные)
function unitsMercen(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Ангел / Бич ереси / Великий инквизитор / Защитник веры / Защитник угнетенных / Кара Императора / Сенешаль / Эмиссар // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0014','g000uu2016','g000uu0157','g000uu0015','g003uu6108','g000uu2010','g001uu7543','g000uu2031'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Игнар / Юстициар // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8312','g000uu9000'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Белый маг / Криомант / Магистр стихий // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0152','g001uu7582','g000uu8185'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Епископ / Патриарх / Прорицательница // Поддержка4
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu7570','g000uu0150','g000uu0151'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Старый ветеран / Хранитель рун // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0040','g000uu2011'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
--  // Лучники4
unitsm[i] = { id = MercA4(), level = 1, unique = true } i = i + 1
-- Метатель огня / Отшельник / Повелитель волков // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2020','g000uu0163','g000uu0164'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Архидруид / Хэйсса / Эйра // Поддержка4
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0160','g000uu7559','g000uu7557'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Каган Каменной Пасти / Клеврет Смерти / Скелет-рыцарь / Хан Каменной Пасти // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7540','g001uu8314','g000uu0089','g003uu5014'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Смерть / Сущий // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0177','g000uu0178'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Вампир / Лич // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0083','g000uu0084'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Длань Мортис // Поддержка4
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu2008', level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6120', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Возвышенный / Искоренитель // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0166','g000uu8254'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Истязатель душ // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2004', level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Инкуб / Пандемониус /  // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0065','g000uu0066','g001uu8242'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Суккуб // Поддержка4
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0173', level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Кераст / Налетчик /  // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7578','g000uu2013'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Разбойник / Штормовой кентавр // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8051','g001uu8240'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Консул /  // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8258', level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Дриолисса / Солнечная Танцовщица / Целитель // Поддержка4
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu8214','g000uu8034','g000uu2002'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
end

return unitsm
end

-- Наёмники в зоне 3
function zoneMercenZone(race)
return {
	{
		units = unitsMercen(race),
		guard = gmm({}, guard3n()),
		}
	}
end

-- Юниты для наёмников зоны 4 (центр)
function unitsMercen4(race, race2)
local unitsm = {}
local i = 1

if race == Race.Human and race2 == Race.Dwarf or race == Race.Dwarf and race2 == Race.Human then 
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Посвященная // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
--
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
--  .. + Каменный великан / Ледяной великан / Повелитель бурь // Велики3
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8224','g000uu0032','g000uu0031'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Human and race2 == Race.Undead or race == Race.Undead and race2 == Race.Human then 
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
--  .. + Дракон Смерти // Велики3
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0095', level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Human and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Human then 
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
--  .. + Азуритовая горгулья / Молох / Ониксовая горгулья / Цитриновая горгулья / Чароитовая горгулья // Велики3
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8272','g000uu0059','g000uu0167','g001uu7574','g001uu7573'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Human and race2 == Race.Elf or race == Race.Elf and race2 == Race.Human then  
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
--  .. + Древо жизни / Прародитель // Велики3
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu8039','g000uu8212'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Dwarf and race2 == Race.Undead or race == Race.Undead and race2 == Race.Dwarf then 
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Посвященная // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
--
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Каменный великан / Ледяной великан / Повелитель бурь + Дракон Смерти // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8224','g000uu0032','g000uu0031'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0095', level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Dwarf and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Dwarf then
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Посвященная // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
--
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Каменный великан / Ледяной великан / Повелитель бурь + Азуритовая горгулья / Молох / Ониксовая горгулья / Цитриновая горгулья / Чароитовая горгулья // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8224','g000uu0032','g000uu0031'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8272','g000uu0059','g000uu0167','g001uu7574','g001uu7573'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Dwarf and race2 == Race.Elf or race == Race.Elf and race2 == Race.Dwarf then 
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Посвященная // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
--
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Каменный великан / Ледяной великан / Повелитель бурь + Древо жизни / Прародитель // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8224','g000uu0032','g000uu0031'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu8039','g000uu8212'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Undead and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Undead then
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Дракон Смерти + Азуритовая горгулья / Молох / Ониксовая горгулья / Цитриновая горгулья / Чароитовая горгулья // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0095', level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8272','g000uu0059','g000uu0167','g001uu7574','g001uu7573'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Undead and race2 == Race.Elf or race == Race.Elf and race2 == Race.Undead then 
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Дракон Смерти + Древо жизни / Прародитель // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0095', level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu8039','g000uu8212'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1


elseif race == Race.Heretic and race2 == Race.Elf or race == Race.Elf and race2 == Race.Heretic then 
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
-- Азуритовая горгулья / Молох / Ониксовая горгулья / Цитриновая горгулья / Чароитовая горгулья + Древо жизни / Прародитель // Велики3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8272','g000uu0059','g000uu0167','g001uu7574','g001uu7573'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu8039','g000uu8212'), level = 3, unique = true } else unitsm[i] = { id = MercB3(), level = 1, unique = true } end i = i + 1

end	
return unitsm
end

-- Наёмники в зоне 4 (центр)
function zoneMercenZone4(race, race2)
return {
	{
		units = unitsMercen4(race, race2),
		guard = gmm({}, guard3n()),
		}
	}
end

----------------------

-- Сундуки трен -- не использую
function bagsRespX()
return {
	count = 1,
	loot = {
			items = {
				orr({ id = rmss(), min = 1, max = 1 }, { id = 'g000ig7001', min = 1, max = 1 }), --случ.мал.шар/бронз.кольцо
				orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
			}
	}
}
end


-- Сундуки Респ
function bagsResp00()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 375 }, 
		itemValue = { min = 250, max = 375 },
			items = {
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
				{ id = e2(), min = 1, max = 1 },
			}
	}
}
end


-- Сундуки т1
function bagsResp0()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 625 }, 
		itemValue = { min = 250, max = 625 },
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				orr({ id = 'g001ig0180', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3трава/хил75
				{ id = b15(), min = 1, max = 1 },
			}
	}
}
end

-- Сундуки т2
function bagsResp()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 750, max = 875 }, 
		itemValue = { min = 250, max = 875 },
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				orr({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --хил100/2хил50
				{ id = w15(), min = 1, max = 1 },
			}
		}
}
end

-- Сундуки т3
function bagsZone34()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 1000, max = 1000 },
		itemValue = { min = 500, max = 1000 },
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				orr({ id = 'g000ig0005', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3хил50/2хил75
				{ id = e4(), min = 1, max = 1 }, -- эл 200-375
			}
		}
	}
end

-- Сундуки т4
function bagsZone5()
return {
	count = 2,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 1500, max = 1500 },
		itemValue = { min = 500, max = 1000 },
			items = {
				{ id = 'g000ig0001', min = 2, max = 2 }, --рес
				{ id = 'g000ig0018', min = 1, max = 1 }, --хил200
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100				
				{ id = p05(), min = 1, max = 1 },
				{ id = e4(), min = 1, max = 1 },
				
		}
	}
}
end

----------------------
-- МОИ ФУНКЦИИ
----------------------

-- Быль или не быть
function yn(what)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return ""
	end
end

-- Или / или
function orr(what, what2)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	end
end

-- Или / или 3
function orr3(what, what2, what3)
	local radn = math.random(0,2)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	end
end

-- Или / или 5
function orr5(what, what2, what3, what4, what5)
	local radn = math.random(0,4)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	elseif radn == 3 then
	return what4
	elseif radn == 4 then
	return what5
	end
end

-- случайный
function rnd(...)
    return (select(math.random(select('#', ...)), ...))
end

-- Режим карты
function gmm(outrun, classic)
	if gmode == 1 then
	return outrun
	elseif gmode == 2 then
	return classic
	end
end

-- субраса игрока
function getPlayerSubRace(race)
	if race == Race.Human then return Subrace.Human
	elseif race == Race.Dwarf then return Subrace.Dwarf
	elseif race == Race.Undead then return Subrace.Undead
	elseif race == Race.Heretic then return Subrace.Heretic
	elseif race == Race.Elf then return Subrace.Elf
	end
end

-- родной шар манны
function ExtraHomeMana(race)
	
	shmn = 'g001ig0146' -- Шар маны Жизни
	sdw = 'g001ig0148' -- Шар маны Рун
	sun = 'g001ig0149' -- Шар маны Смерти
	shr = 'g001ig0147' -- Шар маны Преисподней
	self = 'g001ig0150' -- Шар Лесного эликсира 
	
	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- доп шар в ст-ице на старте на спец. заклы
function ExtraMana(race)
	
	shmn = orr('g001ig0149','g001ig0150') -- Шар маны Смерти \ Шар маны Лесного эликсира
	sdw = orr('g001ig0150','g001ig0147') -- Шар маны Лесного эликсира \ Шар маны Преисподней
	sun = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	shr = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	self = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	
	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- случайный малый шар манны
function rmss()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0481' --жизни
	elseif radn == 1 then
	return 'g001ig0485' --лес
	elseif radn == 2 then
	return 'g001ig0482' --преисп.
	elseif radn == 3 then
	return 'g001ig0483' --рун
	elseif radn == 4 then
	return 'g001ig0484' --смерти
	end
end


-- случайный шар манны
function rms()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0146' --жизни
	elseif radn == 1 then
	return 'g001ig0150' --лес
	elseif radn == 2 then
	return 'g001ig0147' --преисп.
	elseif radn == 3 then
	return 'g001ig0148' --рун
	elseif radn == 4 then
	return 'g001ig0149' --смерти
	end
end

-- случайный большой шар манны
function rmsb()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0277' --жизни
	elseif radn == 1 then
	return 'g001ig0281' --лес
	elseif radn == 2 then
	return 'g001ig0278' --преисп.
	elseif radn == 3 then
	return 'g001ig0279' --рун
	elseif radn == 4 then
	return 'g001ig0280' --смерти
	end
end

-- случайная банка на 15
function b15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig0002' --зашита
	elseif radn == 1 then
	return 'g000ig0014' --атака
	elseif radn == 2 then
	return 'g000ig0011' --ини
	elseif radn == 3 then
	return 'g000ig0008' --точность
	end
end

-- случайная банка вард от стихий
function w15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig0021' --воздух
	elseif radn == 1 then
	return 'g000ig0022' --вода
	elseif radn == 2 then
	return 'g000ig0023' --земля
	elseif radn == 3 then
	return 'g000ig0024' --огонь
	end
end

-- случайная банка вард от дотов и спец урона
function d15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0329' -- Эликсир защиты от дота
	elseif radn == 1 then
	return 'g001ig0351' --Эликсир защиты от поглощения
	elseif radn == 2 then
	return 'g001ig0343' --Эликсир защиты от проклятий
	elseif radn == 3 then
	return 'g001ig0341' -- Эликсир защиты от аффекта
	end
end

-- случайный эликсир 200-375 + эффект варды (от-яд з1)
function e2()
	local radn = math.random(0,7)
	if radn == 0 then
	return 'g001ig0560' -- Зелье провокатора 25принять
	elseif radn == 1 then
	return 'g001ig0547' -- Зелье пронзающего взгляда +10крит
	elseif radn == 2 then
	return 'g001ig0490' -- Зелье выносливости +25оз
	elseif radn == 3 then
	return 'g001ig0329' -- Эликсир защиты от дота
	elseif radn == 4 then
	return 'g001ig0351' -- Эликсир защиты от поглощения
	elseif radn == 5 then
	return 'g001ig0343' -- Эликсир защиты от проклятий
	elseif radn == 6 then
	return 'g002ig0007' -- Зелье магической устойчивости 250 (имун магия)
	elseif radn == 7 then
	return 'g002ig0005' -- Зелье наблюдательности 250 (15 ворам)
	end
end

-- случайный эликсир 400-500 + дот.вард
function e4()
	local radn = math.random(0,7)
	if radn == 0 then
	return 'g001ig0562' -- Зелье дуэлянта +20крит
	elseif radn == 1 then
	return 'g001ig0491' -- Зелье похищения жизни +25вамп
	elseif radn == 2 then
	return 'g001ig0355' -- Зелье тритоньей чешуи +вардурон
	elseif radn == 3 then
	return 'g001ig0127' -- Эликсир жизненной силы +50максоз
	elseif radn == 4 then
	return 'g001ig0128' -- Эликсир защиты от Оружия
	elseif radn == 5 then
	return 'g001ig0341' -- Эликсир защиты от аффекта
	elseif radn == 6 then
	return 'g002ig0006' -- Зелье бдительности 500 (30 ворам)
	elseif radn == 7 then
	return 'g002ig0008' -- Эликсир скрытого потенциала 500 (20оз +7точ.вт.атаки)
	end
end

-- случайный пермо-эликсир на 5% за 400
function p05()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0309' -- Эликсир задиры +5ини
	elseif radn == 1 then
	return 'g001ig0313' -- Эликсир совершенствования +5урон
	elseif radn == 2 then
	return 'g001ig0311' -- Эликсир хладнокровия +5точности
	elseif radn == 3 then
	return 'g001ig0315' -- Зелье великана +5ОЗ
	elseif radn == 4 then
	return 'g001ig0307' -- Зелье стойкости +5брони
	end
end

-- случайный пермо-эликсир на 15% за 1200
function p15()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0308' -- Зелье заступника +15брони
	elseif radn == 1 then
	return 'g001ig0314' -- Эликсир наследия +15урон
	elseif radn == 2 then
	return 'g001ig0310' -- Эликсир опережения +15ини
	elseif radn == 3 then
	return 'g001ig0522' -- Зелье посла +неподкупность
	elseif radn == 4 then
	return 'g001ig0513' -- Зелье твердого шага +5мувов
	end
end

-- сфера для ц.гор.
function spherex()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig9023' -- Сфера Инферно 60 горен крест 900
	elseif radn == 1 then
	return 'g000ig9040' -- Сфера Полиморфа 1000
	elseif radn == 2 then
	return 'g000ig9007' -- Сфера понижения уровня 900
	elseif radn == 3 then
	return 'g001ig0181' -- Сфера Страха 800
	end
end

-- заклы со старта
function CapSpell(race)
	sphmn = orr(orr('g000ss0002','g000ss0003'),orr('g000ss0004','g000ss0009')) -- Быстрота\Сила\Молния\Истинное зрение
	spdw = orr(orr('g000ss0021','g000ss0023'),orr('g000ss0024','g000ss0025')) -- Ледяной щит\Сила Витара\Буран\Призыв I: Рух
	spun = orr(orr('g000ss0061','g000ss0062'),orr('g000ss0065','g000ss0064')) -- Призыв I: Скелет\Мор\Ржавчина\Слабость
	sphr = orr(orr('g000ss0041','g000ss0045'),orr('g000ss0043','g000ss0044')) -- Incantare Hellhound\Tormentio\Ignis mare\Menta minoris
	spelf = orr(orr('g000ss0097','g000ss0098'),orr('g000ss0101','g000ss0106')) -- Кустарник\Призыв I: Энт Малый\Стая\Смятение
	
	if race == Race.Human then return sphmn
	elseif race == Race.Dwarf then return spdw
	elseif race == Race.Undead then return spun
	elseif race == Race.Heretic then return sphr
	elseif race == Race.Elf then return spelf
	end
end

-- случайная субраса
function rsub()
	local radn = math.random(0,4)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --гномы
	elseif radn == 4 then
	return {Subrace.Undead, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --нежить
	end
end

-- субраса только не нежить + водные
function NoUndead()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end

-- субраса только не нежить + водные - драконы
function NoUndeadDragon()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end


-- случайный пермо-эликсир на для руин 0
function ruin0()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0309' -- Эликсир задиры +5ини
	elseif radn == 1 then
	return 'g001ig0313' -- Эликсир совершенствования +5урон
	elseif radn == 2 then
	return 'g001ig0307' -- Зелье стойкости +5брони
	elseif radn == 3 then
	return 'g001ig0533' -- Зелье ясного взора (+2 обзора)	
	end
end

-- для руин 1.2
function ruin12()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001ig0493' -- Книга божественных даров
	elseif radn == 1 then
	return 'g001ig0497' -- Книга колдовства
	elseif radn == 2 then
	return 'g001ig0495' -- Книга наследия
	elseif radn == 3 then
	return 'g001ig0494' -- Книга странника
	elseif radn == 4 then
	return 'g001ig0184' -- Талисман Восстановления
	elseif radn == 5 then
	return 'g000ig9109' -- Талисман призыва нейтралов II
	elseif radn == 6 then
	return 'g000ig9120' -- Талисман щита стихий
	end
end

-- случайный пермо-эликсир на для руин в зоне тренера
function ruinTrainers()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0025' -- Аура живучести +10оз аое
	elseif radn == 1 then
	return 'g001ig0024' -- Аура защиты +10брони аое
	elseif radn == 2 then
	return 'g001ig0021' -- Аура слепой ярости +10атаки аое
	elseif radn == 3 then
	return 'g001ig0031' -- Аура точности +15точности аое
	elseif radn == 4 then
	return 'g001ig0023' -- Аура стремительности +10ини аое
	end
end

--------------

-- отряды у тренера
function PredSkinX(omin, omax, olmin, olmax)
return { -- 70 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
		count = 1,
			subraceTypes = { Subrace.NeutralGreenSkin, Subrace.NeutralWolf, Subrace.Neutral},
			value = { min = omin*kef, max = omax*kef },
			loot = {
				itemTypes = { Item.PotionHeal, Item.PotionRevive },
				value = { min = olmin, max = olmax },
				itemValue = { min = 50, max = 250 },
				items = {
					orr3({ id = b15(), min = 1, max = 1 }, { id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /случ. банка15 / случ. вард
				}
			}
}
end
-- отряд варвары
function PredBarb(vmin, vmax, vlmin, vlmax)
return { 
-- новые: 90 трибог, 110 айтвар, 135 ящер-воин, 485 ларней, 775 болотный страж, 985 лиргид, 1775 болотный дракон
-- старые: 165 шаманка, 175 трапер, 220 вождь, 270 дик.вел

		count = 1,
			subraceTypes = { Subrace.NeutralBarbarian, Subrace.NeutralMarsh, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
			value = { min = vmin*kef, max = vmax*kef },
			loot = {
				itemTypes = { Item.Scroll, Item.Orb },
				value = { min = vlmin, max = vlmin },
				itemValue = { min = vlmin, max = vlmin },
				items = {
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				}
			}
}
end

-- отряд орки
function PredSkin(omin, omax, olmin, olmax)
return { -- 70 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
		count = 1,
			subraceTypes = { Subrace.NeutralGreenSkin, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
			value = { min = omin*kef, max = omax*kef },
			loot = {
				itemTypes = { Item.PotionHeal, Item.PotionRevive },
				value = { min = olmin, max = olmax },
				itemValue = { min = 50, max = 250 },
				items = {
					orr({ id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /  случ. вард
				}
			}
}
end


----------------------
-- Отряды респ
---------------------

function zoneStacksRespZ00()
return {  -- 175*3
		subraceTypes = rsub(),
		count = 3,
		value = { min = 525*kef, max = 550*kef },
		loot = {
			items = {
				{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
				{ id = 'g000ig7001', min = 1, max = 1 }, --кольцо50
				{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны				
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = w15(), min = 1, max = 1}, -- случ. дотвард
			}
		}
}
end


function zoneStacksRespZ001()
return { -- 180*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 360*kef, max = 380*kef },
		loot = {
			items = {
				{ id = 'g001ig0378', min = 1, max = 1}, --хил75
				{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
				orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			}
		}
}
end

function zoneStacksRespZ002()
return { -- 185*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 370*kef, max = 390*kef },
		loot = {
			itemTypes = { Item.Orb, Item.Scroll },
			value = { min = 200, max = 200 },
			itemValue = { min = 100, max = 100 },		
			items = {
				orr({ id = 'g000ig0005', min = 2, max = 2 }, { id = 'g000ig0006', min = 1, max = 1 }), --2хил50/хил100
				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
			}
		}
}
end

--------------
-- Отряды т1
--------------

-- т1 сила два режима
function vgmode1(val)
local kcross = 1.05 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

----------

function Pred1RespZ0()
return {  --200xp*2 -- сфера 100 / 150
		subraceTypes = rsub(),
		count = 2,
			value = { min = vgmode1(400), max = vgmode1(400)*kr },
			loot = {
				itemTypes = { Item.Orb },
				value = { min = 300, max = 300 },
				itemValue = { min = 100, max = 200 },
				items = {
					{ id = b15(), min = 1, max = 1 }, -- случ. банка15				
					{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
					{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
					{ id = e2(), min = 1, max = 1 }, -- 
				}
			}
}
end

function Pred1RespZ01()
return { --250xp*2 -- свитки т1+т1
		subraceTypes = rsub(),
		count = 2,
			value = { min = vgmode1(500), max = vgmode1(500)*kr },
			loot = {
				itemTypes = { Item.Scroll },
				value = { min = 400, max = 400 },
				itemValue = { min = 200, max = 200 },
				items = {
					{ id = 'g000ig0006', min = 1, max = 1}, --хил100
					{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
					orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
					{ id = b15(), min = 1, max = 1}, -- случ. банка15	
				}
			}
}
end

function Pred1RespZ02() 
return { --300xp*1 -- драги75
		count = 1,
			subraceTypes = rsub(),
			value = { min = vgmode1(300), max = vgmode1(300)*kr },
			loot = {
				items = {
					orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
					{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
					{ id = 'g000ig0008', min = 1, max = 1}, -- точность15
				}
			}
}
end

function Pred1RespZ03() 
return { --300xp*1  / -- вард оружия/Зелье дозорного
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = vgmode1(310), max = vgmode1(310)*kr },
			loot = {
				items = {
					orr({ id = e2(), min = 1, max = 1 },{ id = 'g001ig0532', min = 1, max = 1 }), -- эл200/Зелье дозорного
					{ id = 'g000ig0006', min = 1, max = 1}, --хил100
					{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
				}
			}
}
end

function Pred1RespZ04()
return { -- 300*1
		subraceTypes = rsub(),
		count = 1,
			value = { min = vgmode1(320), max = vgmode1(320)*kr },
		loot = {
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), -- вард разума / вард смерти
				{ id = 'g000ig0021', min = 1, max = 1 }, --возд
			}
		}
}
end


function Pred1RespZD() 
return { --350xp*1 -- талисман 200-275
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = vgmode1(350), max = vgmode1(350)*kr },
			loot = {
				itemTypes = { Item.Talisman },
				value = { min = 200, max = 200 },
				itemValue = { min = 200, max = 200 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
				}
			}
}
end


------------------
-- Отряды т2
------------------

-- т2 сила два режима
function vgmode2(val)
local kcross = 1.1 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

----

function zoneStacksResp1()
return { -- 300xp*1
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(300), max = vgmode2(300)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
		}
	},
}	
end

function Pred1Resp01()
return { -- 350хп*2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(700), max = vgmode2(700)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
			{ id = 'g000ig7002', min = 1, max = 1 }, --кольцо100
			{ id = d15(), min = 1, max = 1 }, --случ. дотвард
		}
	}
}
end

function zoneStacksResp()
return { -- 400xp*2 / свитки т1+т1
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(800), max = vgmode2(800)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 400, max = 400 }, -- свиток т1+т1
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g001ig0485', min = 1, max = 1 }, --мал. шар лес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0008', min = 1, max = 1 }, --меткость15
			{ id = 'g001ig0036', min = 1, max = 1 }, --смерти
		}
	},
}
end

function Pred1Resp1() 
return { -- 450хп*2 -- сферы 200*2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(900), max = vgmode2(900)*kr },
	loot = {
		itemTypes = { Item.Orb },
		value = { min = 400, max = 400 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g001ig0481', min = 1, max = 1 }, -- мал. шар жизни
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
		}
	}
}
end

function Pred1Resp2()
return { -- 500хп*2 -- свиток т1+т2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 600, max = 600 },
		itemValue = { min = 200, max = 400 },
		items = {
			{ id = 'g001ig0482', min = 1, max = 1 }, -- мал. шар преисп
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --воздуха/огня
		}
	}
}
end

function Pred1Resp3()
return { -- 500хп*2 -- сфера 225-250
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		itemTypes = { Item.Orb },
		value = { min = 800, max = 800 }, -- 2 сфера 
		itemValue = { min = 400, max = 400 },
		items = {
			{ id = 'g001ig0483', min = 1, max = 1 }, -- мал. шар рун
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = 'g002ig0007', min = 1, max = 1}, -- Зелье магической устойчивости
		}
	}
}
end

function Pred1Resp4()
return { -- 500хп*2 -- Эликсир -75 лечения / оз+25%
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		items = {
			{ id = 'g001ig0484', min = 1, max = 1 }, -- мал. шар смерти
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig7002', min = 1, max = 1 }, --кольцо100
			orr3({ id = 'g001ig0026', min = 1, max = 1 },{ id = 'g001ig0130', min = 1, max = 1 },{ id = 'g001ig0561', min = 1, max = 1 }), -- Аура регенерации (+10 реген аое)/эликсир регенерации/эликсир самопожертвования
			{ id = b15(), min = 1, max = 1}, -- случ. банка15
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
		}
	}
}
end

function Pred1Resp5()
return { -- 550хп*1 -- посох 200
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(550), max = vgmode2(550)*kr },
	loot = {
		itemTypes = { Item.Wand },
		value = { min = 200, max = 200 }, 
		itemValue = { min = 200, max = 200 },			
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
			{ id = d15(), min = 1, max = 1}, -- случ. дотвард	
		}
	}
}
end

function Pred1RespD()
return { -- 650хп*1 -- перк 600 / случ. пермо-эликсир на 5%
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(650), max = vgmode2(650)*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0125', min = 1, max = 1 }, --разума
			{ id = p05(), min = 1, max = 1 }, -- случ. пермо-эликсир на 5%
		}
	}
}
end

--------------------
-- Отряды т3
--------------------

-- т3 сила два режима
function vgmode3(val)
local kcross = 1.15 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

----


function zoneStacksZone34()
return { -- 600xp*3
	subraceTypes = rsub(),
	count = 3,
	value = { min = vgmode3(1800), max = vgmode3(1800)*kr },
	loot = {
		items = {
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			orr({ id = b15(), min = 1, max = 1}, { id = 'g002ig0005', min = 1, max = 1}), -- случ. банка15 / Зелье наблюдательности15
			orr({ id = 'g000ig0011', min = 1, max = 1 }, { id = 'g000ig0008', min = 1, max = 1 }), --15ини/точности
			{ id = 'g001ig0432', min = 1, max = 1 }, --аметист125
			{ id = 'g001ig0127', min = 1, max = 1 }, --50оз
		}
	},
}
end

function Pred1Zone1()
return { -- 700хп*2 -- свиток т2+т2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1400), max = vgmode3(1400)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 800, max = 800 },
		itemValue = { min = 400, max = 400 },
		items = {
			{ id = e2(), min = 1, max = 1 }, --эликсир200
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			orr({ id = 'g000ig0002', min = 1, max = 1 }, { id = 'g000ig0014', min = 1, max = 1 }), --15зашиты/атаки
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
		}
	}
}
end

function Pred1Zone2()
return { -- 800хп*2 -- сфера375-400
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1600), max = vgmode3(1600)*kr },
	loot = {
		itemTypes = { Item.Orb },
		value = { min = 900, max = 900 }, -- сфера
		itemValue = { min = 400, max = 500 },
		items = {
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0014', min = 1, max = 1 }, { id = 'g000ig0008', min = 1, max = 1 }), --15атаки/точности
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			orr({ id = 'g000ig0012', min = 1, max = 1 }, { id = 'g002ig0006', min = 1, max = 1 }), --ини30 / Зелье бдительности 30 воры
		}
	}
}
end

function Pred1Zone3()
return { -- 900хп*2 -- элексир буст 350-500
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1800), max = vgmode3(1800)*kr },
	loot = {
		itemTypes = { Item.PotionBoost },
		value = { min = 850, max = 1090 }, -- эликсир 350-425-500
		itemValue = { min = 350, max = 540 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0018', min = 1, max = 1 }, -- мазь
			{ id = e4(), min = 1, max = 1 }, --эликсир400
			orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			{ id = 'g000ig0015', min = 1, max = 1 }, --атака30
		}
	}
}
end

function Pred1Zone4()
return { -- 1000хп*2 -- сфера/свиток 400*2
	count = 2,
	subraceTypes = NoUndead(),			
	value = { min = vgmode3(2000), max = vgmode3(2000)*kr },
	loot = {
		itemTypes = { Item.Scroll, Item.Orb },
		value = { min = 1000, max = 1100 },
		itemValue = { min = 500, max = 600 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			orr3({ id = 'g000ig0018', min = 1, max = 1 }, { id = 'g001ig0519', min = 1, max = 1 }, { id = 'g001ig0083', min = 1, max = 1 }), --мазь / Война престолов (-10 воры) 500 / Зелье рвения (+5 ини и точности)
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
			orr({ id = 'g000ig0011', min = 1, max = 1 }, { id = 'g000ig0002', min = 1, max = 1 }), --15ини/защиты
			{ id = 'g000ig0003', min = 1, max = 1 }, --30защиты
			{ id = 'g001ig0432', min = 1, max = 1 }, --аметист125
		}
	}
}
end

function Pred1ZoneD() 
return { --1300хп*1 --свиток т3 + пермо
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode3(1300), max = vgmode3(1300)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 550, max = 550 },
		itemValue = { min = 550, max = 550 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0018', min = 1, max = 1 }, -- мазь
			rnd({ id = 'g000ig0003', min = 1, max = 1 }, { id = 'g000ig0015', min = 1, max = 1 }, { id = 'g002ig0008', min = 1, max = 1 }), --30защиты / 30атаки / Эликсир скрытого потенциала
			{ id = p05(), min = 1, max = 1 }, -- случ. пермо-эликсир на 5%
		}
	}
}
end


--------------------
-- Отряды т4 (трежа)
--------------------

function zoneStacksZone5()
return { -- 1200хп*3
		subraceTypes = rsub(),
		count = 3,
		value = { min = 3600*kef, max = 3780*kef},
		loot = {
			items = {
				{ id = rms(), min = 1, max = 1 }, --случ. шар манны
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100				
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g000ig7003', min = 1, max = 1 }, --изумруд150
				{ id = 'g000ig0018', min = 1, max = 1 }, --мазь
				{ id = 'g001ig0547', min = 1, max = 1 }, --крит15
				{ id = 'g001ig0127', min = 1, max = 1 }, --оз50
				{ id = 'g001ig0355', min = 1, max = 1 }, --вард.урон
				{ id = 'g002ig0007', min = 1, max = 1 }, --Зелье магической устойчивости 
				{ id = 'g002ig0005', min = 1, max = 1 }, --Зелье наблюдательности
				{ id = 'g002ig0006', min = 1, max = 1 }, --Зелье бдительности
			}
		},
}
end

function zoneStacksZone501()
return { -- точн30+драги
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1300*kef, max = 1365*kef },
				loot = {
					items = {
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
						orr({ id = 'g000ig0009', min = 1, max = 1 }, { id = 'g002ig0008', min = 1, max = 1 }), --точность30 / Эликсир скрытого потенциала
						{ id = 'g000ig7003', min = 1, max = 1 }, --изумруд150
					}
				}
}
end

function zoneStacksZone502()
return { -- e2+хил200
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1400*kef, max = 1470*kef },
				loot = {
					items = {
						{ id = 'g000ig0001', min = 1, max = 1 }, --рес
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = e2(), min = 1, max = 1 }, -- эл 200-375
						{ id = 'g000ig0018', min = 1, max = 1 }, --хил200
					}
				}
}
end

function zoneStacksZone503()
return { -- 25вамп
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1500*kef, max = 1570*kef },
				loot = {
					items = {
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0491', min = 1, max = 1 }, -- Зелье похищения жизни +25вамп
					}
				}
}
end


local Pred1Zone5Value = { min = 1600*kef, max = 1680*kef } -- 1600

function Pred1Zone51()
return { -- шар
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					items = {
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = rms(), min = 1, max = 1 }, --случ. шар манны
						{ id = 'g000ig0015', min = 1, max = 1 }, --атака30
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
					}
				}
}
end

function Pred1Zone52()
return { -- свиток
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					itemTypes = { Item.Scroll },
					value = { min = 550, max = 550 },
					itemValue = { min = 550, max = 550 }, 
					items = {
					orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = 'g000ig0012', min = 1, max = 1 }, --ини30
					}
				}
}
end

function Pred1Zone53()
return { -- сфера
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					itemTypes = { Item.Orb },
					value = { min = 500, max = 700 }, -- сфера 450-700
					itemValue = { min = 500, max = 700 }, 
					items = {
					orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					}
				}
}
end

function Pred1Zone54()
return { -- e4
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					items = {
					orr(
						{ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = 'g001ig0125', min = 1, max = 1 }, -- разума
						{ id = e4(), min = 1, max = 1 }, --эликсир400
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
					}
				}
}
end

function Pred1Zone5D() 
return { --2000хп*1 -- пермо500*2
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 2000*kef, max = 2100*kef },
				loot = {
					itemTypes = { Item.PotionPermanent }, -- 2 пермо 500-700
					value = { min = 1300, max = 1400 },
					itemValue = { min = 600, max = 700 }, 
					items = {
						{ id = 'g000ig0001', min = 1, max = 1 }, --рес
						{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
						{ id = 'g000ig0018', min = 1, max = 1 }, --хил200

					}
				}
}
end
	
-------------------------

-- Охрана объектов
function guard0() -- респ0
return {
	value = { min = 170*kef, max = 178*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0005', min = 1, max = 1}, { id = 'g001ig0180', min = 2, max = 2}), -- хил50/2хил25
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g000ig7001', min = 1, max = 1}), -- случ. мал. шар / кольцо50
		},
	}
}
end

function guard1() -- зона1 --драги 250-375
return {
	value = { min = 250*kef, max = 260*kef },
	loot = {
		items = {
			{ id = 'g000ig0005', min = 1, max = 1}, -- хил50
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g001ig0431', min = 1, max = 1}), -- случ. мал. шар / гранат75			
		},
	}
}
end

function guard2() -- зона2 --драги 500
return {
	value = { min = 400*kef, max = 420*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 500 },
		itemValue = { min = 500, max = 500 },
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, -- хил75
		},
	}
}
end

function guard2n() -- зона2 наём.
return {
	value = { min = 500*kef, max = 525*kef },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			orr({ id = 'g000ig7002', min = 1, max = 1 }, { id = rmss(), min = 1, max = 1 }), --кольцо100/случ. мал.шар манны			
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard2m() -- зона2 башня
return {
	value = { min = 400*kef, max = 420*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

function guard3m() -- зона3 башня
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			orr({ id = 'g001ig0432', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --аметист125/случ. шар манны			
			{ id = w15(), min = 1, max = 1}, -- случ. вард
		},
	},
}
end

function guard3() -- зона3 --драги 500-750
return { 
	value = { min = 750*kef, max = 790*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 750 },
		itemValue = { min = 500, max = 750 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15			
		},
	}
}
end

function guard3n() -- зона3 наём.
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
				{ id = w15(), min = 1, max = 1}, -- случ. вард		
		},
	}
}
end

------------------

-- Главная охрана прохода между зонами 2-4
function zoneGuardZone0()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 1500*kef, max = 1560*kef }, --
	loot = {
		value = { min = 600, max = 740 },
		itemValue = { min = 600, max = 740 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7004', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --кольцо200/случ. шар манны
			orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			{ id = e2(), min = 1, max = 1}, -- эл200
			{ id = p05(), min = 1, max = 1}, -- случ. пермо-эликсир на 5%
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15			
		}
	}
}
end

-- Главная охрана прохода между зонами 3-4
function zoneGuardZone()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 1700*kef, max = 1780*kef }, --
	loot = {
		value = { min = 600, max = 740 },
		itemValue = { min = 600, max = 740 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7005', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --рубин/случ. шар манны
			orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			orr({ id = 'g000ig0018', min = 1, max = 1 }, { id = e4(), min = 1, max = 1 }), --мазь/эл400
			{ id = p05(), min = 1, max = 1}, -- случ. пермо-эликсир на 5%
			{ id = e2(), min = 1, max = 1 }, --эликсир200
		}
	}
}
end

-- Главная охрана прохода между зонами очень-сильная
function zoneGuardZoneR()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 2600*kef, max = 2700*kef },
	loot = {
		value = { min = 1500, max = 1800 },
		itemValue = { min = 1500, max = 1800 },
		itemTypes = { Item.Weapon, Item.Armor, Item.Jewel, Item.Banner },
		items = {
			{ id = 'g000ig0001', min = 2, max = 3 },
			{ id = 'g000ig0006', min = 2, max = 3 },
			{ id = 'g000ig0018', min = 1, max = 1 }, --мазь
			orr({ id = rmsb(), min = 1, max = 1 }, { id = 'g000ig7006', min = 1, max = 1 }), --сл.большой шар/Сапфир
			{ id = p05(), min = 1, max = 1 }, --пермо5
			{ id = p05(), min = 1, max = 1 }, --пермо5
			{ id = e4(), min = 1, max = 1 }, --эликсир400
		}
	}
}
end

----------------------


-- СВОДНЫЕ ТАБЛИЦЫ

-- Вернет таблицу с описанием Респа 0
function getPlayerZone00(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.PlayerStart,
		race = playerRace,
		size = zoneSize,
		mines = getMinesRespZ(playerRace),
		ruins = zoneRuinRespZ0(),
		bags = bagsResp00(),
		stacks = {zoneStacksRespZ00(), zoneStacksRespZ001(), zoneStacksRespZ002(), PredSkin(135, 145, 100, 100), PredSkin(145, 155, 100, 100)},
		merchants = zoneMerchRespZ0(),

		capital = {
			garrison = { -- столица
				subraceTypes = { getPlayerSubRace(playerRace) },
				value = { min = 50, max = 50 },
				loot = {
--					itemTypes = { Item.PotionBoost },
--					value = { min = 1500, max = 1500 },
--					itemValue = { min = 150, max = 250 },
					items = {
						{ id = 'g000ig0001', min = 4, max = 4}, --рес
						{ id = 'g000ig0006', min = 4, max = 4}, --хил100
						{ id = 'g001ig0378', min = 3, max = 3}, --хил75
						{ id = 'g000ig0005', min = 5, max = 5}, -- хил50
						{ id = 'g001ig0180', min = 6, max = 6}, -- хил25

						{ id = 'g000ig0002', min = 1, max = 1 }, --15
						{ id = 'g000ig0014', min = 1, max = 1 }, --15
						{ id = 'g000ig0011', min = 1, max = 1 }, --15
						{ id = 'g000ig0008', min = 1, max = 1 }, --15
						{ id = b15(), min = 1, max = 1}, -- случ. банка15

						{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0024', min = 1, max = 1 }, -- вард
						{ id = w15(), min = 1, max = 1}, -- случ. вард
						
						orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), -- вард разума / вард смерти

						{ id = rnd(d15(),'g001ig0490','g001ig0128','g002ig0008'), min = 1, max = 1}, -- случ. дотвард / Зелье выносливости +15%оз / вард оружия / Эликсир скрытого потенциала 500 (20оз +7точ.вт.атаки)
						
						-- сфера
						{ id = rnd('g001ig0458','g000ig9031','g000ig9022','g001ig0302','g001ig0189','g001ig0178','g001ig0472','g001ig0473','g001ig0192'), min = 1, max = 1}, -- 25 Сфера Каменного проклятия / Сфера Ливня | Сфера Углей / Сфера Шторма / -- 50 Сфера Камня / Сфера Костра | Сфера Ледяного осколка / Сфера Статического разряда / Сфера Пыток

						{ id = ExtraMana(playerRace), min = 1, max = 1 }, --доп.шар
						
						-- свиток
						{ id = rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101','g000ig5007','g000ig5102'), min = 1, max = 1}, -- свиток л.щит, сила, с.кости, с.витара / -- свиток устр. гимн, tormentio-броня, слабость, стая / Свиток "Исцеление" / Свиток "Стойкость рощи" +15оз

					}
				},
			},
			spells = {
				CapSpell(playerRace)
			}			
		}
	}
end

-- Вернет таблицу с описанием зоны 1
function getPlayerZone0(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.Junction,
		race = playerRace,
		size = zoneSize,
		towns = zoneTownsResp0(),
		merchants = zoneMerchRespZ(),
		ruins = zoneRuinRespZ(),
		bags = bagsResp0(),
		mines = getMinesRespZ2(playerRace),
		stacks = {Pred1RespZ0(), Pred1RespZ01(), Pred1RespZ02(), Pred1RespZ03(), Pred1RespZ04(), Pred1RespZD(), PredSkin(210, 220, 200, 225), PredBarb(220,230,100,200)},

	}
end

-- Респ: Вернет таблицу с описанием зоны 2
function getPlayerZone(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.Junction, -- Junction -- Treasure
		race = playerRace,
		size = zoneSize,
		towns = zoneTownsResp(playerRace),
		merchants = zoneMerchResp(),
		ruins = zoneRuinResp(),
		mercenaries = zoneMercenZone12(playerRace),
		mines = getMinesResp(playerRace),
		mages = zoneMageResp(),
		stacks = {zoneStacksResp(), zoneStacksResp1(), Pred1Resp01(), Pred1Resp1(), Pred1Resp2(), Pred1Resp3(), Pred1Resp4(), Pred1Resp5(), Pred1RespD(), PredSkin(390, 400, 200, 250), PredBarb(480,484,200,400)},
		bags = bagsResp(),
	}
end

-- Вернет таблицу с описанием зоны 3
function getTreasureZone34(zoneId, playerRace, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		type = Zone.Junction,
		size = zoneSizeTre,
		towns = zoneTownsZone34(playerRace),
		merchants = zoneMerchZone34(),
		ruins = zoneRuinZone34(),
		mines = getMinesZone34(playerRace),
		mages = zoneMageZone34(),
		mercenaries = zoneMercenZone(playerRace),
		stacks = {zoneStacksZone34(), Pred1Zone1(), Pred1Zone2(), Pred1Zone3(), Pred1Zone4(), Pred1ZoneD(), PredBarb(770,774,400,550) },
		bags = bagsZone34(),
	}
end

-- Вернет таблицу с описанием зоны 4 (центр)
function getTreasureZone5(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {

		race = playerRace,
		race2 = playerRace2,
		
	id = zoneId,
		type = Zone.Treasure,  
		size = zoneSizeTre,
		towns = zoneTownsZone5(),
		merchants = zoneMerchZone5(),
		mercenaries = zoneMercenZone4(playerRace, playerRace2),
		ruins = zoneRuinZone5(),
		mines = getMinesZone5(playerRace, playerRace2),
		stacks = {zoneStacksZone5(), zoneStacksZone501(), zoneStacksZone502(), zoneStacksZone503(), Pred1Zone51(), Pred1Zone52(), Pred1Zone53(), Pred1Zone54(), Pred1Zone5D(), PredBarb(1550,1600,500,600) },
		bags = bagsZone5(),
		--mages = zoneMageZone5(),
	}
end

-- Вернет таблицу с описанием зоны-тренера
function getTreasureZoneTrainers(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {
--	border = Border.Water,
	id = zoneId,
		ruins = zoneRuinTrainers(),
		race = playerRace,
		race2 = playerRace2,
		type = Zone.Junction,  -- Junction -- Treasure
		size = zoneSizeTre,
		mines = getMinesX(playerRace, playerRace2),
		mages = zoneMageTrainer(),
		mercenaries = zoneMercenZoneX(playerRace2),
--		bags = bagsRespX(), -- криво генерит с сундуком!
		stacks = { PredSkinX(13/kef, 25/kef, 0, 0), PredSkinX(26/kef, 32/kef, 50, 50), PredSkinX(40/kef, 55/kef, 100, 100), PredSkinX(60/kef, 70/kef, 150, 150) },
		trainers = {{ guard = gmm({}, PredSkin(80, 87, 100, 100)) }},
	}
end

-------------------------------------------------


-- РАЗМЕРЫ ЗОН: Вернет таблицу с зонами
function getZones(races)
	local zones = {}

	zones[1] = getPlayerZone00(0, races[1], 5) -- красный 5
	zones[2] = getPlayerZone0(1, races[1], 7) -- зелёный 7
	zones[3] = getPlayerZone(2, races[1], 10) -- синий 10
	zones[4] = getTreasureZone34(3, races[1], 9) -- белый 9
	zones[5] = getTreasureZone5(4, races[1], races[2], 13) -- чёрный 13
	zones[6] = getTreasureZone34(5, races[2], 9) -- серый
	zones[7] = getPlayerZone(6, races[2], 10) -- жёлтый
	zones[8] = getPlayerZone0(7, races[2], 7) -- голубой
	zones[9] = getPlayerZone00(8, races[2], 5) -- пурпурный
	-- зоны тренера
	zones[10] = getTreasureZoneTrainers(9, races[1], races[2], 5) -- 5
	zones[11] = getTreasureZoneTrainers(10, races[2], races[1], 5) -- 	
	
	return zones
end

----------------------

-- ПРОХОДЫ: Вернет таблицу с проходами между зонами:
function getZoneConnections()
	return {

{from = 2, to = 4, guard = zoneGuardZone0()}, 
{from = 3, to = 4, guard = zoneGuardZone()}, 	
	
{from = 4, to = 6, guard = zoneGuardZone0()}, 
{from = 4, to = 5, guard = zoneGuardZone()}, 


---


--{from = 1, to = 0}, {from = 1, to = 0}, {from = 1, to = 0}, {from = 1, to = 0}, {from = 1, to = 0}, {from = 1, to = 0},
{from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1}, 
{from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2},
{from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3},  
{from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6},  
{from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7},  
{from = 7, to = 8}, {from = 7, to = 8}, {from = 7, to = 8}, {from = 7, to = 8}, {from = 7, to = 8}, 


-- новое
{from = 3, to = 9, guard = zoneGuardZoneR()}, {from = 5, to = 10, guard = zoneGuardZoneR()},
{from = 0, to = 10},{from = 0, to = 10},{from = 0, to = 10},
{from = 9, to = 8},{from = 9, to = 8},{from = 9, to = 8},	

-- респы в центр
--{from = 0, to = 4},
--{from = 8, to = 4},
-- тренер в центр
{from = 9, to = 4},
{from = 10, to = 4},

}
end

-- Вернет описание содержимого сценария для генератора - ОК
function getTemplateContents(races)
	local contents = {}
	
	contents.zones = getZones(races)
	contents.connections = getZoneConnections()

	return contents
end

-- ШАБЛОН
template = {
	name = gmm('Outrunner 2.9', 'Outcross 2.9'),
	description = gmm('Шаблон для игры 1 лидер, 1 жезловик, 1 вор.\nЧерная зона в центре, ее должны касаться: синяя, желтая, белая, серая, т.зеленая, оранжевая.\nСпасибо за поддержку! Карта Тинькофф: 2200700846776804','Шаблон для классической игры несколькими лидерами.\nЧерная зона в центре, ее должны касаться: синяя, желтая, белая, серая, т.зеленая, оранжевая.\nСпасибо за поддержку! Карта Тинькофф: 2200700846776804'),
	minSize = 72,
	maxSize = 72,
	maxPlayers = 2,
	startingGold = gmm(700,1100),
	startingNativeMana = gmm(100,300),
	roads = gmm(45,40), --45,41
	forest = gmm(30,30), --42,40


-- Исключения юнитов
forbiddenUnits = {

-- Старндарные


-- Фракционные герои-лидеры и их вторые формы
'g000uu0021', --Архимаг
'g000uu8248', --Архимаг
'g000uu0020', --Следопыт
'g000uu0019', --Рыцарь на Пегасе
'g000uu0022', --Архангел
'g000uu0023', --Вор
'g000uu5300', --Вор
'g000uu0044', --Королевский страж
'g000uu0045', --Инженер
'g000uu0046', --Ученый
'g000uu8249', --Ученый
'g000uu0047', --Старейшина
'g000uu0048', --Вор
'g000uu5301', --Вор
'g000uu0070', --Герцог
'g000uu0071', --Советник
'g000uu0072', --Архидьявол
'g000uu8250', --Архидьявол
'g000uu0073', --Баронесса
'g000uu0074', --Вор
'g000uu5302', --Вор
'g000uu0096', --Рыцарь Смерти
'g000uu0097', --Носферату
'g000uu8252', --Носферату
'g000uu0098', --Королева личей
'g000uu8253', --Королева личей
'g000uu0099', --Баньши
'g000uu0100', --Вор
'g000uu5303', --Вор
'g000uu8251', --Дриада
'g000uu8010', --Дриада
'g000uu8009', --Вассал леса
'g000uu8011', --Страж леса
'g000uu8012', --Мудрец
'g000uu8013', --Вор
'g000uu5304', --Вор

-- Фракционные герои-солдаты
'g001uu0021', --Архимаг
'g001uu0020', --Следопыт
'g001uu0019', --Рыцарь на Пегасе
'g001uu0022', --Архангел
'g001uu0023', --Вор
'g001uu0045', --Инженер
'g001uu0044', --Королевский страж
'g001uu0046', --Ученый
'g070uu0003', --Ученый
'g001uu0047', --Старейшина
'g001uu0048', --Вор
'g001uu0072', --Архидьявол
'g070uu0004', --Архидьявол
'g001uu0071', --Советник
'g001uu0070', --Герцог
'g001uu0073', --Баронесса
'g001uu0074', --Вор
'g001uu0098', --Королева личей
'g070uu0001', --Носферату
'g001uu0097', --Носферату
'g001uu0096', --Рыцарь Смерти
'g001uu0099', --Баньши
'g001uu0100', --Вор
'g001uu8010', --Дриада
'g070uu0002', --Дриада
'g001uu8009', --Вассал леса
'g001uu8011', --Страж леса
'g001uu8012', --Мудрец
'g001uu8013', --Вор

-- Фракционные призыватели-солдаты с большим кол-вом опыта
'g000uu8185', -- Магистр стихий
'g001uu7598', -- Теневидец
'g001uu8242', -- Xозяин масок
'g000uu0164', -- Повелитель волков

-- Фракционные хиллеры-солдаты с большим кол-вом опыта 
'g000uu0017', -- Аббатиса
'g000uu8035', -- Вильсида
'g002uu8039', -- Вердант
'g000uu7570', -- Епископ
'g000uu7569', -- Иерей
'g000uu8264', -- Иерарх
'g000uu0151', -- Прорицательница
'g000uu0013', -- Священник
'g000uu8214', -- Дриолисса
'g000uu8034', -- Солнечная Танцовщица
'g000uu0150', -- Патриарх
'g003uu8039', -- Древо жизни
'g003uu8038', -- Энт целитель
'g000uu8235', -- Сильфида
'g000uu2002', -- Целитель
'g003uu8037', -- Священное древо

-- нейтральные лидеры с низкой неподкупностью 20%
'g000uu5236', -- Гном
'g000uu5117', -- Гоблин
'g000uu5101', -- Крестьянин
'g000uu8308', -- Молодой триббог
'g000uu5130', -- Разбойник
'g000uu7556', -- Гоблин-жгун
'g000uu7533', -- Псина
'g000uu7510', -- Птица рух лидер
'g000uu7616', -- Гном упырь лидер
'g000uu6004', -- Толстый бес л.
'g000uu5201', -- Сквайр л.
'g000uu7539', -- Колотун
'g000uu7592', -- Торхот
'g000uu7516', -- Энт Малый л.
'g000uu5262', -- Сектант л.
'g000uu7614', -- Искатель рун лидер
'g000uu7553', -- Ведунья-лидер

--Все нейтральные хиллеры с большим кол-вом опыта (лидеры и солдаты)
'g000uu8287', -- Св.дерево л.
'g000uu8288', -- Энт целитель л.
'g000uu7519', -- Вердант л.
'g000uu8215', -- Дриолисса л.
'g000uu8262', -- Знахарка л.
'g000uu8289', -- Древо жизни л
'g000uu7521', -- Целитель л.
'g000uu5006', -- Великий Оракул
'g000uu8222', -- Волхв л. бафер
'g000uu8218', -- Волхв
'g000uu7544', -- Настоятельница
'g000uu8213', -- Гоблин-шаман
'g001uu8262', -- Знахарка
'g000uu2021', -- Проповедник
'g000uu6107', -- Темный эльф-жрец
'g000uu7619', -- Слуга культа
'g000uu8044', -- Темный Эльф Гаст л.


------------- Исключения юнитов Аутран
'g000uu8266', -- Дроттар--
'g000uu8265', -- дева пламени--
'g001uu0171', -- Двойник
'g000uu8217', -- Призрачный дракон л.
'g000uu8216', -- Призрачный дракон
'g000uu8269', -- Кровавый дракон л.
'g001uu8269', -- Кровавый дракон
'g000uu5022', -- Черный дракон
'g000uu5122', -- Черный дракон л.
'g000uu8144', -- темный эльф гаст л.
'g000uu2007', -- Мумификатор
'g000uu2008', -- Длань Мортис
--+
'g000uu2022', -- Ламия
'g000uu8263', -- Чернокнижница


},

forbiddenItems = {


-----------СТАНДАРТНЫЕ
-- ОСНОВНЫЕ
'g000ig6008', --Посох невидимости
'g000ig6017', --Посох дневного света
'g000ig6018', --Посох сумерек
'g000ig5092', --Свиток "terra illudere"
'g000ig0019', --Эликсир молниеносности
'g000ig0020', --Эликсир могущества
'g000ig0017', --Эликсир неуязвимости
'g001ig0126', --Эликсир Всевышнего
'g001ig0129', --Зелье вампиризма50
'g001ig0020', --Великая аура вампиризма
'g001ig0035', --Великая аура жизненной силы
'g000ig5051', --Свиток "sanctuera"
'g000ig5083', --Свиток "свет дня"
'g000ig5095', --Свиток "сумерки"
'g000ig8005', --Семимильные сапоги
'g000ig9006', --Сфера окаменения
'g000ig9039', --Сфера ужаса
'g001ig0596', --Линарет

-- ПРЕДМЕТЫ НА УСКОР/РЕЗ МУВОВ
'g000ig5032', --Свиток "Песнь скорости"
'g000ig5053', --Свиток "Paraseus"
'g000ig5094', --Свиток "Псалом Смерти"
'g000ig6004', --Посох парализации
'g000ig6005', --Посох путника
'g001ig0390', --Посох терна
'g001ig0389', --Посох первооткрывателя
'g001ig0513', --Зелье твердого шага

-- ЕЩЁ
'g001ig0575', --Свиток "Подавляющая жизнь

------------------ АУТРАН
'g001ig0414', --Отравленный вороний коготь (Артефакт)--
'g000ig3015', --кристалл души (артефакт)--
'g000ig3016', --рог инкуба (артефакт)--
'g001ig0158', --ужасающий топор (артефакт)--
'g000ig3021', --кольцо колдуньи (артефакт)--
'g001ig0155', --Благословенный браслет (Артефакт)

'g000ig9040', --Сфера Полиморфа
'g000ig9043', --Сфера ярости

'g000ig2007', --ржавые кандалы--
'g000ig1011', --сапоги мореплавания
'g001ig0044', --Сердце океана (Артефакт)

--'g001ig0153', --Знамя вампиризма 25%
'g001ig0154', --знамя поглощения--50%
'g001ig0366', --Стяг багровых рек вампиризма 25% + вард тауматургии

'g000ig5027', --свиток мореплавания
'g000ig5006', --Свиток "Ускорение"--
'g000ig5100', --Свиток "Скорость"--
'g000ig5113', --Свиток "Порыв"--
'g000ig5099', --Свиток "Опутывание"--
'g001ig0094', --Свиток "Поспешность" отступление
'g000ig5120', --Свиток "Проворство" отступление

'g000ig9140', --Талисман лесной колдуньи 800


--посох
'g001ig0386', -- Посох семи ветров
'g000ig6019', -- Посох Листвы 400 (обидно ну)

--релик
'g000ig4005', -- Книга войны (цена 450 - генерится с другими реликами)

'g001ig0531', -- Зелье слова (цена 500 генерится с другими пермобанками)
'g001ig0524', -- Зелье завоевателя (цена 500 генерится с другими пермобанками)

'g001ig0317', -- Зелье дьявольских таинств  (+15% пермо вампирик) 600

'g001ig0195', --Свиток "Откровение" (для аутрана не катит)
'g001ig0439', --Свиток "Et seminibus discordiae - Уменьшает лидерство на 1 в области 5x5 (не для аутранера)
'g001ig0440', --Свиток "Проклятие безволия минус лидерство
'g001ig0092', --Свиток "Гниение леса" за 400 в ролле нафиг надо
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа за 700 в ролле нафиг надо
'g000ig5118', --Свиток "Ослепления" Уменьшает обзор противника на 3 в радиусе 5х5.
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа.
'g000ig5059', --Свиток "Incantare Avenger Illudere" (Фантом Адского Мстителя)

},
	
	getContents = getTemplateContents
}