-- ЗОНА			|ИГРОК1		|ИГРОК2
----------------------------------------
-- Cтолица		|красная	|пурпурная	|
-- Зона т1		|зелёная	|голубая	|
-- Зона т2		|синяя		|жёлтая		|
-- Зона т3		|белая		|серая		|
-- Зона-тренер	|т.зеленая	|оранжевая	|
-- Трежа		|		чёрная			|
-----------------------------------------
-- Чёрной зоны касаться: синяя, жёлтая, белая, серая, т.зеленая, оранжевая!

---------------
-- НАСТРОЙКИ

-- режим карты (1 - для игры одним героем; 2 - для классической игры)
local gmode = 1

-- коэффициент сложности (0.6-0.8 легко; 0.8-1 средне; >1 сложно) [страндарт = 0.92]
local kef = 0.92

-- коэффициент разброса силы нейтралов по умолчанию [страндарт = 1.05]
local kr = 1.05

----------------
-- КОД ШАБЛОНА

-- переменные для ист-ков т1-т2 (для каждой расы)
	local tbla = {1,0}
	local tblb = {1,0}
-- переменные для ист-ков зона тренера (для каждой расы)
	local tbl = {1,0,0,0}	

------

-- 600x7 [пермо для ГО] "Честный труд" (сапоги) / Зелье завоевателя (желы) / Зелье оруженосца (знамя) / Зелье постижения (релики) / Зелье слова (свитки) / Каталог магических сфер / Эликсир учености (арты)
tp2p = {'g001ig0528', 'g001ig0524', 'g001ig0526', 'g001ig0527', 'g001ig0531', 'g001ig0529', 'g001ig0525'} 

-- пермо для лавки т0-т1 / города т1
function gtp0p()
	tp0p = {}
	table.insert(tp0p, 'g001ig0530') -- Зелье посмертного зова (талики)
	table.insert(tp0p, rnd('g001ig0026','g001ig0130')) -- Аура регенерации | Эликсир регенерации
	table.insert(tp0p, 'g000ig0010') -- Эликсир внимательности 10точн 500
	
end

-- т. талисманов т1 з.т0 200
function gtal1()
	ttal1 = {}
	table.insert(ttal1, rnd('g001ig0267','g001ig0265','g001ig0266','g001ig0264','g000ig9101')) -- призыв
	table.insert(ttal1, rnd('g000ig9105','g000ig9131')) -- урон
end

-- т. талисманов т2 з.т1 400-500
function gtal2()
	ttal2 = {}
	table.insert(ttal2, 'g000ig9109') -- призыв
	table.insert(ttal2, 'g000ig9120') -- вард
	table.insert(ttal2, 'g001ig0184') -- хил
end

-- т. талисманов т3 з.т2 800
function gtal3()
	ttal3 = {}
	table.insert(ttal3, 'g001ig0259') -- призыв
	table.insert(ttal3, rnd('g000ig9128','g001ig0063')) -- урон
	table.insert(ttal3, 'g000ig9116') -- хил
end

-- т. талисманов т4 з.т3 1000
function gtal4()
	ttal4 = {}
	table.insert(ttal4, 'g001ig0202') -- призыв
	table.insert(ttal4, rnd('g000ig9130','g000ig9123')) -- урон
end

-- т. талисманов т5 з.т3 1200-1800
function gtal5()
	ttal5 = {}
	table.insert(ttal5, 'g000ig9103') -- призыв
	table.insert(ttal5, rnd('g000ig9136','g001ig0185')) -- урон
end


------

	-- Заклы баш_т2 т1статы*5шт : быстрота +7и, Menta minoris -5у.т., слабость -5уи, стая -10у, Стойкость рощи +15оз		
	local tblmg2t1 = {'g000ss0002','g000ss0044','g000ss0064','g000ss0101','g000ss0102'} 
	-- Заклы баш_т2 т1двойные_бафы*4шт : Ледяной щит / Стальные кости +7б, сила витара / сила +10у		
	local tblmg2t1b = {'g000ss0021','g000ss0181','g000ss0023','g000ss0003'} 
	-- Заклы баш_т2 т1двойные_дебафы*6шт : tormentio / Ржавчина -10б, Порченная руна / неудача -10т, Смятение / Устрашающий гимн -10и		
	local tblmg2t1d = {'g000ss0045','g000ss0065','g000ss0134','g000ss0178','g000ss0106','g000ss0179'} 

	-- Заклы баш_т2 т12*6шт : Дикие саженцы / Исцеление / Ритуал исцеления / Заступничество / Отсрочка неизбежного / Соколиная зоркость
	local tblmg2t2 = {'g000ss0107','g000ss0007','g000ss0029','g000ss0197','g000ss0124','g000ss0126'} 

--Башня магии в зоне 2
function zoneMageResp()
	mix(tblmg2t1)
	mix(tblmg2t1b)
	mix(tblmg2t1d)
	mix(tblmg2t2)
	return {
		{
			spells = { 	tblmg2t1[1], tblmg2t1[2], 
						tblmg2t1b[1], 
						tblmg2t1d[1],
						tblmg2t2[1], tblmg2t2[2], tblmg2t2[3], 
			},			
			guard = gmm({}, guard2m())
		}
	}
end

	-- Заклы баш_т3 
	-- Заклы баш_т3 т2статы*8шт : сокрушение -15броня, прокл.эмира -15урон / Cursa demoneus -15урон, terebrare corde -10точ.урон, Chronos -15ини, Спешащее время +10ини5урон, могущество +15урон, Песнь слез -10точность, Заколдованное оружие +10точн.вард.осл
	local tblmg3t2 = {'g000ss0183','g000ss0184','g000ss0185','g000ss0050','g000ss0186','g000ss0187','g000ss0133','g000ss0034'} 

	-- т3*7шт : Призыв II: Валькирия / Призыв III: Энт Большой, Terra oblivionem -25опыт, Туман Смерти, Божественная мудрость (+15 опыт), Затопление, Излечение (+60 хил), Искусный торговец -20% скидка
	local tblmg3t3 = {'g000ss0031','g000ss0108','g000ss0199','g000ss0074','g000ss0175','g000ss0144','g000ss0110','g000ss0085'}
	
	-- т45*7шт : Неподкупность, Merum facies -окам полим, Слабость плоти -оружие, Слабость разума -разум, Песнь Вотана +100 хил, Призыв IV: Танатос, Сумерки -закрывает карту
	local tblmg3t4 = {'g000ss0039','g000ss0127','g000ss0202','g000ss0203','g000ss0040','g000ss0078','g000ss0095'}

	-- минус_вард+_доп*5шт : Dominatum ignis -вард огонь, Небесный молот -вард воздух, Пробирающий холод -вард вода, Хворь -вард земля, Забвение -свитки сферы талики
	local tblmg3tw = {'g000ss0206','g000ss0209','g000ss0207','g000ss0208','g000ss0166'} 
	
	-- ударка-40взоне*4шт : Potentia Ignis, Духи льда, Лавина, Смерч Смерти, Цепь молний
	local tblmg3tu = {'g000ss0090','g000ss0086','g000ss0112','g000ss0093','g000ss0081'} 
	
	-- 

--Башня магии в зоне 3
function zoneMageZone34()
	mix(tblmg3t2)
	mix(tblmg3t3)
	mix(tblmg3t4)
	mix(tblmg3tw)
	mix(tblmg3tu)
	return {
		{
			spells = { 	tblmg3t2[1], tblmg3t2[2], tblmg3t2[3],
						tblmg3t3[1],
						tblmg3t4[1],
						tblmg3tw[1],
						tblmg3tu[1],
			},			
			guard = guard3m()
		}
	}
end


--Башня магии в зоне тренера
function zoneMageTrainer()
	return {
		{
			spells = { 	
						rnd('g000ss0043','g000ss0024','g000ss0097','g000ss0004','g000ss0062'), -- Ignis mare / Буран / Кустарник / Молния / Мор	
						rnd('g000ss0001','g000ss0010','g000ss0180','g000ss0182'), -- Защита от магии Воздуха / Защита от магии Земли / Ardenti aqua / Спокойствие пламени
						rnd('g000ss0119','g000ss0022'), -- Водосточный колодец / Хождение по лесу
						rnd('g000ss0147','g000ss0020'), -- Infernus (-крит,-РБ,-вампирик) / Приказ сира Аллемона
						rnd(rnd('g000ss0192','g000ss0191'),'g000ss0177'), -- Песнь Мимира | Проведение Всевышнего / Откровение 
						rnd('g000ss0152','g000ss0176'), -- Подкуп / Лисья хитрость
						rnd('g000ss0030','g000ss0068','g000ss0041','g000ss0047'), -- Взгляд Сивиллы / Тень / Incantare Hellhound / Incantare Beliarh Illudere
			},			
			guard = gmm({}, PredSkin(80, 87, 100, 100)),
		}
	}
end

----------------------

-- Город т1

local tierTowerResp0 = 1

function zoneTownsResp0()
	return {
	{
		tier = tierTowerResp0,
		stack = {
		subraceTypes = rsub(),		
			value = { min = gmm(250,300)*kef, max = gmm(263,315)*kef },
			loot = {
				itemTypes = { Item.Weapon, Item.Armor, Item.TravelItem }, -- 3+2+7
				value = { min = 300, max = 375 },
				itemValue = { min = 300, max = 375 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = gmm(1,2), max = gmm(1,2) }, -- хил100
					orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), -- хил25*2/хил 50
					gmm({ id = rnd('g000ig7001',rmss()), min = 1, max = 1 }, { id = rnd('g000ig7002',rms()), min = 1, max = 1 }), -- кольцо50 | м.шар / кольцо100 | шар	
					orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
					{ id = rnd(b15(),'g000ig0008'), min = 1, max = 1 }, -- случ. банка15 / точность15 
					
					-- банка на талики / реген / точность
					{ id = rndy(tp0p), min = 1, max = 1 },
				}
			}
		}
	}
	}
end

-- Город т2
local tierTowerResp = 2

function zoneTownsResp(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerResp,
		stack = {
				subraceTypes = rsub(),
			value = { min = gmm(380,430)*kef, max = gmm(400,450)*kef },
			loot = {
				items = {
					{ id = 'g000ig0001', min = gmm(1,2), max = gmm(1,2) }, --рес
					{ id = 'g000ig0006', min = gmm(1,2), max = gmm(1,2) }, -- хил100
					{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
					gmm({ id = 'g000ig7002', min = 1, max = 1 },{ id = 'g000ig7005', min = 1, max = 1 }), --кольцо100/изумруд150
					orr({ id = 'g000ig0024', min = 1, max = 1 },{ id = 'g000ig0023', min = 1, max = 1 }), -- вард огня/земли
					{ id = rnd('g000ig0002','g002ig0007','g000ig0008'), min = 1, max = 1 }, --защита15 / Зелье магической устойчивости / точность15

					{ id = rnd(pw4e(),ExtraMana(playerRace)), min = 1, max = 1 }, -- Случ пермо-вард-эффект / шар доп маны

					-- Борода Имира (Реликвия) / Книга воды / Книга воздуха / Книга земли / Книга Огня / Книга тайного знания / 
					-- Медицинский трактат / Оковы долга (Реликвия) / Перчатки дуэлянта (Реликвия) / Череп Танатоса (Реликвия) / 
					-- Сапоги ассасина / Тяжелые сапоги / Счастливая кость (Артефакт) / Святая чаша (Артефакт) / Книга постижения
					{id = rnd('g001ig0421','g000ig4002','g000ig4001','g000ig4003','g000ig4004','g000ig4006','g000ig4007','g001ig0610','g001ig0099','g000ig3020','g001ig0111','g001ig0114','g001ig0182','g000ig2002','g001ig0605'), min = 1, max = 1},
				}
			}
		}
	}
	}
end


-- Город т3
local tierTowerZone = 3

function zoneTownsZone34(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerZone,
		stack = {
			subraceTypes = NoUndead(),
			value = { min = gmm(780,850)*kef, max = gmm(820,890)*kef },
			loot = {
				itemTypes = { Item.Jewel, Item.Weapon, Item.Armor, Item.TravelItem }, --5+5+6+1
				value = { min = 800, max = 800 },
				itemValue = { min = 800, max = 800 },
				items = {
					{ id = 'g000ig0001', min = gmm(1,2), max = gmm(1,2) },
					{ id = 'g000ig0006', min = gmm(2,3), max = gmm(2,3) },
					gmm({ id = 'g000ig7003', min = 1, max = 1 }, { id = 'g000ig7004', min = 1, max = 1 }), --изумруд150/золотое кольцо200
					{ id = rnd('g000ig9020','g000ig9016','g001ig0469','g001ig0489','g001ig0478'), min = 1, max = 1 }, -- Сфера Энергии +25все / Сфера Великого исцеления +80-все / Сфера Пожара 55дот / Сфера Угнетения 100урон / Сфера Переохлаждения 40дот
					orr({ id = 'g001ig0128', min = 1, max = 1 },{ id = 'g001ig0125', min = 1, max = 1 }), -- вард оружия/разума
					{ id = rnd('g000ig0014','g002ig0007','g000ig0008','g000ig0011','g002ig0005',e2()), min = 1, max = 1 }, --защита15 / Зелье маг.уст. / точность15 / ини15 / Зелье набл.-15воры / эликсир200
					
					{ id = rnd(pw4d(),ExtraHomeMana(playerRace)), min = 1, max = 1 }, -- пермо-вард-дот / шар родной манны
				}
				
			}
		}
	},
	}
end

-- Город т4
function zoneTownsZone5()
	return {
	{
		tier = 1,
		stack = {
			subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
			value = { min = 1705*kef, max = 1790*kef }, -- было 1550*10%
			loot = {
				items = {
					{ id = 'g000ig0001', min = 2, max = 2 },
					{ id = 'g000ig0006', min = gmm(2,3), max = gmm(2,3) }, -- хил100
					gmm({ id = 'g000ig7004', min = 1, max = 1 },{ id = 'g000ig7005', min = 1, max = 1 }), -- золотое кольцо200/рубин250
					orr(orr({ id = 'g000ig1004', min = 1, max = 1}, { id = 'g000ig1002', min = 1, max = 1}), orr({ id = 'g000ig1008', min = 1, max = 1}, { id = 'g000ig1006', min = 1, max = 1})), -- Знамя битвы, Знамя неуязвимости, Знамя энергии, Знамя скорости		
					{ id = spherex(), min = 1, max = 1 }, -- сфера икс
					{ id = e4(), min = 1, max = 1 }, --эл400
					{ id = rnd('g000ig0015','g000ig0003','g000ig0012','g002ig0006'), min = 1, max = 1 }, --урон30/защита30/ини30/Зелье бдительности -30воры
					
					{ id = rnd('g000ig0018',pw6(),rms()), min = 1, max = 1 }, -- хил200/пермовард/случ.шар манны
				}
			}
		}
	}
	}
end

----------------------

-- Лавка т0 на Респе
function zoneMerchRespZ0() -- свиток т1

--арты 300x5: наручи, р.камень, Цепи жертвенности, Цеп Хана, Загробный фонарь
local artRespZ0 = {'g000ig3001','g000ig2001','g001ig0611','g001ig0100','g001ig0609'}

--релики 300-400x7: Книга божественных даров, Книга наследия, Книга странника, обод мёртв, Череп Хана, Фолиант Мысли, Куртка капитана
local relRespZ0 = {'g001ig0493','g001ig0495','g001ig0494','g000ig3008','g001ig0101','g000ig4008','g001ig0426'}

--сфера 100x11: Каменного проклятия, Ливня, Углей, Шторма, Камня, Костра, Ледяного осколка, Статического разряда, Подавления, Пыток, Чумы
local orbRespZ0 = {'g001ig0458','g000ig9031','g000ig9022','g001ig0302','g001ig0189','g001ig0178','g001ig0472','g001ig0473','g001ig0470','g001ig0192','g000ig9033'}

mix(artRespZ0)
mix(relRespZ0)
mix(orbRespZ0)

return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 200, max = 200 },
			itemValue = { min = 200, max = 200 },
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 2 }, --15
				{ id = 'g000ig0014', min = 1, max = 2 }, --15
				{ id = 'g000ig0011', min = 1, max = 2 }, --15
				{ id = 'g000ig0008', min = 1, max = 2 }, --15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард
				
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард

				-- Зелье наблюдательности / Зелье магической устойчивости x 2
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}),

				-- Зелье ясного взора (+2 обзора) / Зелье дозорного (+1 обзор) / Эликсир маскировки 400
				{ id = rnd('g001ig0533', 'g001ig0532', 'g001ig0006'), min = 1, max = 1 },
				-- банка на талики / реген / точность
				{ id = rndy(tp0p), min = 1, max = 1 },

--				orr({ id = 'g001ig0530', min = 1, max = 1 }, { id = 'g001ig0006', min = 1, max = 1 }), -- Зелье посмертного зова (талисманы) / Эликсир маскировки
--				orr({ id = 'g001ig0526', min = 1, max = 1 }, { id = 'g001ig0527', min = 1, max = 1 }), -- Зелье оруженосца (знамёна) / Зелье постижения (реликвии)
--				{ id = rnd(rnd('g001ig0529','g001ig0531'),'g001ig0528','g001ig0525'), min = 1, max = 1 }, --   Каталог магических сфер | Зелье слова (свитки) / Честный труд (сапоги) / Эликсир учености (артефакты)

				--сапоги
				{ id = rnd(rnd('g001ig0105','g001ig0107','g001ig0108','g001ig0106'),'g001ig0113','g001ig0110'), min = 1, max = 1 }, -- Литейные сапоги (огонь) / Сапоги ветров (воздух) / Гномьи сапоги (вода) / Сапоги каменщика (земли) // сапоги укрепл / лёгкие

				--арты
				{ id = artRespZ0[1], min = 1, max = 1 },
				{ id = artRespZ0[2], min = 1, max = 1 }, 

				--релики
				{ id = relRespZ0[1], min = 1, max = 1 },
				{ id = relRespZ0[2], min = 1, max = 1 }, 

				--сферы
				{ id = orbRespZ0[1], min = 1, max = 1 }, 
				{ id = orbRespZ0[2], min = 1, max = 1 },
				{ id = orbRespZ0[3], min = 1, max = 1 },
				{ id = orbRespZ0[4], min = 1, max = 1 },
				
				--посох
				orr(orr({ id = 'g001ig0383', min = 1, max = 1 }, { id = 'g001ig0387', min = 1, max = 1 }), orr({ id = 'g000ig6001', min = 1, max = 1 }, { id = 'g000ig6003', min = 1, max = 1 })), -- Посох первых побегов (малый энт) / Посох следопыта (хождение по лесу) / Посох грома (15 дамаг) /  Посох святости (30 хила)

				--талик
				{ id = rndy(ttal1), min = 1, max = 1}, -- талик т1
--				orr({ id = 'g000ig9105', min = 1, max = 1}, { id = 'g000ig9131', min = 1, max = 1}), --  Талисман Костра / Талисман Ливня 200				
--				{ id = rnd('g001ig0265','g001ig0267','g001ig0266','g001ig0264','g000ig9101'), min = 1, max = 1}, -- Талисман кузнеца, Талисман еретика, Талисман лесного воина, Талисман мертвеца, Талисман Сквайра

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				-- { id = rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101'), min = 1, max = 1 }, -- свиток л.щит, сила, с.кости, с.витара, свиток устр. гимн, tormentio-броня, слабость, стая
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g001ig0492', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Проведение Всевышнего" (сферы) 
			}
		},
			guard = gmm({}, guard0()),
	}
}
end


-- Лавка т1
function zoneMerchRespZ() -- свиток т1

--арты 5x400-500: Потайной кинжал, Руна защиты Фрейра, св.чаша, счастл. кость, Амулет Кракена
local artRespZ = {'g002ig0001','g001ig0418','g000ig2002','g001ig0182','g001ig0048'}

--релики 400-500x11: книга колдовства, книга т.з., Борода Имира, Кожаные эльфийские доспехи, перчатки, Медицинский трактат, книга возд / книга воды / книга земли / книга огня
local relRespZ = {'g001ig0497','g000ig4006','g001ig0421','g001ig0428','g001ig0099','g000ig4007',rnd('g000ig4001','g000ig4002','g000ig4003','g000ig4004')}

--знамёна 6x400+500: защиты, выносл, силы, сражения
local flagRespZ = {'g000ig1001','g001ig0051','g000ig1007','g000ig1003'}

--сферы 200x6: Сфера Брони I +15брони-1 200, Сфера Вампиризма I +20вамп-1 200, Сфера Восстановления 30хил-аое 200, Сфера Охотника 40урона-1 200, Сфера Разрушения доспеха I -15брони-1 200, Сфера Урона I +20урон-1 200		
local orb200RespZ = {'g001ig0133','g001ig0446','g000ig9017','g001ig0471','g001ig0464','g001ig0450'}

--сферы 400x4: Сфера Молнии 80 400, Сфера Пламени 80урон 400, Сфера Святой земли 60хил-ряду 400, Сфера Вампиризма II 40-1 400
local orb400RespZ = {'g001ig0300','g001ig0187','g001ig0453','g001ig0176'}

mix(artRespZ)
mix(relRespZ)
mix(flagRespZ)
mix(orb200RespZ)
mix(orb400RespZ)

return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 200, max = 200 },
			itemValue = { min = 200, max = 200 },
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = 'g000ig0008', min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 1 }, -- возд.вард
				{ id = w15(), min = 1, max = 1 }, -- вард
				{ id = w15(), min = 1, max = 1 }, -- вард
				{ id = w15(), min = 1, max = 1 }, -- вард

				{ id = rnd('g001ig0125','g001ig0036'), min = 1, max = 1 }, -- вард разума/вард смерти

				-- Зелье наблюдательности / Зелье магической устойчивости x 2				
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}),
				
				-- банка на перк (но не на жезлы)
				{ id = rndybj(tp2p), min = 1, max = 1 },
				-- банка на талики / реген / точность
				{ id = rndy(tp0p), min = 1, max = 1 },
				
				-- зелье лорда
--				{ id = rnd(rnd('g001ig0529','g001ig0531'),'g001ig0528','g001ig0525'), min = 1, max = 1 }, --   Каталог магических сфер | Зелье слова (свитки) / Честный труд (сапоги) / Эликсир учености (артефакты)
--				orr({ id = 'g000ig0010', min = 1, max = 1 }, { id = '', min = 1, max = 1 }), -- Эликсир внимательности / Зелье посмертного зова (талисманы)

				--арты
				{ id = artRespZ[1], min = 1, max = 1 },
				{ id = artRespZ[2], min = 1, max = 1 }, 

				--релики
				{ id = relRespZ[1], min = 1, max = 1 },
				{ id = relRespZ[2], min = 1, max = 1 }, 

				--знамёна
				{ id = flagRespZ[1], min = 1, max = 1 },
				{ id = flagRespZ[2], min = 1, max = 1 }, 

				--сферы200
				{ id = orb200RespZ[1], min = 1, max = 1 }, 
				{ id = orb200RespZ[2], min = 1, max = 1 },
				--сферы400
				{ id = orb400RespZ[1], min = 1, max = 1 },
				{ id = orb400RespZ[2], min = 1, max = 1 },

				--сапоги
				{ id = rnd('g001ig0114','g001ig0111'), min = 1, max = 1 }, -- Тяжелые сапоги / Сапоги ассасина

				--посох
				orr(orr({ id = 'g001ig0394', min = 1, max = 1 }, { id = 'g000ig6012', min = 1, max = 1 }), orr({ id = 'g001ig0395', min = 1, max = 1 }, { id = 'g001ig0399', min = 1, max = 1 })), -- Посох северных стражей+10брони / Посох скорости+10ини / Посох наместника Махаля+10брони / Посох раздора-10ини

				--талик
				{ id = rndy(ttal2), min = 1, max = 1}, -- талик т2
--				{ id = rnd('g001ig0265','g001ig0267','g001ig0266','g001ig0264','g000ig9101'), min = 1, max = 1}, -- Талисман кузнеца, Талисман еретика, Талисман лесного воина, Талисман мертвеца, Талисман Сквайра
--				orr3({ id = 'g001ig0184', min = 1, max = 1 }, { id = 'g000ig9109', min = 1, max = 1 }, { id = 'g000ig9120', min = 1, max = 1 }), -- Талисман Восстановления 400 / Талисман призыва нейтралов II 450 / Талисман щита стихий 500

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				-- { id = rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101'), min = 1, max = 1 }, -- свиток л.щит, сила, с.кости, с.витара, свиток устр. гимн, tormentio-броня, слабость, стая
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g000ig5022', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Хождение по лесу"
			}
		},
			guard = gmm({}, guard1()),
	}
}
end

-- Лавка т2
function zoneMerchResp() -- свиток т2

--для первой лавки
--арты 800-1000x12: д.чаша, рун.жизн800, прокл.пепел950, Кольцо темных искуств, Рог возмездия, Руна верности, кров.свят, кол.силы, Щит телохранителя, серд.эмира, Эльфийская брошь
local artResp1 = {'g000ig3002','g001ig0047','g001ig0197','g001ig0487','g001ig0558','g001ig0417','g001ig0045','g000ig3003','g001ig0594','g000ig9137','g001ig0071'}

--релики 600-800x6: зуб людоеда, лютня650, Вечные латы, Кровавый покров, Шлем проклятого, Оковы долга
local relResp1 = {'g001ig0104','g000ig3022','g001ig0420','g001ig0422','g001ig0037','g001ig0610'}

--знамёна 600-800x5: гор.стр700, разум700,энерг700,искоренителя ереси600, главаря наемников800, быстроты550
local flagResp1 = {'g001ig0289','g001ig0145','g000ig1008','g001ig0370','g002ig0003','g000ig1005'}

--сферы 400-500x10: Прилива 80, Мучений 80, направленного ослабления I -33урон-1, Обширной коррозии I-10броня-аое, Прорицательницы 55хил аое, Урона II +40урон-1, Переохлаждения 40мороз непр., Бури 66 2x2, защиты от магии Смерти, Жажды 45вамп
local orbResp1 = {'g001ig0456','g001ig0496','g000ig9042','g001ig0475','g000ig9018','g001ig0134','g001ig0478','g001ig0467','g001ig0057','g000ig9024'}

--для второй лавки
--арты 700-1000x11: кинж. вамп., пер.песк1000, Благословенный браслет, рун.мол800, Камень врат, Руна благоволения Тиу, Рог непреклонности, Руна предвидения Вотана, Щит неведения, Наручи с черепом, Щит отражения, Череп шамана
local artResp2 = {'g000ig3017','g001ig0040','g001ig0155','g001ig0196','g001ig0582','g001ig0559','g001ig0557','g001ig0416','g001ig0589','g000ig2003','g001ig0591','g001ig0041'}

--релики 650-800x6: таира чистоты, череп танатоса, Латы Спасителя, Роба убийцы, Промасленная кольчуга, Нагрудник Стража
local relResp2 = {'g000ig2006','g000ig3020','g001ig0423','g001ig0430','g002ig0002','g001ig0427'}

--знамёна 700x: бан.неуд700, стяг.конц, горна, ража, неистовства, магии Воды, Воздуха, Земли, Огня
local flagResp2 = {'g001ig0293','g001ig0292','g001ig0361','g001ig0358','g001ig0357',rnd('g001ig0142','g001ig0140','g001ig0141','g001ig0139')}

--сферы 400-500x10: Вампира70, Скалы 80урон-1, Массового ослабления I -33урон аое, Разрушения доспеха II -30брони-1, Помощи 75хил 2x2, Замедления 50-1, Пожара 55крест, Боли 60 ряд, защиты от магии Разума, Оползня 50урон 2колоны
local orbResp2 = {'g001ig0191','g001ig0474','g001ig0461','g001ig0479','g001ig0454','g001ig0295','g001ig0469','g001ig0304','g001ig0058','g001ig0468'}

mix(artResp1)
mix(relResp1)
mix(flagResp1)
mix(orbResp1)

mix(artResp2)
mix(relResp2)
mix(flagResp2)
mix(orbResp2)

return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },
				
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард
				
				{ id = 'g001ig0125', min = 1, max = 2 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 1 }, -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 1 }, --Зелье магической устойчивости 
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости
				
				-- эликсир твердости / аура выносл / Эликсир обновления (+30 реген)				
				{ id = rnd('g000ig0004','g001ig0028','g001ig0376'), min = 1, max = 1 },
				-- случ. пермо-вард-эффект 
				{ id = pw4e(), min = 1, max = 1 }, --15

--				orr({ id = 'g001ig0528', min = 1, max = 1 }, { id = 'g001ig0525', min = 1, max = 1 }), -- Честный труд (сапоги) / Эликсир учености (артефакты)
--				orr({ id = 'g001ig0524', min = 1, max = 1 }, { id = 'g001ig0376', min = 1, max = 1 }), -- Зелье завоевателя (жезлы) / Эликсир обновления (+30 реген)
				
				--арты
				{ id = artResp1[1], min = 1, max = 1 },
				{ id = artResp1[2], min = 1, max = 1 }, 

				--релики
				{ id = relResp1[1], min = 1, max = 1 },
				{ id = relResp1[2], min = 1, max = 1 }, 

				--знамёна
				{ id = flagResp1[1], min = 1, max = 1 },
				{ id = flagResp1[2], min = 1, max = 1 }, 
				
				--доп. арт/релик/знамя
				{ id = rnd(artResp1[3],relResp1[3],flagResp1[3]), min = 1, max = 1 },

				--сферы
				{ id = orbResp1[1], min = 1, max = 1 }, 
				{ id = orbResp1[2], min = 1, max = 1 },
				{ id = orbResp1[3], min = 1, max = 1 },
				{ id = orbResp1[4], min = 1, max = 1 },

				--сапоги
				{ id = rnd('g000ig8003',rnd('g001ig0516','g001ig0523')), min = 1, max = 1 }, -- Сапоги скорости / Зелье омоложения разума (-10 опыт) | Зелье воеводы (опыт 10)

				--посох
				orr(orr({ id = 'g001ig0404', min = 1, max = 1 }, { id = 'g001ig0401', min = 1, max = 1 }), { id = 'g001ig0398', min = 1, max = 1 }), -- Посох Ниграэля-15урона / Посох проклятой метки-15урона | Посох скальда+15ини

				--талик
				{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3
--				orr({ id = 'g001ig0184', min = 1, max = 1 }, { id = 'g000ig9109', min = 1, max = 1 }), -- Талисман Восстановления 400 / Талисман призыва нейтралов II 450
--				orr(orr({ id = 'g000ig9128', min = 1, max = 1}, { id = 'g001ig0259', min = 1, max = 1}), orr({ id = 'g001ig0063', min = 1, max = 1}, { id = 'g000ig9116', min = 1, max = 1})), -- Талисман Молнии 800 / Талисман призыва нейтралов III 600 / Талисман Прилива 800 / Талисман Святой земли 800

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				-- { id = rnd('g001ig0164','g001ig0253','g001ig0255','g001ig0256','g000ig5050','g001ig0254','g000ig5020','g000ig5069'), min = 1, max = 1 }, -- Свиток "Infernus"-крит, прокл.эмира-урон, спеш.время+ини.урон, могущество+урон, "Chronos"-ини, "Terebrare corde"+точ.урон, "Приказ Сира Аллемона"+точ.урон.ини, "Проклятие Ниграэля"-урон
				orr({ id = 'g000ig5084', min = 1, max = 1 }, { id = 'g000ig5119', min = 1, max = 1 }), -- Свиток "Дар" (жезлы) / Свиток "Водосточный Колодец"
				
			}
		},
		guard = gmm({}, guard2()),
	},
	
		{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },
				
				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард

				{ id = 'g001ig0125', min = 1, max = 1 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 2 }, -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0005', min = 1, max = 1 }, --Зелье наблюдательности
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости x 2
				
				-- эликсир мощи / Аура меткости / Эликсир самопожертвования -телохр.25				
				{ id = rnd('g000ig0016','g001ig0022','g001ig0561'), min = 1, max = 1 }, 
				-- случ. пермо-вард-дот
				{ id = pw4d(), min = 1, max = 1 }, --15

--				orr({ id = 'g001ig0529', min = 1, max = 1 }, { id = 'g001ig0531', min = 1, max = 1 }), -- Каталог магических сфер / Зелье слова (свитки)
--				orr({ id = 'g001ig0524', min = 1, max = 1 }, { id = 'g001ig0561', min = 1, max = 1 }), -- Зелье завоевателя (жезлы) / Эликсир самопожертвования -телохр.25

				--арты
				{ id = artResp2[1], min = 1, max = 1 },
				{ id = artResp2[2], min = 1, max = 1 }, 

				--релики
				{ id = relResp2[1], min = 1, max = 1 },
				{ id = relResp2[2], min = 1, max = 1 }, 

				--знамёна
				{ id = flagResp2[1], min = 1, max = 1 },
				{ id = flagResp2[2], min = 1, max = 1 }, 

				--доп. арт/релик/знамя
				{ id = rnd(artResp2[3],relResp2[3],flagResp2[3]), min = 1, max = 1 },

				--сферы
				{ id = orbResp2[1], min = 1, max = 1 }, 
				{ id = orbResp2[2], min = 1, max = 1 },
				{ id = orbResp2[3], min = 1, max = 1 },
				{ id = orbResp2[4], min = 1, max = 1 },
				
				--сапоги
				{ id = rnd('g000ig1010','g001ig0018'), min = 1, max = 1 }, -- Эльфийские сапоги / Великая аура тролля (+20реген)

				--посох
				orr({ id = 'g001ig0392', min = 1, max = 1 }, orr({ id = 'g000ig6019', min = 1, max = 1 }, { id = 'g001ig0403', min = 1, max = 1 })), -- Посох знаний Фрегги+40хил | Посох Листвы+лес / Посох неизбежной кары +10 урона и точности

				--талик
				{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3
--				orr({ id = 'g000ig9109', min = 1, max = 1 }, { id = 'g000ig9120', min = 1, max = 1 }), -- Талисман призыва нейтралов II 450 / Талисман щита стихий 500
--				orr(orr({ id = 'g000ig9128', min = 1, max = 1}, { id = 'g001ig0259', min = 1, max = 1}), orr({ id = 'g001ig0063', min = 1, max = 1}, { id = 'g000ig9116', min = 1, max = 1})), -- Талисман Молнии 800 / Талисман призыва нейтралов III 600 / Талисман Прилива 800 / Талисман Святой земли 800

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				-- { id = rnd('g001ig0164','g001ig0253','g001ig0255','g001ig0256','g000ig5050','g001ig0254','g000ig5020','g000ig5069'), min = 1, max = 1 }, -- Свиток "Infernus"-крит, прокл.эмира-урон, спеш.время+ини.урон, могущество+урон, "Chronos"-ини, "Terebrare corde"+точ.урон, "Приказ Сира Аллемона"+точ.урон.ини, "Проклятие Ниграэля"-урон
				orr({ id = 'g001ig0194', min = 1, max = 1 }, { id = 'g000ig5119', min = 1, max = 1 }), -- Свиток "Лисья хитрость" / Свиток "Водосточный Колодец"

			}
		},
		guard = gmm({}, guard2()),
	},

}
end

-- Лавка т3
function zoneMerchZone34() -- свиток т3

--арты 1000-1450x14,2400: арт-контроль01, рун.клин1200, рог.всев1200, клин.возв1200, Клинок Танатоса, Кольцо небесной воли, Корни триббога, Руна кары Тьяцци, Щит Мизраэля, Тысяча чешуек, Чаша жатвы, Топор палача, Серп Кровавого Ворона, Монолитный щит1200, Божественный потир1200, Щит рыцаря Феникса
local artZone34 = {artctrl01(),'g000ig3004','g000ig2004','g001ig0124','g000ig3019','g001ig0612','g001ig0413','g001ig0415','g001ig0590','g001ig0060','g001ig0603','g001ig0657','g002ig0013','g001ig0592','g001ig0174','g002ig0011'}

--релики 800x7,1500: таира800, шкатулка800, лютня650, Кираса резонанса, Тисовый лук, Длани ангела, Доспех жатвы, Кираса Кровавого Ворона
local relZone34 = {'g000ig2006','g001ig0156','g000ig3022','g001ig0597','g001ig0539','g001ig0424','g001ig0602','g002ig0015'}

--знамёна 700-1300x11: неуязв700, скорости925, болот, ветра перемен, отваги, стального листопада, Кошмаров, наследия, Стяг чумных воинств, Стяг упырей, Знамя неизбежности
local flagZone34 = {'g000ig1002','g000ig1006','g001ig0362','g001ig0364','g001ig0363','g001ig0374','g001ig0365','g001ig0375','g001ig0367','g001ig0360','g001ig0359'}

--сферы 600-700x9,800x2: сфера-контроль01, Энергии +25аоеурон 1000, Брони II 25 600, Вампиризма III 60 700, Великого исцеления 80 700, Массового ослабления II 50 700, Морской пучины 110урон 700, Горы урон110 800, Спасения 100хил 2колонны 700, Угнетения 110 урон 700, Урона III +урон60 700
local orbZone34 = {orbctrl01(),'g000ig9020','g001ig0443','g000ig9021','g000ig9016','g001ig0203','g001ig0466','g001ig0480','g001ig0455','g001ig0489','g001ig0131'}

mix(artZone34)
mix(relZone34)
mix(flagZone34)
mix(orbZone34)

return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 550, max = 550 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7 }, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g000ig0018', min = 1, max = 2 },

				{ id = b30(), min = 1, max = 1 }, --сл.банка30
				{ id = b30(), min = 1, max = 1 }, --сл.банка30
				
				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				
				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард воздух
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард вода
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард земля
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард огонь
				{ id = w15(), min = 1, max = 1 }, -- сл.вард
				{ id = w15(), min = 1, max = 1 }, -- сл.вард
								
				{ id = 'g001ig0128', min = 1, max = 1 }, -- вард оружия
				{ id = 'g001ig0125', min = 1, max = 2 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 2 }, -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости 
				orr({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности
				orr({ id = 'g001ig0127', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }), -- Эликсир жизненной силы / целебная мазь

				-- Война престолов (-10 воры) 600 / Зелье удачи (10 крит) / Зелье загробных тайн (п.вард оружие) / Зелье рвения
				{ id = rnd('g001ig0519','g001ig0548','g001ig0324','g001ig0083'), min = 1, max = 1 },
				-- случ. пермо-вард
				{ id = pw6(), min = 1, max = 1 }, --15
				
--				{ id = rnd('g001ig0563','g001ig0021','g001ig0316'), min = 1, max = 1 }, -- Аура внимательности (крит) / Аура слепой ярости (+10 урона аое) / Сок Великого древа (+15% оз)
--				orr({ id = 'g001ig0526', min = 1, max = 1 }, { id = 'g001ig0527', min = 1, max = 1 }), -- Зелье оруженосца (знамёна) / Зелье постижения (реликвии)

				--арты
				{ id = artZone34[1], min = 1, max = 1 },
				{ id = artZone34[2], min = 1, max = 1 }, 
				{ id = artZone34[3], min = 1, max = 1 }, 

				--релики
				{ id = relZone34[1], min = 1, max = 1 },
				{ id = relZone34[2], min = 1, max = 1 }, 

				--знамёна
				{ id = flagZone34[1], min = 1, max = 1 },
				{ id = flagZone34[2], min = 1, max = 1 }, 

				--доп. релик/знамя
				{ id = rnd(relZone34[3],flagZone34[3]), min = 1, max = 1 },

				--сферы
				{ id = orbZone34[1], min = 1, max = 1 }, 
				{ id = orbZone34[2], min = 1, max = 1 },
				{ id = orbZone34[3], min = 1, max = 1 },
				-- +сфера защиты от стихии				
				orr(orr({ id = 'g001ig0056', min = 1, max = 1 }, { id = 'g001ig0054', min = 1, max = 1 }), orr({ id = 'g001ig0055', min = 1, max = 1 }, { id = 'g001ig0053', min = 1, max = 1 })), -- сфера защиты воды / воздуха / земли / огня

				--сапоги
				orr({ id = 'g001ig0501', min = 1, max = 1 }, { id = 'g001ig0606', min = 1, max = 1 }), -- Дары Галлеана (лес) 750 | Сапоги родных земель 1000

				--посох
				orr(orr({ id = 'g000ig6020', min = 1, max = 1 }, { id = 'g001ig0380', min = 1, max = 1 }), orr({ id = 'g000ig6021', min = 1, max = 1 }, { id = 'g001ig0391', min = 1, max = 1 })), -- Посох Возни-15точ-10урона / Посох врат Бездны-белик / Посох Зов Леса-энт2 / Посох оракула+60хил

				--талик
				{ id = rndy(ttal4), min = 1, max = 1}, -- талик т4
--				orr(orr({ id = 'g000ig9128', min = 1, max = 1}, { id = 'g001ig0259', min = 1, max = 1}), orr({ id = 'g001ig0063', min = 1, max = 1}, { id = 'g000ig9116', min = 1, max = 1})), -- Талисман Молнии 800 / Талисман призыва нейтралов III 600 / Талисман Прилива 800 / Талисман Святой земли 800
--				{ id = rnd('g000ig9130','g000ig9123','g001ig0202'), min = 1, max = 1}, -- Талисман Бури / Талисман Пожара / Талисман призыва нейтралов IV

				--свитки
				orr({ id = 'g000ig5110', min = 1, max = 1 }, { id = 'g000ig5040', min = 1, max = 1 }), -- Излечение +60 аое / Песнь Вотана +100
				-- orr(orr({ id = 'g000ig5073', min = 1, max = 1 },{ id = 'g000ig5012', min = 1, max = 1 }), orr({ id = 'g000ig5013', min = 1, max = 1 },{ id = 'g000ig5026', min = 1, max = 1 })), -- Свиток "Прикосновение Мортис" / Свиток "Благословение Всевышнего"  | Свиток "Святая сила" / Свиток "Гимн кланов"		
				orr({ id = 'g000ig5119', min = 1, max = 1 }, { id = 'g001ig0492', min = 1, max = 1 }), -- Свиток "Водосточный колодец" / Свиток "Проведение Всевышнего" (сферы) 
			}
		},
		guard = gmm({}, guard3()),
	},
	
}
end

-- Лавка т4
function zoneMerchZone5() -- свитки т2+т3

--арты 12: арт-контроль02, Грань реальности, Кинжал жатвы, Кольцо создателя, Кровь Владыки, Дьявольская булава, Коготь Пожирателя, Гравированная диадема, Слеза Мортис, Копье Ангела, Кольцо Несгибаемого стража, Коготь Пожирателя, Кама Кровавого Ворона, Меч рыцаря Феникса
local artZone5 = {artctrl02(),'g001ig0411','g001ig0604','g001ig0585','g001ig0046','g001ig0410','g001ig0102','g000ig2005','g000ig9035','g002ig0017','g001ig0488','g001ig0102','g002ig0014','g002ig0010'}

--релики 6: Шлем воителя, плас.досп, кор.имп, тяж.латы, кор.мьолн, Доспех рыцаря Феникса
local relZone5 = {'g001ig0419','g001ig0116','g000ig7010','g001ig0038','g000ig3005','g002ig0012'}

--знамёна 9: магии Воды 700, Воздуха, Земли, Огня, Разума, Смерти, Стяг Кровавого Ворона 2250, Стяг багровых рек 1700, Знамя магического иммунитета 1600, Знамя падшего хранителя 1100
local flagZone5 = {'g001ig0142','g001ig0140','g001ig0141','g001ig0139','g001ig0145','g001ig0143','g002ig0016','g001ig0366','g001ig0373','g001ig0500'}

--сферы 700-1000x14: сфера-контроль02 orbctrl02() исключены, Алчности 60 вамп аое 900, Массового замедления 50 1000, Брони III 35 800, Испепеления 110урон 700, Грозы 110урон 700,Обширной коррозии II -20брони аое 700, Древнего вамп100 800, защиты от Оружия 800, Землетрясения 75 колонны 900, Терзаний 85 ряд 900, Урагана 99 2x2 900, цунами 90 неприкр 900, направленного ослабления II 50 700
local orbZone5 = {'g000ig9025','g000ig9014','g001ig0136','g001ig0457','g000ig9028','g001ig0183','g001ig0303','g001ig0059','g001ig0459','g001ig0477','g000ig9027','g000ig9032','g001ig0462'}

mix(artZone5)
mix(relZone5)
mix(flagZone5)
mix(orbZone5)

return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 550, max = 550 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 2, max = 3 }, --хил75
				{ id = 'g000ig0018', min = 1, max = 2 },

				{ id = 'g000ig0015', min = 1, max = 1 }, --урон30
				{ id = 'g000ig0012', min = 1, max = 1 }, --ини30
				{ id = b30(), min = 1, max = 1 }, --сл.банка30
				
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = b15(), min = 1, max = 1 }, --15
				
				{ id = rnd('g000ig0021','g000ig0024'), min = 1, max = 1 }, -- вард воздух / огонь
				{ id = rnd('g000ig0022','g000ig0023'), min = 1, max = 1 }, -- вард вода / земля
				{ id = w15(), min = 1, max = 1 }, -- сл.вард

				{ id = rnd('g001ig0128','g001ig0125','g001ig0036'), min = 1, max = 1 }, -- вард оружия / вард разума / вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости 
				orr({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности
				
				-- Экстракт таинственной энергии-смена-атак / Эликсир гонителя нечисти-вамп-там / Зелье вознесения-вард-урон / Эликсир предвиденья =15точн-1 / Зелье разоблачения (-20 воры)
				{ id = rnd('g001ig0534','g001ig0352','g001ig0356','g001ig0312','g001ig0521'), min = 1, max = 1 }, 
				-- пермо вард
				{ id = rnd(pw4d(),pw4e(),pw6()), min = 1, max = 1 },
				
				--арты
				{ id = artZone5[1], min = 1, max = 1 },
				{ id = artZone5[2], min = 1, max = 1 }, 

				--релики
				{ id = relZone5[1], min = 1, max = 1 },
				{ id = relZone5[2], min = 1, max = 1 }, 

				--знамёна
				{ id = flagZone5[1], min = 1, max = 1 },
				{ id = flagZone5[2], min = 1, max = 1 }, 

				--доп. арт/релик/знамя
				{ id = rnd(artZone5[3],relZone5[3],flagZone5[3]), min = 1, max = 1 },

				--сферы
				{ id = orbZone5[1], min = 1, max = 1 }, 
				{ id = orbZone5[2], min = 1, max = 1 },
				{ id = orbZone5[3], min = 1, max = 1 },
				{ id = orbZone5[4], min = 1, max = 1 },
		
				--сапоги
				orr({ id = 'g001ig0115', min = 1, max = 1 }, { id = 'g001ig0112', min = 1, max = 1 }), -- -- сапоги поступ1100 / сапоги ангел800

				--посох
				orr({ id = 'g001ig0097', min = 1, max = 1 }, { id = 'g000ig6019', min = 1, max = 1 }), -- Посох озер / Посох Листвы 

				--талик
				{ id = rndy(ttal5), min = 1, max = 1}, -- талик т5
--				{ id = rnd('g000ig9130','g000ig9123','g001ig0202'), min = 1, max = 1}, -- Талисман Бури / Талисман Пожара / Талисман призыва нейтралов IV
--				{ id = rnd('g000ig9136','g001ig0185','g000ig9103'), min = 1, max = 1}, -- Талисман Горы / Талисман Землетрясения / Талисман призыва нейтралов V
				
				--свитки
				--т4 свитки убрал 
				--orr(orr({ id = 'g000ig5091', min = 1, max = 1 }, { id = 'g000ig5055', min = 1, max = 1 }), orr({ id = 'g000ig5076', min = 1, max = 1 }, { id = 'g000ig5114', min = 1, max = 1 })), -- Tempus status (-33 ини) / Tortio menta (-33 точность) | Гниение (-33 дамаг) / Плесень (-30 броня)
				
				-- Свиток "Merum Facies" -окамен.полиморф, "Слабость плоти" -оружие, "Слабость разума" -разум, "Пробирающий холод" -вода, 
				-- "Dominatum ignis" - огонь, "Небесный молот" -воздух, "Хворь" -земля, "Прах к праху" -смерть, Свиток "Забвение" -свитки/сферы/талики
				{ id = rnd('g000ig5057','g001ig0573','g001ig0574','g001ig0578','g001ig0577','g001ig0580','g001ig0579','g001ig0576','g001ig0165'), min = 1, max = 1 }, 
				orr({ id = 'g000ig5110', min = 1, max = 1 }, { id = 'g000ig5040', min = 1, max = 1 }), -- Излечение +60 аое / Песнь Вотана +100
		}
		},
		 guard = gmm({}, guard4()),
	},
	}
end

----------------------

-- Руины Респ 0

local valueRuinRespZ0 = { min = 165*kef, max = 175*kef }
--local goldRuinRespZ0 = { min = 200, max = 220 } 

function zoneRuinRespZ0()
return {
	{
		gold = { min = gmm(200,300), max = gmm(220,350)},
		loot = {
			items = {
				{id = ruin0(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),		
			value = valueRuinRespZ0
		}
	},
	{
		gold = { min = gmm(220,350), max = gmm(240,385)},
		loot = {
			items = {
				-- Арты300 Релики300: Рунный камень (Артефакт) / Цепи жертвенности (Артефакт) / Гномьи наручи (Артефакт) / Цеп Хана (Артефакт) / Обод мертвых (Реликвия) / Фолиант Мысли / Череп Хана (Реликвия)
				{id = rnd('g000ig2001','g001ig0611','g000ig3001','g001ig0100','g000ig3008','g000ig4008','g001ig0101'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
}
end

-- Руины зона 1
--local valueRuinRespZ = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
--local goldRuinRespZ = { min = 250, max = 275 } 

function zoneRuinRespZ()
return {
	{
		gold = { min = gmm(250,400), max = gmm(275,450)},
		loot = {
			items = {
				-- Арты400 Релики450: Загробный фонарь (Артефакт) / Руна защиты Фрейра (Артефакт) / Потайной кинжал (Артефакт) / Книга божественных даров / Книга колдовства / Книга наследия / Книга странника / Кожаные эльфийские доспехи (Реликвия) / Куртка капитана (Реликвия) 
				{id = rnd('g001ig0609','g001ig0418','g002ig0001','g001ig0493','g001ig0497','g001ig0495','g001ig0494','g001ig0428','g001ig0426'), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
		}
	},
	{
		gold = { min = gmm(250,400), max = gmm(275,450)},
		loot = {
--			itemTypes = { Item.Banner, Item.Talisman, Item.TravelItem }, --6(-1)+3+2
--			value = { min = 400, max = 500 },
--			itemValue = { min = 400, max = 500 }
			items = {
				-- Знамя быстроты / Знамя выносливости / Знамя защиты / Знамя силы / Знамя сражения / Сапоги ассасина / Тяжелые сапоги / Знамя мастера 'g001ig0587' исключил-баг
				{id = rnd('g000ig1005','g001ig0051','g000ig1001','g000ig1007','g000ig1003','g001ig0111','g001ig0114'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(230,260)*kef, max = gmm(240,274)*kef }
		}
	},
}
end


-- Руины зона 2
--local valueRuinResp = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
--local goldRuinResp = { min = 300, max = 330 } 

function zoneRuinResp()
return {
	{
		gold = { min = gmm(300,500), max = gmm(330,550)},
		loot = {
--			itemTypes = { Item.Jewel, Item.Weapon }, --6+3
--			value = { min = 550, max = 700 },
--			itemValue = { min = 550, max = 700 },
			items = {
				-- Кровавый покров (Реликвия) / Латы Спасителя (Реликвия) / Лютня Очарования (Реликвия) / Нагрудник Стража (Реликвия) / Промасленная кольчуга (Реликвия) / Дьявольская чаша (Артефакт) / Кинжал Вампиризма (Артефакт) / Кольцо темных искуств (Артефакт) / Оковы долга (Реликвия)
				{id = rnd('g001ig0422','g001ig0423','g000ig3022','g001ig0427','g002ig0002','g000ig3002','g000ig3017','g001ig0487','g001ig0610'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
		}
	},

	{
		gold = { min = gmm(300,500), max = gmm(330,550)},
		loot = {
--			itemTypes = { Item.Armor, Item.TravelItem }, --5+2
--			value = { min = 550, max = 700 },
--			itemValue = { min = 550, max = 700 },
			items = {
				-- Камень врат (Артефакт) / Рог возмездия (Артефакт) / Рог непреклонности (Артефакт) / Руна благоволения Тиу (Артефакт) / Щит телохранителя (Артефакт) / Сапоги скорости / Эльфийские сапоги
				{id = rnd('g001ig0582','g001ig0558','g001ig0557','g001ig0559','g001ig0594','g000ig8003','g000ig1010'), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(400,450)*kef, max = gmm(420,473)*kef }
		}
	}	
}
end

-- Руины зона 3
--local valueRuinZone = { min = 800*kef, max = 840*kef }
--local goldRuinZone = { min = 350, max = 385 }

function zoneRuinZone34()
return {
	{
		gold = { min = gmm(350,550), max = gmm(385,600)},
		loot = {
--				itemTypes = { Item.Jewel, Item.Weapon, Item.Armor }, --8+3+8
--				value = { min = 850, max = 1090 },
--				itemValue = { min = 850, max = 1090 }
			items = {
				-- Длани ангела (Реликвия) / Кафтан первооткрывателя (Реликвия) / Роба убийцы (Реликвия) / Тисовый лук (Реликвия) / Шкатулка предсказаний (Реликвия) / Шлем воителя (Реликвия) /
				-- / Проклятый пепел (Артефакт) / Топор палача (Артефакт) / Клинок Возвышенного (Артефакт) / Кольцо небесной воли (Артефакт) / Перстень песков (Артефакт) / 
				-- Чаша жатвы (Артефакт) / Череп шамана (Артефакт) / Щит отражения (Артефакт) / Эльфийская брошь (Артефакт)
				{id = rnd('g001ig0424','g001ig0425','g001ig0430','g001ig0539','g001ig0156','g001ig0419','g001ig0197','g001ig0657','g001ig0124','g001ig0612','g001ig0040','g001ig0603','g001ig0041','g001ig0591','g001ig0071'), min = 1, max = 1},
			},
		
		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(800,900)*kef, max = gmm(840,945)*kef }
		}
	},
	{
		gold = { min = gmm(385,600), max = gmm(420,660)},
		loot = {
--				itemTypes = { Item.Banner }, --22
--				value = { min = 600, max = 750 },
--				itemValue = { min = 600, max = 750 }
			items = {
				-- Знамя 600-850: Баннер неудержимых / Знамя битвы / Знамя горна / Знамя городских стражей / Знамя искоренителя ереси / 
				-- Знамя магии Воды / Знамя магии Воздуха / Знамя магии Земли / Знамя магии Огня / Знамя магии Разума / Знамя магии Смерти 
				-- / Знамя неистовства / Знамя неуязвимости / Знамя отваги / Знамя скорости / Знамя снежной охоты / Знамя энергии / Ловец Кошмаров 
				-- / Стяг концентрации / Стяг чумных воинств / Знамя тысячи битв 'g001ig0588' исключил-баг
				{id = rnd('g001ig0293','g000ig1004','g001ig0361','g001ig0289','g001ig0370','g001ig0142','g001ig0140','g001ig0141','g001ig0139','g001ig0145','g001ig0143','g001ig0357','g000ig1002','g001ig0363','g000ig1006','g001ig0369','g000ig1008','g001ig0365','g001ig0292','g001ig0367'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(800,900)*kef, max = gmm(840,945)*kef }
		}
	},
	
}
end

-- Руины зона 4
local valueRuinZone5 = { min = 1600*kef, max = 1700*kef }

function zoneRuinZone5()
return {
	{
		gold = { min = gmm(420,650), max = gmm(460,710)},
		loot = {
--				itemTypes = { Item.Weapon, Item.Talisman }, 
--				value = { min = 1150, max = 1500 },
--				itemValue = { min = 1150, max = 1500 }
			items = {
				-- Божественный потир (Артефакт) / Грань реальности (Артефакт) / Дьявольская булава (Артефакт) / Клинок Танатоса (Артефакт) / Корни триббога (Артефакт) / Руна кары Тьяцци (Артефакт) / Рунический клинок (Артефакт) / Серп Кровавого Ворона (Артефакт) / Слеза Мортис (Артефакт)
				{id = rnd('g001ig0174','g001ig0411','g001ig0410','g000ig3019','g001ig0413','g001ig0415','g000ig3004','g002ig0013','g000ig9035'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	{
		gold = { min = gmm(420,650), max = gmm(460,710)},
		loot = {
--				itemTypes = { Item.Armor, Item.Jewel }, 
--				value = { min = 1150, max = 1500 },
--				itemValue = { min = 1150, max = 1500 }
			items = {
				-- Кинжал жатвы (Артефакт) / Кольцо создателя (Артефакт) / Кровь Владыки (Артефакт) / Монолитный щит (Артефакт) / Рог всеведенья (Артефакт) / Тысяча чешуек (Артефакт) / Щит Мизраэля (Артефакт) / Кираса Кровавого Ворона (Реликвия) / Корона Мьольнира (Реликвия) / Пластинчатый доспех (Реликвия) 
				{id = rnd('g001ig0604','g001ig0585','g001ig0046','g001ig0592','g000ig2004','g001ig0060','g001ig0590','g002ig0015','g000ig3005','g001ig0116'), min = 1, max = 1},
			},
		
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},		
	{
		gold = { min = gmm(420,650), max = gmm(460,710)},
		loot = {
			items = {
				orr(orr({ id = 'g001ig0312', min = 1, max = 1}, { id = 'g001ig0310', min = 1, max = 1}), orr({ id = 'g001ig0314', min = 1, max = 1}, { id = 'g001ig0356', min = 1, max = 1})), -- Эликсир предвиденья 15точность, Эликсир опережения 15ини, Эликсир наследия 15урон, Зелье вознесения вард-урон
			},
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},	
}
end

-- Руины зоны тренера
local valueRuinZoneTrainers = { min = 1900*kef, max = 2000*kef }
local valueRuinZoneTrainers2 = { min = 1200*kef, max = 1300*kef }

function zoneRuinTrainers()
return {
	{
		gold = { min = gmm(500,800), max = gmm(550,850)},
		loot = {
			items = {
				{id = ruinTrainers(), min = 1, max = 1},
			},
		},
		guard = {
			--subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers
		}
	},
}
end

function zoneRuinTrainersCross()
return {

	{
		gold = { min = gmm(500,800), max = gmm(550,850)},
		loot = {
			items = {
				{id = ruinTrainers(), min = 1, max = 1},
			},
		},
		guard = {
			--subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers
		}
	},
	{
		gold = { min = gmm(400,620), max = gmm(440,680)},
		loot = {
			items = {
				{id = ruinTrainers2(), min = 1, max = 1},
			},
		},
		guard = {
			--subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers2
		}
	},	
}
end

-----------------------
-- Обменник т2
function rMarketsZone2()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 3
				local k2 = 1
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.Gold, k1, k2 }
					}
				},
			}
		end
]],

			
    stock = {
		{resource = Resource.Gold, value = { min = 1000, max = 1000 }},
		{resource = Resource.LifeMana, value = { min = 300, max = 300 }},
		{resource = Resource.DeathMana, value = { min = 300, max = 300 }},
		{resource = Resource.InfernalMana, value = { min = 300, max = 300 }},
        {resource = Resource.RunicMana, value = { min = 300, max = 300 }},
        {resource = Resource.GroveMana, value = { min = 300, max = 300 }}
    },
		guard = gmm({}, guard2r()),
}
}
end

-- Обменник центр
function rMarketsZone5()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 3
				local k2 = 1
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.Gold, k1, k2 }
					}
				},
			}
		end
]],

			
    stock = {
		{resource = Resource.Gold, value = { min = 1500, max = 1500 }},
		{resource = Resource.LifeMana, value = { min = 500, max = 500 }},
		{resource = Resource.DeathMana, value = { min = 500, max = 500 }},
		{resource = Resource.InfernalMana, value = { min = 500, max = 500 }},
        {resource = Resource.RunicMana, value = { min = 500, max = 500 }},
        {resource = Resource.GroveMana, value = { min = 500, max = 500 }}
    },
		guard = gmm({}, guard4r()),
},
}
end



---------------------

-- Источники Респ - голда + родная
function getMinesRespZ(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.lifeMana = 1
	elseif race == Race.Dwarf then
		mines.runicMana = 1
	elseif race == Race.Undead then
		mines.deathMana = 1
	elseif race == Race.Heretic then
		mines.infernalMana = 1
	elseif race == Race.Elf then
		mines.groveMana = 1
	end
		
	return mines
end

-- Источники т1 - голда и ценная и менее ценная (инверс для т2 делаю в своде)
function getMinesRespZ2(race)

	if race == Race.Human then return
	{gold = 1, runicMana = tbla[1], groveMana = tbla[2], deathMana = tblb[1], infernalMana = tblb[2]}
	elseif race == Race.Dwarf then return
	{gold = 1, lifeMana = tbla[1], groveMana = tbla[2], deathMana = tblb[1], infernalMana = tblb[2]}
	elseif race == Race.Undead then return
	{gold = 1, infernalMana = tbla[1], groveMana = tbla[2], lifeMana = tblb[1], runicMana = tblb[2]}
	elseif race == Race.Heretic then return
	{gold = 1, deathMana = tbla[1], groveMana = tbla[2], lifeMana = tblb[1], runicMana = tblb[2]}
	elseif race == Race.Elf then return
	{gold = 1, lifeMana = tbla[1], infernalMana = tbla[2], deathMana = tblb[1], runicMana = tblb[2]}
	end
end

-- Источники т2 - голда и родная и ценная и менее ценная (инверс для т1 делаю в своде)
function getMinesResp(race)
	if race == Race.Human then return
	{gold = 1, lifeMana = 1, runicMana = tbla[2], groveMana = tbla[1], deathMana = tblb[2], infernalMana = tblb[1]}
	elseif race == Race.Dwarf then return
	{gold = 1, runicMana = 1, lifeMana = tbla[2], groveMana = tbla[1], deathMana = tblb[2], infernalMana = tblb[1]}
	elseif race == Race.Undead then return
	{gold = 1, deathMana = 1, infernalMana = tbla[2], groveMana = tbla[1], lifeMana = tblb[2], runicMana = tblb[1]}
	elseif race == Race.Heretic then return
	{gold = 1, infernalMana = 1, deathMana = tbla[2], groveMana = tbla[1], lifeMana = tblb[2], runicMana = tblb[1]}
	elseif race == Race.Elf then return
	{gold = 1, groveMana = 1, lifeMana = tbla[2], infernalMana = tbla[1], deathMana = tblb[2], runicMana = tblb[1]}
	end
end

-- Источники т3 - инывес источников тренера плюс голда (инверс делаю в своде)
function getMinesZone34(race, race2)

		if race == Race.Human and race2 == Race.Dwarf then return {gold = 1, lifeMana = 1, runicMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Undead then return {gold = 1, lifeMana = 1, deathMana = tbl[1], runicMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Heretic then return {gold = 1, lifeMana = 1, infernalMana = tbl[1], deathMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Elf then return {gold = 1, lifeMana = 1, groveMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Undead then return {gold = 1, runicMana = 1, deathMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Heretic then return {gold = 1, runicMana = 1, infernalMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Elf then return {gold = 1, runicMana = 1, groveMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], lifeMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Heretic then return {gold = 1, deathMana = 1, infernalMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Elf then return {gold = 1, deathMana = 1, groveMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Elf then return {gold = 1, infernalMana = 1, groveMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], runicMana = tbl[4]}
--
	elseif race == Race.Dwarf and race2 == Race.Human then return {gold = 1, runicMana = 1, lifeMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Human then return {gold = 1, deathMana = 1, lifeMana = tbl[1], runicMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Human then return {gold = 1, infernalMana = 1, lifeMana = tbl[1], deathMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Human then return {gold = 1, groveMana = 1, lifeMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Dwarf then return {gold = 1, deathMana = 1, runicMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Dwarf then return {gold = 1, infernalMana = 1, runicMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Dwarf then return {gold = 1, groveMana = 1, runicMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], lifeMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Undead then return {gold = 1, infernalMana = 1, deathMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Undead then return {gold = 1, groveMana = 1, deathMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Heretic then return {gold = 1, groveMana = 1, infernalMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], runicMana = tbl[4]}
	end	

end

-- Источники т4 - голда + два родные рас + рандомный
function getMinesZone5(race, race2)
	local tblmid = {1,0,0}
	-- перемешать таблицу
		for i = #tblmid, 2, -1 do
		local j = math.random(i)
		tblmid[i], tblmid[j] = tblmid[j], tblmid[i]
		end
	if race == Race.Human and race2 == Race.Dwarf or race == Race.Dwarf and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, runicMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Human and race2 == Race.Undead or race == Race.Undead and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, deathMana = 1, runicMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Human and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, infernalMana = 1, deathMana = tblmid[1], runicMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Human and race2 == Race.Elf or race == Race.Elf and race2 == Race.Human then return 
	{gold = 1, lifeMana = 1, groveMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], runicMana = tblmid[3]}

	elseif race == Race.Dwarf and race2 == Race.Undead or race == Race.Undead and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, deathMana = 1, lifeMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Dwarf and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, infernalMana = 1, deathMana = tblmid[1], lifeMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Dwarf and race2 == Race.Elf or race == Race.Elf and race2 == Race.Dwarf then return 
	{gold = 1, runicMana = 1, groveMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], lifeMana = tblmid[3]}

	elseif race == Race.Undead and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Undead then return 
	{gold = 1, deathMana = 1, infernalMana = 1, lifeMana = tblmid[1], runicMana = tblmid[2], groveMana = tblmid[3]}

	elseif race == Race.Undead and race2 == Race.Elf or race == Race.Elf and race2 == Race.Undead then return 
	{gold = 1, deathMana = 1, groveMana = 1, lifeMana = tblmid[1], infernalMana = tblmid[2], runicMana = tblmid[3]}

	elseif race == Race.Heretic and race2 == Race.Elf or race == Race.Elf and race2 == Race.Heretic then return 
	{gold = 1, infernalMana = 1, groveMana = 1, deathMana = tblmid[1], lifeMana = tblmid[2], runicMana = tblmid[3]}

	end	
end
 
-- Источники зона-тренер инывес источников т3 минус голда (инверс делаю в своде)
function getMinesX(race, race2)

		if race == Race.Human and race2 == Race.Dwarf then return {lifeMana = 1, runicMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Undead then return {lifeMana = 1, deathMana = tbl[1], runicMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Heretic then return {lifeMana = 1, infernalMana = tbl[1], deathMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Human and race2 == Race.Elf then return {lifeMana = 1, groveMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Undead then return {runicMana = 1, deathMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Heretic then return {runicMana = 1, infernalMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Dwarf and race2 == Race.Elf then return {runicMana = 1, groveMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], lifeMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Heretic then return {deathMana = 1, infernalMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Elf then return {deathMana = 1, groveMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Elf then return {infernalMana = 1, groveMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], runicMana = tbl[4]}
--
	elseif race == Race.Dwarf and race2 == Race.Human then return {runicMana = 1, lifeMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Human then return {deathMana = 1, lifeMana = tbl[1], runicMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Human then return {infernalMana = 1, lifeMana = tbl[1], deathMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Human then return {groveMana = 1, lifeMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Undead and race2 == Race.Dwarf then return {deathMana = 1, runicMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Dwarf then return {infernalMana = 1, runicMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Dwarf then return {groveMana = 1, runicMana = tbl[1], deathMana = tbl[2], infernalMana = tbl[3], lifeMana = tbl[4]}
	elseif race == Race.Heretic and race2 == Race.Undead then return {infernalMana = 1, deathMana = tbl[1], lifeMana = tbl[2], runicMana = tbl[3], groveMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Undead then return {groveMana = 1, deathMana = tbl[1], lifeMana = tbl[2], infernalMana = tbl[3], runicMana = tbl[4]}
	elseif race == Race.Elf and race2 == Race.Heretic then return {groveMana = 1, infernalMana = tbl[1], deathMana = tbl[2], lifeMana = tbl[3], runicMana = tbl[4]}
	end	

end

----------------
--	наёмники начало

-- нейтралы Мили2
function MercM2()
	local radn = math.random(0,11)
	if radn == 0 then
	return 'g003uu5030' -- Агент 220
	elseif radn == 1 then
	return 'g000uu5031' -- Головорез 300
	elseif radn == 2 then
	return 'g001uu7545' -- Сегаш
	elseif radn == 3 then
	return 'g000uu5028' -- Тритон
	elseif radn == 4 then
	return 'g000uu5033' -- Упырь 220
	elseif radn == 5 then
	return 'g000uu7611' -- Страж домн 235
	elseif radn == 6 then
	return 'g000uu5003' -- Копейщик 220
	elseif radn == 7 then
	return 'g000uu5011' -- Кентавр-фалангист 490
	elseif radn == 8 then
	return 'g000uu5005' -- Лесной эльф 220
	elseif radn == 9 then
	return 'g000uu5040' -- Варвар 590
	elseif radn == 10 then
	return 'g000uu5039' -- Волк 220
	elseif radn == 11 then
	return 'g001uu8279' -- Чумной волк 235

	end
end

-- нейтралы Лучники2
function MercA2()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu5007' -- Кентавр 240
	elseif radn == 1 then
	return 'g000uu6103' -- Элементаль Воздуха
	elseif radn == 2 then
	return 'g000uu8171' -- Сущность бури 525
	elseif radn == 3 then
	return 'g000uu8170' -- Сущность пламени
	end
end

-- нейтралы Маги2
function MercMg2()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001uu7553' -- Ведунья 260
	elseif radn == 1 then
	return 'g000uu8201' -- Скальд 175
	elseif radn == 2 then
	return 'g000uu8190' -- Сущность искажения 260
	elseif radn == 3 then
	return 'g000uu8169' -- Каменная сущность 525
	elseif radn == 4 then
	return 'g000uu8168' -- Ледяная сущность 525
	elseif radn == 5 then
	return 'g000uu8246' -- Чародей 400
	elseif radn == 6 then
	return 'g000uu8157' -- Гоблин-громыхун 400
	end
end

-- нейтралы Поддержка2
function MercH2()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu2006' -- Наяда
	elseif radn == 1 then
	return 'g000uu6113' -- Оккультист 260
	elseif radn == 2 then
	return 'g001uu7614' -- Искатель рун
	end
end

---
-- нейтралы Мили3
function MercM3()
	local radn = math.random(0,9)
	if radn == 0 then
	return 'g000uu6121' -- Дхампир 1070
	elseif radn == 1 then
	return 'g000uu7608' -- Каменщик 
	elseif radn == 2 then
	return 'g000uu8306' -- Экзекутор 525
	elseif radn == 3 then
	return 'g000uu7588' -- Отлученный 725
	elseif radn == 4 then
	return 'g000uu8247' -- Разоритель 725
	elseif radn == 5 then
	return 'g000uu8041' -- Темный Эльф Мясник
	elseif radn == 6 then
	return 'g000uu8151' -- Фурия
	elseif radn == 7 then
	return 'g003uu5031' -- Гонитель Ереси 755
	elseif radn == 8 then
	return 'g000uu8276' -- Последователь 725
	elseif radn == 9 then
	return 'g000uu7607' -- Черный ядозуб 825
	end
end

-- нейтралы Лучники3
function MercA3()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001uu7612' -- Королевский арбалетчик 490
	elseif radn == 1 then
	return 'g000uu8274' -- Медуза-охотница 700
	elseif radn == 2 then
	return 'g000uu8042' -- Темный Эльф Потрошитель 625
	elseif radn == 3 then
	return 'g001uu7617' -- Тень культа 1070
	elseif radn == 4 then
	return 'g000uu8045' -- Траппер 1070
	elseif radn == 5 then
	return 'g001uu8282' -- Тенистый паук
	elseif radn == 6 then
	return 'g000uu7590' -- Ящер-охотник 590
	end
end

-- нейтралы Маги3
function MercMg3()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8046' -- Шаманка 990
	elseif radn == 1 then
	return 'g000uu8048' -- Старейшина Гоблинов 570
	elseif radn == 2 then
	return 'g000uu8043' -- Жрица Безмясой 900
	end
end

-- нейтралы Поддержка3
function MercH3()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu8213' -- Гоблин-шаман
	elseif radn == 1 then
	return 'g000uu7619' -- Слуга культа
	end
end

---
-- нейтралы Мили4
function MercM4()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001uu7560' -- Каратель 1230
	elseif radn == 1 then
	return 'g000uu6106' -- Принцесса гномов 1200
	elseif radn == 2 then
	return 'g000uu5032' -- Вождь варваров 1400
	elseif radn == 3 then
	return 'g001uu7613' -- Огнеборец 1700
	elseif radn == 4 then
	return 'g003uu0023' -- Предатель
	elseif radn == 5 then
	return 'g000uu6108' -- Барон 1940
	end
end

-- нейтралы Лучники4
function MercA4()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu8174' -- Вестник распада
	elseif radn == 1 then
	return 'g000uu7566' -- Первородная сущность 1800
	elseif radn == 2 then
	return 'g000uu7567' -- Первородная сущность
	elseif radn == 3 then
	return 'g000uu8237' -- Первородная сущность
	end
end

-- нейтралы Маги4
function MercMg4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8005' -- Дух волка 990
	elseif radn == 1 then
	return 'g000uu8275' -- Медуза
	elseif radn == 2 then
	return 'g001uu7624' -- Неприкаянная 1900
	end
end

-- нейтралы Поддержка4
function MercH4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8035' -- Вильсида 1620
	elseif radn == 1 then
	return 'g000uu8218' -- Волхв 1750
	elseif radn == 2 then
	return 'g000uu7544' -- Настоятельница
	end
end

-- нейтралы Рандомные5
function MercR5()
	return rnd(
	-- мили
	'g001uu7600', -- Длань инквизиции 3400
	'g000uu8153', -- Жнец 4100
	'g000uu6117', -- Костяной лорд 3250
	'g000uu8244', -- Отступник 3250
	'g000uu5014', -- Хан орков 3000
	'g000uu8231', -- Катафрактарий 4700
	'g000uu8278', -- Божественная Длань 3400
	-- ренж
	'g001uu8257', -- Громовержец 3950
	'g001uu7625', -- Темный оракул 3700
	'g001uu8255', -- Эльф-тень 3200
	'g006uu1026', -- Жрец Смерти 3250
	'g001uu8260', -- Искуситель 3450
	'g000uu8304', -- Ангел разорения 4200
	'g000uu8305' -- Предвестница Смерти 5050
	)
end

-- нейтралы Велики1
function MercB1()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu5038' -- Бурый медведь 285
	elseif radn == 1 then
	return 'g000uu5037' -- Белый медведь 490
	elseif radn == 2 then
	return 'g000uu8189' -- Сущность искажения 500
	elseif radn == 3 then
	return 'g001uu8309' -- Триббог 625
	end
end

-- нейтралы Велики2
function MercB2()
	local radn = math.random(0,8)
	if radn == 0 then
	return 'g001uu8281' -- Горный ткач 1350
	elseif radn == 1 then
	return 'g000uu8160' -- Каменная сущность 1150
	elseif radn == 2 then
	return 'g001uu7551' -- Ларней 1090
	elseif radn == 3 then
	return 'g000uu8159' -- Ледяная сущность 1150
	elseif radn == 4 then
	return 'g000uu5015' -- Людоед 1090
	elseif radn == 5 then
	return 'g001uu8271' -- Огр 1250
	elseif radn == 6 then
	return 'g000uu8158' -- Сущность бури 1150
	elseif radn == 7 then
	return 'g000uu8161' -- Сущность пламени 1150
	elseif radn == 8 then
	return 'g000uu5035' -- Черный паук 1350
	end
end

-- нейтралы Велики3
function MercB3()
	local radn = math.random(0,9)
	if radn == 0 then
	return 'g001uu0025' -- Голем 2000
	elseif radn == 1 then
	return 'g001uu7554' -- Йорм 1300
	elseif radn == 2 then
	return 'g001uu7597' -- Кадавр 1850
	elseif radn == 3 then
	return 'g000uu5027' -- Кракен 1850
	elseif radn == 4 then
	return 'g001uu7586' -- Легат 1480
	elseif radn == 5 then
	return 'g001uu7620' -- Одержимый великан 1560
	elseif radn == 6 then
	return 'g001uu8280' -- Пещерный паук 1450
	elseif radn == 7 then
	return 'g000uu8166' -- Стихийный голем 1850
	elseif radn == 8 then
	return 'g000uu5016' -- Тролль 2100
	elseif radn == 9 then
	return 'g001uu7548' -- Черный тролль 2250
	end
end

-- нейтралы Велики4 - не использую пока
function MercB4()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001uu0051' -- Каменный предок 3500
	elseif radn == 1 then
	return 'g001uu0107' -- Мститель 3500
	elseif radn == 2 then
	return 'g000uu5010' -- Облачная Погибель 2370
	elseif radn == 3 then
	return 'g005uu6111' -- Пожиратель 2600
	elseif radn == 4 then
	return 'g001uu7596' -- Сюзерен бездны 2620
	elseif radn == 5 then
	return 'g001uu0104' -- Танатос 3500
	end
end

---
-- Юниты для наёмников (зона тренера)
function unitsMercenX(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = 'g000uu0006', level = 1, unique = false } i = i + 1 -- Лучник
unitsm[i] = { id = 'g000uu0011', level = 1, unique = false } i = i + 1 -- Послушница
unitsm[i] = { id = 'g000uu0008', level = 1, unique = false } i = i + 1 -- Ученик
unitsm[i] = { id = 'g000uu7628', level = 1, unique = true } i = i + 1 -- Имперский гвардеец
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = 'g004uu5039', level = 1, unique = false } i = i + 1 -- Снежный волк
unitsm[i] = { id = 'g000uu0026', level = 1, unique = false } i = i + 1 -- Метатель топоров
unitsm[i] = { id = 'g000uu0033', level = 1, unique = false } i = i + 1 -- Травница
unitsm[i] = { id = 'g000uu7627', level = 1, unique = true } i = i + 1 -- Советник Витара
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = 'g001uu7539','g000uu0086', level = 1, unique = false } i = i + 1 -- Колотун / Мертвец
unitsm[i] = { id = 'g000uu0080', level = 1, unique = false } i = i + 1 -- Адепт
unitsm[i] = { id = 'g000uu0078', level = 1, unique = false } i = i + 1 -- Привидение
unitsm[i] = { id = 'g001uu7592', level = 1, unique = true } i = i + 1 -- Торхот
unitsm[i] = { id = 'g000uu0092', level = 1, unique = true } i = i + 1 -- Оборотень
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
unitsm[i] = { id = 'g000uu0055', level = 1, unique = true } i = i + 1 -- Горгулья
unitsm[i] = { id = 'g000uu0057', level = 1, unique = true } i = i + 1 -- Черт
unitsm[i] = { id = 'g000uu7605', level = 1, unique = true } i = i + 1 -- Скульптор лжи
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0069', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = 'g000uu8018', level = 1, unique = false } i = i + 1 -- Разведчик
unitsm[i] = { id = 'g000uu8025', level = 1, unique = false } i = i + 1 -- Послушник леса
unitsm[i] = { id = 'g000uu8031', level = 1, unique = false } i = i + 1 -- Дух
unitsm[i] = { id = 'g000uu7629', level = 1, unique = true } i = i + 1 -- Благородный эльф
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

return unitsm
end


-- Наёмники в зоне тренера
function zoneMercenZoneX(race)
return {
	{
		units = unitsMercenX(race),
	}
}
end


-- Юниты для наёмников зоны 2 (начальные)
function unitsMercen12(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = rnd('g000uu0006','g000uu0011','g000uu0008'), level = 1, unique = false } i = i + 1 -- Лучник / Послушница / Ученик
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = rnd('g000uu0026','g000uu0033'), level = 1, unique = false } i = i + 1 -- Метатель топоров / Травница
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
unitsm[i] = { id = rnd('g000uu0080','g000uu0078'), level = 1, unique = false } i = i + 1 -- Адепт / Привидение
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6101', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Горгулья / Черт / Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0055','g000uu0057','g000uu0069'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = rnd('g000uu8018','g000uu8025','g000uu8031'), level = 1, unique = false } i = i + 1 -- Разведчик / Послушник леса / Дух
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

-- рандомный нейтрал т4
unitsm[i] = { id = rnd(MercM4(), MercA4(), MercMg4()), level = 1, unique = true } i = i + 1 -- мили / лучник / маг -- БЕЗ потдержки

return unitsm
end

-- Наёмники в зоне 2
function zoneMercenZone12(race)
return {
	{
		units = unitsMercen12(race),
		guard = gmm({}, guard2n()),
		}
	}
end


-- Юниты для наёмников зоны 3 (основные)
function unitsMercen(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Ангел / Бич ереси / Великий инквизитор / Защитник веры / Защитник угнетенных / Кара Императора / Сенешаль / Эмиссар // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0014','g000uu2016','g000uu0157','g000uu0015','g003uu6108','g000uu2010','g001uu7543','g000uu2031'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Игнар / Юстициар // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8312','g000uu9000'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Белый маг / Криомант / Магистр стихий // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0152','g001uu7582','g000uu8185'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Епископ / Патриарх / Прорицательница // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu7570','g000uu0150','g000uu0151'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Старый ветеран / Хранитель рун // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0040','g000uu2011'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
--  // Лучники4
unitsm[i] = { id = MercA4(), level = 1, unique = true } i = i + 1
-- Метатель огня / Отшельник / Повелитель волков // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2020','g000uu0163','g000uu0164'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Архидруид / Хэйсса / Эйра // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0160','g000uu7559','g000uu7557'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Каган Каменной Пасти / Клеврет Смерти / Скелет-рыцарь / Хан Каменной Пасти // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7540','g001uu8314','g000uu0089','g003uu5014'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Смерть / Сущий // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0177','g000uu0178'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Вампир / Лич // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0083','g000uu0084'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Длань Мортис // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu2008', level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1

--- 

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6101', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Возвышенный / Искоренитель // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0166','g000uu8254'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Истязатель душ // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2004', level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Пандемониус / Хозяин масок // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0066','g001uu8242'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Суккуб / Инкуб // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0173','g000uu0065'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Кераст / Налетчик /  // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7578','g000uu2013'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Разбойник / Штормовой кентавр // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8051','g001uu8240'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Консул // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8258', level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Дриолисса / Солнечная Танцовщица / Целитель // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu8214','g000uu8034','g000uu2002'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
end

-- рандомный нейтрал т5 (300-450xp) 3-4k цена
unitsm[i] = { id = MercR5(), level = 1, unique = true } i = i + 1 -- нейтрал т5

return unitsm
end

-- Наёмники в зоне 3
function zoneMercenZone(race)
return {
	{
		units = unitsMercen(race),
		guard = gmm({}, guard3n()),
		}
	}
end

-- Юниты для наёмников зоны 4 (центр)
function unitsMercen4(race, race2)
local unitsm = {}
local i = 1
unitsm[i] = { id = MercM2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercM3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercA3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercMg3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercB2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1

-- рандомный нейтрал т3
--unitsm[i] = { id = rnd(MercM3(), MercM3(), MercA3(), MercMg3(), MercH3()), level = 1, unique = true } i = i + 1 -- мили / мили / лучник / маг / потдержка
	
return unitsm
end

-- Наёмники в зоне 4 (центр)
function zoneMercenZone4(race, race2)
return {
	{
		units = unitsMercen4(race, race2),
		guard = gmm({}, guard4n()),
		}
	}
end

----------------------

-- Сундуки трен -- не использую
function bagsRespX()
return {
	count = 1,
	loot = {
			items = {
				orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
				{ id = b15(), min = 1, max = 1 },				
			}
	}
}
end


-- Сундуки Респ
function bagsResp00()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 250 }, 
		itemValue = { min = 250, max = 250 },
			items = {
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g001ig0180', min = 1, max = 2 }, --1/2трава
				{ id = e2(), min = 1, max = 1 }, --эл 200-375
			}
	}
}
end


-- Сундуки т1
function bagsResp0()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 490, max = 490 }, 
		itemValue = { min = 250, max = 375 },
			items = {
				{ id = rnd('g000ig0001','g000ig0006','g000ig0006'), min = 1, max = 1 }, --рес/хил100/хил100
				orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
				{ id = b15(), min = 1, max = 1 },
			}
	}
}
end

-- Сундуки т2
function bagsResp()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 740, max = 740 }, 
		itemValue = { min = 250, max = 625 },
			items = {
				{ id = rnd('g000ig0001','g000ig0006','g000ig0006'), min = 1, max = 1 }, --рес/хил100/хил100
				orr({ id = 'g001ig0180', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3трава/хил75
				{ id = w15(), min = 1, max = 1 },
			}
		}
}
end

-- Сундуки т3
function bagsZone34()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 990, max = 990 }, 
		itemValue = { min = 250, max = 799 },
			items = {
				{ id = rnd('g000ig0001','g000ig0006','g000ig0006'), min = 1, max = 1 }, --рес/хил100/хил100
				orr({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --хил100/2хил50
				{ id = e4(), min = 1, max = 1 }, -- 
			}
		}
	}
end

-- Сундуки т4
function bagsZone5()
return {
	count = 2,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 1000, max = 1100 },
		itemValue = { min = 375, max = 1000 },
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
				{ id = b15(), min = 1, max = 1 },
				{ id = rnd(b15(),w15()), min = 1, max = 1 },
				{ id = e4(), min = 1, max = 1 }, -- 
		}
	}
}
end

----------------------
-- МОИ ФУНКЦИИ
----------------------

-- Быль или не быть
function yn(what)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return ""
	end
end

-- Или / или
function orr(what, what2)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	end
end

-- Или / или 3
function orr3(what, what2, what3)
	local radn = math.random(0,2)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	end
end

-- Или / или 5
function orr5(what, what2, what3, what4, what5)
	local radn = math.random(0,4)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	elseif radn == 3 then
	return what4
	elseif radn == 4 then
	return what5
	end
end

-- случайный
function rnd(...)
    return (select(math.random(select('#', ...)), ...))
end

-- перемешать таблцу
function mix(tblmg)
		for i = #tblmg, 2, -1 do
			local j = math.random(i)
			tblmg[i], tblmg[j] = tblmg[j], tblmg[i]
		end
end

-- перебор всей таблицы (когда записей хватает)
function rndy(tabl)
	local x = math.random(1, #tabl)
	local y = tabl[x]
	table.remove(tabl, x)
	return y
end


-- проверка на банку на жезлы для лавки т1
function rndybj(tabl)
	local x = math.random(1, #tabl)
	local y = tabl[x]
	local x2 = x + 1
	local y2 = tabl[x2]
	if y ~= 'g001ig0524' then
		table.remove(tabl, x)
		return y
	else
		table.remove(tabl, x2)
		return y2
	end
end

---------------

-- Режим карты
function gmm(outrun, classic)
	if gmode == 1 then
	return outrun
	elseif gmode == 2 then
	return classic
	end
end

-- субраса игрока
function getPlayerSubRace(race)
	if race == Race.Human then return Subrace.Human
	elseif race == Race.Dwarf then return Subrace.Dwarf
	elseif race == Race.Undead then return Subrace.Undead
	elseif race == Race.Heretic then return Subrace.Heretic
	elseif race == Race.Elf then return Subrace.Elf
	end
end

-- родной шар манны
function ExtraHomeMana(race)
	
	shmn = 'g001ig0146' -- Шар маны Жизни
	sdw = 'g001ig0148' -- Шар маны Рун
	sun = 'g001ig0149' -- Шар маны Смерти
	shr = 'g001ig0147' -- Шар маны Преисподней
	self = 'g001ig0150' -- Шар Лесного эликсира 
	
	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- второй шар манны
function ExtraSecondMana(race)
	
	shmn = 'g001ig0146' -- Шар маны Жизни
	sdw = 'g001ig0148' -- Шар маны Рун
	sun = 'g001ig0149' -- Шар маны Смерти
	shr = 'g001ig0147' -- Шар маны Преисподней
	self = 'g001ig0150' -- Шар Лесного эликсира 
	
	if race == Race.Human then return sdw
	elseif race == Race.Dwarf then return shmn
	elseif race == Race.Undead then return shr
	elseif race == Race.Heretic then return sun
	elseif race == Race.Elf then return shmn
	end
end

-- доп шар в ст-ице на старте на спец. заклы
function ExtraMana(race)
	
	shmn = orr('g001ig0149','g001ig0150') -- Шар маны Смерти \ Шар маны Лесного эликсира
	sdw = orr('g001ig0150','g001ig0147') -- Шар маны Лесного эликсира \ Шар маны Преисподней
	sun = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	shr = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	self = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	
	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- случайный малый шар манны
function rmss()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0481' --жизни
	elseif radn == 1 then
	return 'g001ig0485' --лес
	elseif radn == 2 then
	return 'g001ig0482' --преисп.
	elseif radn == 3 then
	return 'g001ig0483' --рун
	elseif radn == 4 then
	return 'g001ig0484' --смерти
	end
end


-- случайный шар манны
function rms()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0146' --жизни
	elseif radn == 1 then
	return 'g001ig0150' --лес
	elseif radn == 2 then
	return 'g001ig0147' --преисп.
	elseif radn == 3 then
	return 'g001ig0148' --рун
	elseif radn == 4 then
	return 'g001ig0149' --смерти
	end
end

-- случайный большой шар манны
function rmsb()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0277' --жизни
	elseif radn == 1 then
	return 'g001ig0281' --лес
	elseif radn == 2 then
	return 'g001ig0278' --преисп.
	elseif radn == 3 then
	return 'g001ig0279' --рун
	elseif radn == 4 then
	return 'g001ig0280' --смерти
	end
end

-- случайная банка на 15
function b15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig0002' --зашита
	elseif radn == 1 then
	return 'g000ig0014' --атака
	elseif radn == 2 then
	return 'g000ig0011' --ини
	elseif radn == 3 then
	return 'g000ig0008' --точность
	end
end

-- случайная банка вард от стихий
function w15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig0021' --воздух
	elseif radn == 1 then
	return 'g000ig0022' --вода
	elseif radn == 2 then
	return 'g000ig0023' --земля
	elseif radn == 3 then
	return 'g000ig0024' --огонь
	end
end

-- случайная банка на 30 (не точность)
function b30()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000ig0003' --зашита
	elseif radn == 1 then
	return 'g000ig0015' --атака
	elseif radn == 2 then
	return 'g000ig0012' --ини
	end
end

-- случайная банка вард от дотов и спец урона
function d15()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0329' -- Эликсир защиты от дота
	elseif radn == 1 then
	return 'g001ig0351' --Эликсир защиты от поглощения
	elseif radn == 2 then
	return 'g001ig0343' --Эликсир защиты от проклятий
	elseif radn == 3 then
	return 'g001ig0341' -- Эликсир защиты от аффекта
	end
end

-- случайный эликсир 200-375 + эффект варды (от-яд з1)
function e2()
	local radn = math.random(0,7)
	if radn == 0 then
	return 'g001ig0560' -- Зелье провокатора 25принять
	elseif radn == 1 then
	return 'g001ig0547' -- Зелье пронзающего взгляда +10крит
	elseif radn == 2 then
	return 'g001ig0490' -- Зелье выносливости +25оз
	elseif radn == 3 then
	return 'g001ig0329' -- Эликсир защиты от дота
	elseif radn == 4 then
	return 'g001ig0351' -- Эликсир защиты от поглощения
	elseif radn == 5 then
	return 'g001ig0343' -- Эликсир защиты от проклятий
	elseif radn == 6 then
	return 'g002ig0007' -- Зелье магической устойчивости 250 (имун магия)
	elseif radn == 7 then
	return 'g002ig0005' -- Зелье наблюдательности 250 (15 ворам)
	end
end

-- случайный эликсир 400-500 + дот.вард
function e4()
	local radn = math.random(0,7)
	if radn == 0 then
	return 'g001ig0562' -- Зелье дуэлянта +20крит
	elseif radn == 1 then
	return 'g001ig0491' -- Зелье похищения жизни +25вамп
	elseif radn == 2 then
	return 'g001ig0355' -- Зелье тритоньей чешуи +вардурон
	elseif radn == 3 then
	return 'g001ig0127' -- Эликсир жизненной силы +50максоз
	elseif radn == 4 then
	return 'g001ig0128' -- Эликсир защиты от Оружия
	elseif radn == 5 then
	return 'g001ig0341' -- Эликсир защиты от аффекта
	elseif radn == 6 then
	return 'g002ig0006' -- Зелье бдительности 500 (30 ворам)
	elseif radn == 7 then
	return 'g002ig0008' -- Эликсир скрытого потенциала 500 (20оз +7точ.вт.атаки)
	end
end

-- случайный пермо-эликсир на 5% за 400
function p05()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0309' -- Эликсир задиры +5ини
	elseif radn == 1 then
	return 'g001ig0313' -- Эликсир совершенствования +5урон
	elseif radn == 2 then
	return 'g001ig0311' -- Эликсир хладнокровия +5точности
	elseif radn == 3 then
	return 'g001ig0315' -- Зелье великана +5ОЗ
	elseif radn == 4 then
	return 'g001ig0307' -- Зелье стойкости +5брони
	end
end

-- случайный пермо-вард-эффект за 400
function pw4e()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0346' -- Эликсир неудержимости - ослабление
	elseif radn == 1 then
	return 'g001ig0342' -- Эликсир норн - страх
	elseif radn == 2 then
	return 'g001ig0344' -- Эликсир предназначения - замедление
	elseif radn == 3 then
	return 'g001ig0348' -- Эликсир мудрости Лазгурона - понижение уровня 600
	end
end

-- случайный пермо-вард-дот за 400
function pw4d()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0332' -- Зелье ихора Танатоса - яд
	elseif radn == 1 then
	return 'g001ig0328' -- Эликсир ледяной плоти - мороз
	elseif radn == 2 then
	return 'g001ig0330' -- Эликсир Неопалимых - горение
	elseif radn == 3 then
	return 'g001ig0354' -- Жидкий металл Уру - разрушение 450
	end
end

-- случайный пермо-вард за 600
function pw6()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001ig0320' -- Зелье глубинного чудища - вода
	elseif radn == 1 then
	return 'g001ig0323' -- Зелье родства с пламенем - огонь
	elseif radn == 2 then
	return 'g001ig0322' -- Зелье текучего камня - земля
	elseif radn == 3 then
	return 'g001ig0321' -- Зелье укротителя небосвода - воздух
	elseif radn == 4 then
	return 'g001ig0340' -- Эликсир непорочности - полиморф 800
	elseif radn == 5 then
	return 'g001ig0338' -- Эликсир непоколебимости - паралич 800
	end
end

-- случайный пермо-эликсир на 15% за 1200 -- не использую
function p15()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0308' -- Зелье заступника +15брони
	elseif radn == 1 then
	return 'g001ig0314' -- Эликсир наследия +15урон
	elseif radn == 2 then
	return 'g001ig0310' -- Эликсир опережения +15ини
	elseif radn == 3 then
	return 'g001ig0522' -- Зелье посла +неподкупность
	elseif radn == 4 then
	return 'g001ig0513' -- Зелье твердого шага +5мувов
	end
end

-- арт-контроль для лавки т3
function artctrl01()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g001ig0042' -- Клыки Бездны (Артефакт) 950 (+15% урона. 25% шанс на Окаменение.)
	elseif radn == 1 then
	return 'g001ig0158' -- Ужасающий топор (Артефакт) 1200 (+12 урона. 30% шанс на Страх.)
--	elseif radn == 2 then
--	return 'g000ig3021' -- Кольцо Колдуньи (Артефакт) 1800 (55% шанс на Полиморф. -40% ОЗ.) имбовенько!!!
	end
end

-- арт-контроль для лавки т4
function artctrl02()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000ig3015' -- Кристалл души (Артефакт) 1800 (55% шанс на Паралич. Лишает владельца второй атаки.)
	elseif radn == 1 then
	return 'g000ig3016' -- Рог Инкуба (Артефакт) 1800 (55% шанс на Окаменение. Лишает владельца второй атаки.)
	elseif radn == 2 then
	return 'g000ig3018' -- Клинок Сущего (Артефакт) 1800 (55% шанс на Понижение уровня(Источник - смерть). Лишает владельца второй атаки.)
	end
end

-- сфера-контроль для лавки т3 (они-же для города в центре ф. spherex())
function orbctrl01()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000ig9040' -- Сфера Полиморфа 1000 (Накладывает на любую цель длительное превращение в беса или абомината. Источник - Разум.)
	elseif radn == 1 then
	return 'g000ig9007' -- Сфера понижения уровня 800 (Понижает уровень выбранному воину. Источник - Смерть.)
	elseif radn == 2 then
	return 'g001ig0181' -- Сфера Страха 800 (Накладывает страх на любую цель. Источник - Разум.)
	end
end

-- сфера-контроль для лавки т4
function orbctrl02()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000ig9006' -- Сфера Окаменения 800 (Накладывает длительное окаменение на любую цель. Источник - Земля.)
	elseif radn == 1 then
	return 'g000ig9039' -- Сфера Паралича 800 (Накладывает длительный паралич на любую цель. Источник - Разум.)
	end
end

-- сфера для ц.гор.
function spherex()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig9023' -- Сфера Инферно 60 горен крест 900
	elseif radn == 1 then
	return 'g000ig9040' -- Сфера Полиморфа 1000
	elseif radn == 2 then
	return 'g000ig9007' -- Сфера понижения уровня 900
	elseif radn == 3 then
	return 'g001ig0181' -- Сфера Страха 800
	end
end

-- заклы со старта
function CapSpell(race)
	sphmn = orr(orr('g000ss0002','g000ss0003'),orr('g000ss0004','g000ss0009')) -- Быстрота\Сила\Молния\Истинное зрение
	spdw = orr(orr('g000ss0021','g000ss0023'),orr('g000ss0024','g000ss0025')) -- Ледяной щит\Сила Витара\Буран\Призыв I: Рух
	spun = orr(orr('g000ss0061','g000ss0062'),orr('g000ss0065','g000ss0064')) -- Призыв I: Скелет\Мор\Ржавчина\Слабость
	sphr = orr(orr('g000ss0041','g000ss0045'),orr('g000ss0043','g000ss0044')) -- Incantare Hellhound\Tormentio\Ignis mare\Menta minoris
	spelf = orr(orr('g000ss0097','g000ss0098'),orr('g000ss0101','g000ss0106')) -- Кустарник\Призыв I: Энт Малый\Стая\Смятение
	
	if race == Race.Human then return sphmn
	elseif race == Race.Dwarf then return spdw
	elseif race == Race.Undead then return spun
	elseif race == Race.Heretic then return sphr
	elseif race == Race.Elf then return spelf
	end
end

-- случайная субраса
function rsub()
	local radn = math.random(0,4)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --гномы
	elseif radn == 4 then
	return {Subrace.Undead, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --нежить
	end
end

-- субраса только не нежить + водные
function NoUndead()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end

-- субраса только не нежить + водные - драконы
function NoUndeadDragon()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end


-- случайный пермо-эликсир на для руин 0
function ruin0()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g001ig0309' -- Эликсир задиры +5ини
	elseif radn == 1 then
	return 'g001ig0313' -- Эликсир совершенствования +5урон
	elseif radn == 2 then
	return 'g001ig0307' -- Зелье стойкости +5брони
	elseif radn == 3 then
	return 'g001ig0533' -- Зелье ясного взора (+2 обзора)	
	end
end

-- случайный пермо-эликсир на для руин в зоне тренера
function ruinTrainers()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001ig0025' -- Аура живучести +10оз аое
	elseif radn == 1 then
	return 'g001ig0024' -- Аура защиты +10брони аое
	elseif radn == 2 then
	return 'g001ig0021' -- Аура слепой ярости +10атаки аое
	elseif radn == 3 then
	return 'g001ig0031' -- Аура точности +15точности аое
	elseif radn == 4 then
	return 'g001ig0023' -- Аура стремительности +10ини аое
	elseif radn == 5 then
	return 'g001ig0563' -- Аура внимательности +5крит аое
	end
end

-- для вторых аутркросс-руин в зоне тренера
function ruinTrainers2()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0013' -- Аура защиты от Воды 900
	elseif radn == 1 then
	return 'g001ig0015' -- Аура защиты от Воздуха
	elseif radn == 2 then
	return 'g001ig0014' -- Аура защиты от Земли
	elseif radn == 3 then
	return 'g001ig0012' -- Аура защиты от Огня
	elseif radn == 4 then
	return 'g001ig0009' -- Аура защиты от магии Разума 1200
	end
end

--------------

-- отряды у тренера
function PredSkinX(omin, omax, olmin, olmax)
return { -- 70 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
		count = 1,
			subraceTypes = { Subrace.NeutralGreenSkin, Subrace.NeutralWolf, Subrace.Neutral },
			value = { min = omin*kef, max = omax*kef },
			loot = {
				itemTypes = { Item.PotionHeal, Item.PotionRevive },
				value = { min = olmin, max = olmax },
				itemValue = { min = 50, max = 250 },
				items = {
					orr3({ id = b15(), min = 1, max = 1 }, { id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /случ. банка15 / случ. вард
				}
			}
}
end
-- отряд варвары
function PredBarb(vmin, vmax, vlmin, vlmax)
return { 
-- новые: 90 трибог, 110 айтвар, 135 ящер-воин, 485 ларней, 775 болотный страж, 985 лиргид, 1775 болотный дракон
-- старые: 165 шаманка, 175 трапер, 220 вождь, 270 дик.вел

		count = 1,
			subraceTypes = { Subrace.NeutralBarbarian, Subrace.NeutralMarsh, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
			value = { min = vmin*kef, max = vmax*kef },
			loot = {
				itemTypes = { Item.Scroll, Item.Orb },
				value = { min = vlmin, max = vlmin },
				itemValue = { min = vlmin, max = vlmin },
				items = {
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				}
			}
}
end

-- отряд орки
function PredSkin(omin, omax, olmin, olmax)
return { -- 70 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
		count = 1,
			subraceTypes = { Subrace.NeutralGreenSkin, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
			value = { min = omin*kef, max = omax*kef },
			loot = {
				itemTypes = { Item.PotionHeal, Item.PotionRevive },
				value = { min = olmin, max = olmax },
				itemValue = { min = 50, max = 250 },
				items = {
					orr({ id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /  случ. вард
				}
			}
}
end


----------------------
-- Отряды респ
---------------------

function zoneStacksRespZ00()
return {  -- 175*3
		subraceTypes = rsub(),
		count = 3,
		value = { min = 525*kef, max = 525*kef*kr },
		loot = {
			items = {
				{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
				{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
				{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
--				{ id = 'g000ig7001', min = 1, max = 1 }, --кольцо50
				{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны				
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = w15(), min = 1, max = 1}, -- случ. дотвард
			}
		}
}
end


function zoneStacksRespZ001()
return { -- 180*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 360*kef, max = 360*kef*kr },
		loot = {
			itemTypes = { Item.Orb, Item.Scroll },
			value = { min = 290, max = 290 },
			itemValue = { min = 100, max = 100 },		
			items = {
				{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
				{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
				orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			}
		}
}
end

function zoneStacksRespZ002()
return { -- 185*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 370*kef, max = 370*kef*kr },
		loot = {
			items = {			
				{ id = rndy(ttal1), min = 1, max = 1}, -- талик т1
				{ id = 'g001ig0378', min = 1, max = 1}, --хил75
				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
			}
		}
}
end


--------------
-- Отряд проход01
--------------

function zoneStacksP01()
return { -- 190
		subraceTypes = rsub(),
		count = 1,
		value = { min = 190*kef, max = 190*kef*kr },
		loot = {
			items = {
				orr({ id = 'g000ig0005', min = 2, max = 2 }, { id = 'g000ig0006', min = 1, max = 1 }), --2хил50/хил100
				{ id = rnd(rmss(),rmss(),'g001ig0431'), min = 1, max = 1}, -- случ. мал. шар / случ. мал. шар / гранат75
			}
		}
}
end

--------------
-- Отряды т1
--------------

-- т1 сила два режима
function vgmode1(val)
local kcross = 1.05 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

----------

function Pred1RespZ0()
return {  --200xp*2 -- сферы
		subraceTypes = rsub(),
		count = 2,
			value = { min = vgmode1(400), max = vgmode1(400)*kr },
			loot = {
				itemTypes = { Item.Orb },
				value = { min = 390, max = 390 },
				itemValue = { min = 100, max = 200 },
				items = {
					orr({ id = 'g000ig0005', min = 2, max = 2 }, { id = 'g000ig0006', min = 1, max = 1 }), --2хил50/хил100
					{ id = b15(), min = 1, max = 1 }, -- случ. банка15				
					{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
					{ id = e2(), min = 1, max = 1 }, -- 
				}
			}
}
end

function Pred1RespZ01()
return { --250xp*2 -- свитки т1+т1
		subraceTypes = rsub(),
		count = 2,
			value = { min = vgmode1(500), max = vgmode1(500)*kr },
			loot = {
				itemTypes = { Item.Scroll },
				value = { min = 550, max = 550 },
				itemValue = { min = 200, max = 200 },
				items = {
					{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					{ id = 'g001ig0180', min = 1, max = 1}, --хил25
					orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
					{ id = b15(), min = 1, max = 1}, -- случ. банка15	
				}
			}
}
end

function Pred1RespZ02() 
return { --300xp*1 -- драги75
		count = 1,
			subraceTypes = rsub(),
			value = { min = vgmode1(300), max = vgmode1(300)*kr },
			loot = {
				items = {
					{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
					{ id = 'g000ig0008', min = 1, max = 1}, -- точность15
				}
			}
}
end

function Pred1RespZ03() 
return { --300xp*1  / -- вард оружия/Зелье дозорного
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = vgmode1(310), max = vgmode1(310)*kr },
			loot = {
				items = {
					orr({ id = e2(), min = 1, max = 1 },{ id = 'g001ig0532', min = 1, max = 1 }), -- эл200/Зелье дозорного
					{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
				}
			}
}
end

function Pred1RespZ04()
return { -- 300*1
		subraceTypes = rsub(),
		count = 1,
			value = { min = vgmode1(320), max = vgmode1(320)*kr },
		loot = {
			items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g001ig0378', min = 1, max = 1 }), --рес/хил75
				orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), -- вард разума / вард смерти
				{ id = 'g000ig0021', min = 1, max = 1 }, --возд
			}
		}
}
end


function Pred1RespZD() 
return { --350xp*1 -- талисман 200-275
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = vgmode1(350), max = vgmode1(350)*kr },
			loot = {
				items = {
					{ id = rndy(ttal2), min = 1, max = 1}, -- талик т2					
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
				}
			}
}
end


------------------
-- Отряды т2
------------------

-- т2 сила два режима
function vgmode2(val)
local kcross = 1.1 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end


--------------
-- Отряд проход12
--------------

function zoneStacksP12(race)
return { -- 320
		subraceTypes = rsub(),
		count = 1,
		value = { min = vgmode2(320), max = vgmode2(320)*kr },
		loot = {
			items = {
				{ id = rnd('g000ig0001','g000ig0006','g000ig0006'), min = 1, max = 1 }, --рес/хил100/хил100
				{ id = rnd(ExtraHomeMana(race),ExtraHomeMana(race),rms(),'g001ig0432'), min = 1, max = 1}, -- родн. шар / родн. шар / случ. шар / аметист125
			}
		}
}
end

----

function zoneStacksResp1()
return { -- 300xp*1
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(300), max = vgmode2(300)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
		}
	},
}	
end

function Pred1Resp01()
return { -- 350хп*2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(700), max = vgmode2(700)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
			{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
			{ id = d15(), min = 1, max = 1 }, --случ. дотвард
		}
	}
}
end

function zoneStacksResp()
return { -- 400xp*2 / свиток/сфера 200
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(800), max = vgmode2(800)*kr },
	loot = {
		itemTypes = { Item.Scroll, Item.Orb },
		value = { min = 590, max = 590 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g001ig0485', min = 1, max = 1 }, --мал. шар лес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = 'g000ig0008', min = 1, max = 1 }, --меткость15
			{ id = 'g001ig0036', min = 1, max = 1 }, --смерти
		}
	},
}
end

function Pred1Resp1() 
return { -- 450хп*2 --
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(900), max = vgmode2(900)*kr },
	loot = {
		items = {
			{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = 'g001ig0481', min = 1, max = 1 }, -- мал. шар жизни
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
		}
	}
}
end

function Pred1Resp2()
return { -- 500хп*2 -- свиток т1+т2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 690, max = 690 },
		itemValue = { min = 200, max = 400 },
		items = {
			{ id = 'g001ig0482', min = 1, max = 1 }, --мал.шар преисп
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --воздуха/огня
		}
	}
}
end

function Pred1Resp3()
return { -- 500хп*2 --
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		itemTypes = { Item.Orb },
		value = { min = 1100, max = 1100 }, -- 2 сфера 
		itemValue = { min = 400, max = 400 },
		items = {
			{ id = 'g001ig0483', min = 1, max = 1 }, -- мал. шар рун
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = 'g002ig0007', min = 1, max = 1}, -- Зелье магической устойчивости
		}
	}
}
end

function Pred1Resp4()
return { -- 500хп*2 -- 
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode2(1000), max = vgmode2(1000)*kr },
	loot = {
		items = {
			{ id = 'g001ig0484', min = 1, max = 1 }, -- мал. шар смерти
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = rnd('g001ig0561','g001ig0533',rnd(pw4d(),pw4e())), min = 1, max = 1 }, -- Эликсир самопожертвования -телохр.25 / Зелье ясного взора 400 / Пермоварды-дот-эффект 400
			{ id = b15(), min = 1, max = 1}, -- случ. банка15
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
		}
	}
}
end

function Pred1Resp5()
return { -- 550хп*1 -- посох 200
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(550), max = vgmode2(550)*kr },
	loot = {
		itemTypes = { Item.Wand },
		value = { min = 200, max = 200 }, 
		itemValue = { min = 200, max = 200 },			
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
			{ id = d15(), min = 1, max = 1}, -- случ. дотвард	
		}
	}
}
end

function Pred1RespD()
return { -- 650хп*1 -- перк 600 / случ. пермо-эликсир на 5%
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(650), max = vgmode2(650)*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0125', min = 1, max = 1 }, --разума
			{ id = p05(), min = 1, max = 1 }, -- случ. пермо-эликсир на 5%
		}
	}
}
end

--------------------
-- Отряды т3
--------------------

-- т3 сила два режима
function vgmode3(val)
local kcross = 1.15 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

--------------
-- Отряд проход23
--------------

function zoneStacksP23(race)
return { -- 570
		subraceTypes = rsub(),
		count = 1,
		value = { min = vgmode2(570), max = vgmode2(570)*kr },
		loot = {
			items = {
				{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
				{ id = rnd(ExtraSecondMana(race),ExtraSecondMana(race),rms(),'g001ig0433'), min = 1, max = 1}, -- второй. шар / второй. шар / случ. шар / аквамарин175
				{ id = rnd(b15(),w15()), min = 1, max = 1 }, --случ. банка15 / случ. вард
			}
		}
}
end

----

function zoneStacksZone34()
return { -- 600xp*3
	subraceTypes = rsub(),
	count = 3,
	value = { min = vgmode3(1800), max = vgmode3(1800)*kr },
	loot = {
		items = {
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			orr({ id = b15(), min = 1, max = 1}, { id = 'g002ig0005', min = 1, max = 1}), -- случ. банка15 / Зелье наблюдательности15
			orr({ id = 'g000ig0011', min = 1, max = 1 }, { id = 'g000ig0008', min = 1, max = 1 }), --15ини/точности
			{ id = 'g000ig7002', min = 1, max = 1 }, --кольцо100
			{ id = 'g001ig0127', min = 1, max = 1 }, --50оз
		}
	},
}
end

function Pred1Zone1()
return { -- 700хп*2 -- свиток т2+т2
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1400), max = vgmode3(1400)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 1100, max = 1100 },
		itemValue = { min = 400, max = 400 },
		items = {
			{ id = e2(), min = 1, max = 1 }, --эликсир200
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			orr({ id = 'g000ig0002', min = 1, max = 1 }, { id = 'g000ig0014', min = 1, max = 1 }), --15зашиты/атаки
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
		}
	}
}
end

function Pred1Zone2()
return { -- 800хп*2 -- сфера375-400
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1600), max = vgmode3(1600)*kr },
	loot = {
		itemTypes = { Item.Orb },
		value = { min = 1100, max = 1100 }, -- сфера
		itemValue = { min = 400, max = 500 },
		items = {
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g000ig0014', min = 1, max = 1 }, { id = 'g000ig0008', min = 1, max = 1 }), --15атаки/точности
			orr({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
			orr({ id = 'g000ig0012', min = 1, max = 1 }, { id = 'g002ig0006', min = 1, max = 1 }), --ини30 / Зелье бдительности 30 воры
		}
	}
}
end

function Pred1Zone3()
return { -- 900хп*2 -- 3 x элексир буст 350-500
	subraceTypes = rsub(),
	count = 2,
	value = { min = vgmode3(1800), max = vgmode3(1800)*kr },
	loot = {
		itemTypes = { Item.PotionBoost },
		value = { min = 1200, max = 1275 }, -- эликсир 350-425-500
		itemValue = { min = 350, max = 540 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = pw6(), min = 1, max = 1 }, --перм.вард600
			orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			{ id = 'g000ig0015', min = 1, max = 1 }, --атака30
		}
	}
}
end

function Pred1Zone4()
return { -- 1000хп*2 -- сфера/свиток 400*2
	count = 2,
	subraceTypes = NoUndead(),			
	value = { min = vgmode3(2000), max = vgmode3(2000)*kr },
	loot = {
		itemTypes = { Item.Scroll, Item.Orb },
		value = { min = 1190, max = 1190 },
		itemValue = { min = 500, max = 600 },
		items = {
			{ id = rndy(ttal4), min = 1, max = 1}, -- талик т4
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = e4(), min = 1, max = 1 }, --эликсир400
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
			orr({ id = 'g000ig0011', min = 1, max = 1 }, { id = 'g000ig0002', min = 1, max = 1 }), --15ини/защиты
			{ id = 'g000ig0003', min = 1, max = 1 }, --30защиты
		}
	}
}
end

function Pred1ZoneD() 
return { --1300хп*1 --свиток т3 + пермо
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode3(1300), max = vgmode3(1300)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 550, max = 550 },
		itemValue = { min = 550, max = 550 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0018', min = 1, max = 1 }, -- мазь
			rnd({ id = 'g000ig0003', min = 1, max = 1 }, { id = 'g000ig0015', min = 1, max = 1 }, { id = 'g002ig0008', min = 1, max = 1 }), --30защиты / 30атаки / Эликсир скрытого потенциала
			{ id = p05(), min = 1, max = 1 }, -- случ. пермо-эликсир на 5%
		}
	}
}
end


--------------------
-- Отряды т4 (трежа)
--------------------

function zoneStacksZone5()
return { -- 1100хп*3
		subraceTypes = rsub(),
		count = 3,
		value = { min = 3300*kef, max = 3300*kef*kr},
		loot = {
			items = {
				{ id = rms(), min = 1, max = 1 }, --случ. шар манны
				{ id = 'g001ig0432', min = 1, max = 1 }, --аметист125
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100				
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g001ig0547', min = 1, max = 1 }, --крит15
				{ id = 'g001ig0127', min = 1, max = 1 }, --оз50
				{ id = 'g001ig0355', min = 1, max = 1 }, --вард.урон
				{ id = 'g002ig0007', min = 1, max = 1 }, --Зелье магической устойчивости 
				{ id = 'g002ig0005', min = 1, max = 1 }, --Зелье наблюдательности
				{ id = 'g002ig0006', min = 1, max = 1 }, --Зелье бдительности
			}
		},
}
end

function zoneStacksZone501()
return { -- точн30+талик
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1200*kef, max = 1200*kef*kr },
				loot = {
					items = {
						{ id = rndy(ttal5), min = 1, max = 1}, -- талик т5
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
						orr({ id = 'g000ig0009', min = 1, max = 1 }, { id = 'g002ig0008', min = 1, max = 1 }), --точность30 / Эликсир скрытого потенциала
					}
				}
}
end

function zoneStacksZone502()
return { -- e2+хил200
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1300*kef, max = 1300*kef*kr },
				loot = {
					items = {
						{ id = 'g000ig0001', min = 1, max = 1 }, --рес
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = e2(), min = 1, max = 1 }, -- эл 200-375
						{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
					}
				}
}
end

function zoneStacksZone503()
return { -- 25вамп
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 1400*kef, max = 1400*kef*kr },
				loot = {
					items = {
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0491', min = 1, max = 1 }, -- Зелье похищения жизни +25вамп
					}
				}
}
end


local Pred1Zone5Value = { min = 1500*kef, max = 1500*kef*kr } -- 

function Pred1Zone51()
return { -- шар
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					items = {
						orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = rms(), min = 1, max = 1 }, --случ. шар манны
						{ id = 'g000ig0015', min = 1, max = 1 }, --атака30
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
					}
				}
}
end

function Pred1Zone52()
return { -- свиток
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					itemTypes = { Item.Scroll },
					value = { min = 550, max = 550 },
					itemValue = { min = 550, max = 550 }, 
					items = {
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
						{ id = 'g000ig0012', min = 1, max = 1 }, --ини30
					}
				}
}
end

function Pred1Zone53()
return { -- сфера
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					itemTypes = { Item.Orb },
					value = { min = 900, max = 900 }, -- сфера 450-700
					itemValue = { min = 500, max = 700 }, 
					items = {
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
						{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
						{ id = 'g001ig0378', min = 1, max = 1}, --хил75
					}
				}
}
end

function Pred1Zone54()
return { -- e4
			count = 1,
			subraceTypes = NoUndead(),
			value = Pred1Zone5Value,
				loot = {
					items = {
					orr(
						{ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
						{ id = 'g000ig0006', min = 1, max = 1}, --хил100
						{ id = 'g001ig0125', min = 1, max = 1 }, -- разума
						{ id = e4(), min = 1, max = 1 }, --эликсир400
						{ id = d15(), min = 1, max = 1 }, --случ.дотвард
					}
				}
}
end

function Pred1Zone5D() 
return { --2000хп*1 -- пермо700-800
			count = 1,
			subraceTypes = NoUndead(),
			value = { min = 2000*kef, max = 2100*kef },
				loot = {
					itemTypes = { Item.PotionPermanent },
					value = { min = 1200, max = 1200 },
					itemValue = { min = 700, max = 800 }, 
					items = {
						{ id = 'g000ig0001', min = 1, max = 1 }, --рес
						{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
						{ id = 'g000ig0018', min = 1, max = 1 }, --хил200

					}
				}
}
end
	
-------------------------

-- Охрана объектов
--0
function guard0() -- респ0
return {
	value = { min = 170*kef, max = 178*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0005', min = 1, max = 1}, { id = 'g001ig0180', min = 2, max = 2}), -- хил50/2хил25
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g000ig7001', min = 1, max = 1}), -- случ. мал. шар / кольцо50
		},
	}
}
end

--1
function guard1() -- зона1 --драги 250-375
return {
	value = { min = 250*kef, max = 260*kef },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g000ig7001', min = 1, max = 1}), -- случ. мал. шар / кольцо50
		},
	}
}
end

--2
function guard2() -- зона2 --драги 250
return {
	value = { min = 400*kef, max = 420*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 250 },
		itemValue = { min = 250, max = 250 },
		items = {
			orr({ id = 'g000ig0006', min = 1, max = 1}, { id = 'g000ig0005', min = 2, max = 2}), -- хил100/2хил50
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15			
		},
	}
}
end

function guard2n() -- зона2 наём.
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

function guard2r() -- зона2 обменник
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			orr({ id = 'g001ig0431', min = 1, max = 1 }, { id = rmss(), min = 1, max = 1 }), --гранат75/случ. мал.шар манны			
			{ id = e2(), min = 1, max = 1 },
		},
	}
}
end

function guard2m() -- зона2 башн.
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = rmss(), min = 1, max = 1 }, -- случ. мал.шар манны			
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

--3
function guard3m() -- зона3 башн.
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = rms(), min = 1, max = 1}, --случ. шар манны			
			{ id = w15(), min = 1, max = 1}, -- случ. вард
		},
	},
}
end

function guard3() -- зона3 --драги 500
return { 
	value = { min = 700*kef, max = 735*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 500 },
		itemValue = { min = 500, max = 500 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			orr({ id = 'g000ig0005', min = 1, max = 1}, { id = 'g001ig0180', min = 2, max = 2}), -- хил50/2хил25			
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15			
		},
	}
}
end

function guard3n() -- зона3 наём.
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g001ig0378', min = 1, max = 1}, --хил75
				{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
				{ id = w15(), min = 1, max = 1}, -- случ. вард		
		},
	}
}
end

--4
function guard4() -- зона4 центр --драги
return { 
	value = { min = 1200*kef, max = 1260*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 950, max = 950 },
		itemValue = { min = 500, max = 750 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100		 
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard4r() -- зона4 центр обменник
return {
	value = { min = 1100*kef, max = 1100*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			orr({ id = 'g001ig0432', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --аметист125/случ. шар манны		
			{ id = e4(), min = 1, max = 1 }, --			
		},
	}
}
end

function guard4n() -- зона4 центр наём.
return {
	value = { min = 1000*kef, max = 1000*kef },
	loot = {
		items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1}, -- хил100				
				{ id = rnd(pw4d(),pw4e(),pw6()), min = 1, max = 1 }, -- пермо вард
				{ id = rnd(b15(),b15(),w15()), min = 1, max = 1 }, --случ.банка15/вард			
		},
	}
}
end
------------------

-- Главная охрана прохода между зонами 2-4
function zoneGuardZone0()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 1500*kef, max = 1560*kef }, --
	loot = {
		value = { min = 700, max = 700 },
		itemValue = { min = 400, max = 500 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7004', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --кольцо200/случ. шар манны
			orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			{ id = rnd(b15(),w15(),w15()), min = 1, max = 1 }, --случ. банка вард 66% / случ. банка15 33%
			{ id = e2(), min = 1, max = 1}, --
			{ id = rndy(tp2p), min = 1, max = 1}, --
		}
	}
}
end

-- Главная охрана прохода между зонами 3-4
function zoneGuardZone()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 1700*kef, max = 1780*kef }, --
	loot = {
		value = { min = 1100, max = 1100 },
		itemValue = { min = 600, max = 800 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7005', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --рубин/случ. шар манны
			{ id = rnd('g001ig0125','g001ig0036','g001ig0128'), min = 1, max = 1 }, --разума/смерти/оружия
			{ id = rnd(b15(),b15(),w15()), min = 1, max = 1 }, --случ. банка вард 33% / случ. банка15 66%
			{ id = e4(), min = 1, max = 1 }, --
			{ id = rndy(tp2p), min = 1, max = 1}, --
		}
	}
}
end



-- Главная охрана прохода между зонами очень-сильная
function zoneGuardZoneR()

-- Награда за ГО т3-тренер

-- Знамя вампиризма / Знамя войны / Знамя Здоровья / Знамя стойких / Знамя стойкости / Стяг багровых рек / Стяг непреклонности / Штандарт равновесия
-- / Гравированная диадема / Боевая коса (только тут) / Коготь Пожирателя / Кольцо Несгибаемого стража / Копье Ангела / Кама Кровавого Ворона / Кольцо веков (только тут)
-- / Корона Империи (Реликвия) / Тяжелые латы (Реликвия) 
local itemGuardZoneR = {'g001ig0153','g000ig1016','g000ig1017','g001ig0052','g000ig1015','g001ig0366','g001ig0290','g001ig0291',
'g000ig2005','g001ig0179','g001ig0102','g001ig0488','g002ig0017','g002ig0014','g000ig3006',
'g000ig7010','g001ig0038'}

mix(itemGuardZoneR)

return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 2600*kef, max = 2700*kef },
	loot = {
--		value = { min = 2900, max = 2900 },
--		itemValue = { min = 1500, max = 1800 },
--		itemTypes = { Item.Weapon, Item.Armor, Item.Jewel, Item.Banner },
		items = {
			{ id = itemGuardZoneR[1], min = 1, max = 1 },
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			{ id = 'g000ig0018', min = 1, max = 1 }, --мазь
			orr({ id = rmsb(), min = 1, max = 1 }, { id = 'g000ig7006', min = 1, max = 1 }), --сл.большой шар/Сапфир
			{ id = p05(), min = 1, max = 1 }, --пермо5
			{ id = e2(), min = 1, max = 1}, -- эл200
			{ id = e4(), min = 1, max = 1 }, --эликсир400
		}
	}
}
end

----------------------


-- СВОДНЫЕ ТАБЛИЦЫ

-- Вернет таблицу с описанием Респа 0

function getPlayerZone00(zoneId, playerRace, zoneSize)

	return {
		id = zoneId,
		type = Zone.PlayerStart,
		race = playerRace,
		size = zoneSize,
		mines = getMinesRespZ(playerRace),
		ruins = zoneRuinRespZ0(),
		bags = bagsResp00(),
		stacks = {zoneStacksRespZ00(), zoneStacksRespZ001(), zoneStacksRespZ002(), PredSkin(135, 145, 100, 100), PredSkin(145, 155, 100, 100)},
		merchants = zoneMerchRespZ0(),

		capital = {
			garrison = { -- столица
				subraceTypes = { getPlayerSubRace(playerRace) },
				value = { min = 50, max = 50 },
				loot = {
					itemTypes = { Item.Orb, Item.Scroll },
					value = { min = 400, max = 400 },
					itemValue = { min = 400, max = 400 },
					items = {						
						{ id = 'g000ig0001', min = 4, max = 4}, --рес
						{ id = 'g000ig0006', min = 4, max = 4}, --хил100
						{ id = 'g001ig0378', min = 3, max = 3}, --хил75
						{ id = 'g000ig0005', min = 5, max = 5}, -- хил50
						{ id = 'g001ig0180', min = 6, max = 6}, -- хил25

						{ id = 'g000ig0002', min = 1, max = 1 }, --15
						{ id = 'g000ig0014', min = 1, max = 1 }, --15
						{ id = 'g000ig0011', min = 1, max = 1 }, --15
						{ id = 'g000ig0008', min = 1, max = 1 }, --15
						{ id = b15(), min = 1, max = 1}, -- случ. банка15

						{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0024', min = 1, max = 1 }, -- вард
						{ id = w15(), min = 1, max = 1}, -- случ. вард
						
						orr({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), -- вард разума / вард смерти

						{ id = rnd(d15(),'g001ig0490','g001ig0128','g002ig0008'), min = 1, max = 1}, -- случ. дотвард / Зелье выносливости +15%оз / вард оружия / Эликсир скрытого потенциала 500 (20оз +7точ.вт.атаки)
						
						-- сфера
						{ id = rnd('g001ig0458','g000ig9031','g000ig9022','g001ig0302'), min = 1, max = 1}, -- 25 Сфера Каменного проклятия / Сфера Ливня / Сфера Углей / Сфера Шторма
						{ id = rnd('g001ig0189','g001ig0178','g001ig0472','g001ig0473'), min = 1, max = 1}, -- 50 Сфера Камня / Сфера Костра / Сфера Ледяного осколка / Сфера Статического разряда
						
						-- свиток
						{ id = rnd('g000ig5021','g000ig5003','g000ig5002','g001ig0072','g000ig5007','g000ig5102'), min = 1, max = 1}, -- свиток л.щит / сила / быстрота / Свиток "Соколиная зоркость"+2вижн / Свиток "Исцеление" / Свиток "Стойкость рощи" +15оз
						{ id = rnd('g001ig0248','g000ig5106','g000ig5064','g000ig5101','g000ig5044','g001ig0247'), min = 1, max = 1}, -- свиток устр.гимн-ини / смятение-ини / слабость-5урон.ини / стая-10урон / Menta minoris-5урон.точн / неудача-10точн

						{ id = ExtraMana(playerRace), min = 1, max = 1 }, --доп.шар
					}
				},
			},
			spells = {
				CapSpell(playerRace)
			}			
		}
	}
end

-- Вернет таблицу с описанием зоны 1
function getPlayerZone0(zoneId, playerRace, zoneSize)

	return {
		id = zoneId,
		type = Zone.Junction,
		race = playerRace,
		size = zoneSize,
		towns = zoneTownsResp0(),
		merchants = zoneMerchRespZ(),
		ruins = zoneRuinRespZ(),
		bags = bagsResp0(),
		mines = getMinesRespZ2(playerRace),
		stacks = {Pred1RespZ0(), Pred1RespZ01(), Pred1RespZ02(), Pred1RespZ03(), Pred1RespZ04(), Pred1RespZD(), PredSkin(210, 220, 200, 225), PredBarb(220,230,100,200)},

	}
end

-- Респ: Вернет таблицу с описанием зоны 2
function getPlayerZone(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.Junction, -- Junction -- Treasure
		race = playerRace,
		size = zoneSize,
		towns = zoneTownsResp(playerRace),
		merchants = zoneMerchResp(),
		ruins = zoneRuinResp(),
		mercenaries = zoneMercenZone12(playerRace),
		mines = getMinesResp(playerRace),
		mages = zoneMageResp(),
--		resourceMarkets = rMarketsZone2(),
		stacks = {zoneStacksResp(), zoneStacksResp1(), Pred1Resp01(), Pred1Resp1(), Pred1Resp2(), Pred1Resp3(), Pred1Resp4(), Pred1Resp5(), Pred1RespD(), PredSkin(390, 400, 200, 250), PredBarb(480,484,200,400)},
		bags = bagsResp(),
	}
end

-- Вернет таблицу с описанием зоны 3
function getTreasureZone34(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		race2 = playerRace2,	
		type = Zone.Junction,
		size = zoneSizeTre,
		towns = zoneTownsZone34(playerRace),
		merchants = zoneMerchZone34(),
		ruins = zoneRuinZone34(),
		mines = getMinesZone34(playerRace, playerRace2),
		mages = zoneMageZone34(),
		mercenaries = zoneMercenZone(playerRace),
		stacks = {zoneStacksZone34(), Pred1Zone1(), Pred1Zone2(), Pred1Zone3(), Pred1Zone4(), Pred1ZoneD(), PredBarb(770,774,400,550) },
		bags = bagsZone34(),
	}
end

-- Вернет таблицу с описанием зоны 4 (центр)
function getTreasureZone5(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {

		race = playerRace,
		race2 = playerRace2,
		
	id = zoneId,
		type = Zone.Treasure,
		size = zoneSizeTre,
		towns = zoneTownsZone5(),
		merchants = zoneMerchZone5(),
		mercenaries = zoneMercenZone4(playerRace, playerRace2),
		ruins = zoneRuinZone5(),
		mines = getMinesZone5(playerRace, playerRace2),
		resourceMarkets = rMarketsZone5(),
		stacks = {zoneStacksZone5(), zoneStacksZone501(), zoneStacksZone502(), zoneStacksZone503(), Pred1Zone51(), Pred1Zone52(), Pred1Zone53(), Pred1Zone54(), Pred1Zone5D(), PredBarb(1550,1600,500,600) },
		bags = bagsZone5(),
		--mages = zoneMageZone5(),
	}
end

-- Вернет таблицу с описанием зоны-тренера
function getTreasureZoneTrainers(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {
--	border = Border.Water,
	id = zoneId,
		ruins = gmm(zoneRuinTrainers(),zoneRuinTrainersCross()),
		race = playerRace,
		race2 = playerRace2,
		type = Zone.Junction,  -- Junction -- Treasure
		size = zoneSizeTre,
		mines = getMinesX(playerRace, playerRace2),
		mages = zoneMageTrainer(),
--		mercenaries = zoneMercenZoneX(playerRace),
--		bags = bagsRespX(), -- криво генерит с сундуком!
		stacks = { PredSkinX(13/kef, 25/kef, 0, 0), PredSkinX(26/kef, 32/kef, 50, 50), PredSkinX(40/kef, 55/kef, 100, 100), PredSkinX(60/kef, 70/kef, 150, 150) },
		trainers = {{ guard = gmm({}, PredSkin(80, 87, 100, 100)) }},
	}
end

--
function getEmptyZone(zoneId, playerRace, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		type = Zone.Junction,
		size = zoneSizeTre,
	}
end

--
function getHostZone(zoneId, playerRace, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		type = Zone.PlayerStart,
		size = zoneSizeTre,
	}
end

-------------------------------------------------


-- РАЗМЕРЫ ЗОН: Вернет таблицу с зонами
function getZones(races)
	local zones = {}

	local z910 = 4 -- тренер 50
	local z08 = 5 -- т0 стольня 50
	local z17 = 6 -- т1 60
	local z26 = 9 -- т2 90
	local z35 = 8 -- т3 82
	local z4 = gmm(12,12) -- центр 120 /G/ 110
	local zh = 2.4
	
	-- ИГРОК1
	gtal1() gtal2() gtal3() gtal4() gtal5()  -- [сброс т.таликов для игрока]
	gtp0p() -- [сброс т.перков для игрока]

	zones[1] = getPlayerZone00(0, races[1], z08) -- красный 5

	-- перемешать для 1 расы таблицу для ист-ков зоны тренера
		for i = #tbl, 2, -1 do
		local j = math.random(i)
		tbl[i], tbl[j] = tbl[j], tbl[i]
		end

	zones[11] = getTreasureZoneTrainers(10, races[1], races[2], z910) -- т.зелёный

	-- перемешать для 1 расы таблицу _a _b для ист-ков т1 и т2
		for i = #tbla, 2, -1 do
		local j = math.random(i)
		tbla[i], tbla[j] = tbla[j], tbla[i]
		end

		for i = #tblb, 2, -1 do
		local j = math.random(i)
		tblb[i], tblb[j] = tblb[j], tblb[i]
		end	

	zones[2] = getPlayerZone0(1, races[1], z17) -- зелёный 6(7)
	zones[3] = getPlayerZone(2, races[1], z26) -- синий 9(10)

	-- инвертировать для 1 расы таблицу для ист-ков зоны т3 (осаток ист-ков от тренера)
		for i = 1,#tbl do
		tbl[i] = math.abs(tbl[i]-1) 
		end

	zones[4] = getTreasureZone34(3, races[1], races[2], z35) -- белый 8(9)

	-- ИГРОК2
	gtal1() gtal2() gtal3() gtal4() gtal5()  -- [сброс т.таликов для игрока]
	gtp0p() -- [сброс т.перков для лавок]

	zones[9] = getPlayerZone00(8, races[2], z08) -- пурпурный

	-- инвертировать назад для зоны тренера
		for i = 1,#tbl do
		tbl[i] = math.abs(tbl[i]-1)
		end

	-- перемешать для 2 расы таблицу зоны тренера
		for i = #tbl, 2, -1 do
		local j = math.random(i)
		tbl[i], tbl[j] = tbl[j], tbl[i]
		end

	zones[10] = getTreasureZoneTrainers(9, races[2], races[1], z910) -- оранжевый

	-- перемешать для 2 расы таблицы _a _b для ист-ков т1 и т2
		for i = #tbla, 2, -1 do
		local j = math.random(i)
		tbla[i], tbla[j] = tbla[j], tbla[i]
		end

		for i = #tblb, 2, -1 do
		local j = math.random(i)
		tblb[i], tblb[j] = tblb[j], tblb[i]
		end		

	zones[8] = getPlayerZone0(7, races[2], z17) -- голубой
	zones[7] = getPlayerZone(6, races[2], z26) -- жёлтый

	-- инвертировать для 2 расы таблицу для ист-ков зоны т3 (осаток ист-ков от тренера)
		for i = 1,#tbl do
		tbl[i] = math.abs(tbl[i]-1) 
		end

	zones[6] = getTreasureZone34(5, races[2], races[1], z35) -- серый

	-- ЦЕНТР
	zones[5] = getTreasureZone5(4, races[1], races[2], z4) -- чёрный 12(13)

	zones[12] = getHostZone(13, races[3], zh)
	zones[13] = getEmptyZone(14, races[3], zh)

	return zones
end

----------------------

-- ПРОХОДЫ: Вернет таблицу с проходами между зонами:
function getZoneConnections(races)
local connections = {


	{from = 0, to = 4, size = 0},
	{from = 8, to = 4, size = 0},

	{from = 1, to = 4, size = 0},
	{from = 7, to = 4, size = 0},

	{from = 2, to = 4, guard = zoneGuardZone0()},
	{from = 3, to = 4, guard = zoneGuardZone()},

	{from = 4, to = 6, guard = zoneGuardZone0()},
	{from = 4, to = 5, guard = zoneGuardZone()},

	--{from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1}, {from = 0, to = 1},
	{from = 1, to = 0}, {from = 1, to = 0}, {from = 1, to = 0, guard = gmm('',zoneStacksP01())}, {from = 1, to = 0}, {from = 1, to = 0},
	{from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2, guard = gmm('',zoneStacksP12(races[1]))}, {from = 1, to = 2}, {from = 1, to = 2}, {from = 1, to = 2},
	{from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3, guard = gmm('',zoneStacksP23(races[1]))}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3}, {from = 2, to = 3},
	{from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6, guard = gmm('',zoneStacksP23(races[2]))}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6}, {from = 5, to = 6},
	{from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7, guard = gmm('',zoneStacksP12(races[2]))}, {from = 6, to = 7}, {from = 6, to = 7}, {from = 6, to = 7},
	{from = 7, to = 8}, {from = 7, to = 8}, {from = 7, to = 8, guard = gmm('',zoneStacksP01())}, {from = 7, to = 8}, {from = 7, to = 8},

	-- тренер т3_соперника
	{from = 3, to = 9, guard = zoneGuardZoneR()},
	{from = 5, to = 10, guard = zoneGuardZoneR()},

	-- респ тренер
	{from = 0, to = 10},{from = 0, to = 10},{from = 0, to = 10},
	{from = 9, to = 8},{from = 9, to = 8},{from = 9, to = 8},

	-- тренер в центр
	{from = 9, to = 4},
	{from = 10, to = 4},

	-- респы в центр
	--{from = 0, to = 4},
	--{from = 8, to = 4},
}
	local zones = {
		{1, 7},
		{2, 6},
		{3, 5},
	}
	local p = math.random(1,3)
	table.insert(connections, {from = 13, to = zones[p][1], size = 0})
	table.insert(connections, {from = 14, to = zones[p][2], size = 0})
	return connections
end

-- Вернет описание содержимого сценария для генератора - ОК
function getTemplateContents(races)
	local contents = {}
	
	contents.zones = getZones(races)
	contents.connections = getZoneConnections(races)

	return contents
end

-- ШАБЛОН
template = {
	name = gmm('Outrunner-judge-barton 2.9n', 'Outcross-judge-barton 2.9n'),
	description = gmm('Шаблон для игры 1 лидер, 1 жезловик, 1 вор.\nЧерная зона в центре, ее должны касаться: синяя, желтая, белая, серая, т.зеленая, оранжевая.\nСпасибо за поддержку! Карта Тинькофф: 2200700846776804','Шаблон для классической игры несколькими лидерами.\nЧерная зона в центре, ее должны касаться: синяя, желтая, белая, серая, т.зеленая, оранжевая.\nСпасибо за поддержку! Карта Тинькофф: 2200700846776804'),
	minSize = 72,
	maxSize = 72,
	maxPlayers = 3,
	startingGold = gmm(700,1100),
	startingNativeMana = gmm(200,400),
	roads = gmm(35,30), --45,41
	forest = gmm(30,30), --42,40
	iterations = 10000, --5000


-- Исключения юнитов
forbiddenUnits = {

-- Старндарные


-- Фракционные герои-лидеры и их вторые формы
'g000uu0021', --Архимаг
'g000uu8248', --Архимаг
'g000uu0020', --Следопыт
'g000uu0019', --Рыцарь на Пегасе
'g000uu0022', --Архангел
'g000uu0023', --Вор
'g000uu5300', --Вор
'g000uu0044', --Королевский страж
'g000uu0045', --Инженер
'g000uu0046', --Ученый
'g000uu8249', --Ученый
'g000uu0047', --Старейшина
'g000uu0048', --Вор
'g000uu5301', --Вор
'g000uu0070', --Герцог
'g000uu0071', --Советник
'g000uu0072', --Архидьявол
'g000uu8250', --Архидьявол
'g000uu0073', --Баронесса
'g000uu0074', --Вор
'g000uu5302', --Вор
'g000uu0096', --Рыцарь Смерти
'g000uu0097', --Носферату
'g000uu8252', --Носферату
'g000uu0098', --Королева личей
'g000uu8253', --Королева личей
'g000uu0099', --Баньши
'g000uu0100', --Вор
'g000uu5303', --Вор
'g000uu8251', --Дриада
'g000uu8010', --Дриада
'g000uu8009', --Вассал леса
'g000uu8011', --Страж леса
'g000uu8012', --Мудрец
'g000uu8013', --Вор
'g000uu5304', --Вор

-- Фракционные герои-солдаты
'g001uu0021', --Архимаг
'g001uu0020', --Следопыт
'g001uu0019', --Рыцарь на Пегасе
'g001uu0022', --Архангел
'g001uu0023', --Вор
'g001uu0045', --Инженер
'g001uu0044', --Королевский страж
'g001uu0046', --Ученый
'g070uu0003', --Ученый
'g001uu0047', --Старейшина
'g001uu0048', --Вор
'g001uu0072', --Архидьявол
'g070uu0004', --Архидьявол
'g001uu0071', --Советник
'g001uu0070', --Герцог
'g001uu0073', --Баронесса
'g001uu0074', --Вор
'g001uu0098', --Королева личей
'g070uu0001', --Носферату
'g001uu0097', --Носферату
'g001uu0096', --Рыцарь Смерти
'g001uu0099', --Баньши
'g001uu0100', --Вор
'g001uu8010', --Дриада
'g070uu0002', --Дриада
'g001uu8009', --Вассал леса
'g001uu8011', --Страж леса
'g001uu8012', --Мудрец
'g001uu8013', --Вор

-- Фракционные призыватели-солдаты с большим кол-вом опыта
'g001uu8238', -- Демиург
'g000uu8185', -- Магистр стихий
'g001uu7598', -- Теневидец
'g001uu8242', -- Xозяин масок
'g000uu0164', -- Повелитель волков

-- Фракционные хиллеры-солдаты с большим кол-вом опыта 
'g000uu0017', -- Аббатиса
'g000uu8035', -- Вильсида
'g002uu8039', -- Вердант
'g000uu7570', -- Епископ
'g000uu7569', -- Иерей
'g000uu8264', -- Иерарх
'g000uu0151', -- Прорицательница
'g000uu0013', -- Священник
'g000uu8214', -- Дриолисса
'g000uu8034', -- Солнечная Танцовщица
'g000uu0150', -- Патриарх
'g003uu8039', -- Древо жизни
'g003uu8038', -- Энт целитель
'g000uu8235', -- Сильфида
'g000uu2002', -- Целитель
'g003uu8037', -- Священное древо

-- нейтральные лидеры с низкой неподкупностью 20%
'g000uu5236', -- Гном
'g000uu5117', -- Гоблин
'g000uu5101', -- Крестьянин
'g000uu8308', -- Молодой триббог
'g000uu5130', -- Разбойник
'g000uu7556', -- Гоблин-жгун
'g000uu7533', -- Псина
'g000uu7510', -- Птица рух лидер
'g000uu7616', -- Гном упырь лидер
'g000uu6004', -- Толстый бес л.
'g000uu5201', -- Сквайр л.
'g000uu7539', -- Колотун
'g000uu7592', -- Торхот
'g000uu7516', -- Энт Малый л.
'g000uu5262', -- Сектант л.
'g000uu7614', -- Искатель рун лидер
'g000uu7553', -- Ведунья-лидер

--Все нейтральные хиллеры с большим кол-вом опыта (лидеры и солдаты)
'g000uu8287', -- Св.дерево л.
'g000uu8288', -- Энт целитель л.
'g000uu7519', -- Вердант л.
'g000uu8215', -- Дриолисса л.
'g000uu8262', -- Знахарка л.
'g000uu8289', -- Древо жизни л
'g000uu7521', -- Целитель л.
'g000uu5006', -- Великий Оракул
'g000uu8222', -- Волхв л. бафер
'g000uu8218', -- Волхв
'g000uu7544', -- Настоятельница
'g000uu8213', -- Гоблин-шаман
'g001uu8262', -- Знахарка
'g000uu2021', -- Проповедник
'g000uu6107', -- Темный эльф-жрец
'g000uu7619', -- Слуга культа
'g000uu8044', -- Темный Эльф Гаст л.

------------- Исключения юнитов Аутран
'g000uu8266', -- Дроттар--
'g000uu8265', -- дева пламени--
'g001uu0171', -- Двойник
'g000uu8217', -- Призрачный дракон л.
'g000uu8216', -- Призрачный дракон
'g000uu8269', -- Кровавый дракон л.
'g001uu8269', -- Кровавый дракон
'g000uu5022', -- Черный дракон
'g000uu5122', -- Черный дракон л.
'g000uu8144', -- темный эльф гаст л.
'g000uu2007', -- Мумификатор
'g000uu2008', -- Длань Мортис
--+
'g000uu7528', -- Мумификатор л.
'g000uu8318', -- Длань Мортис л.
'g000uu6113', -- Оккультист
'g000uu2022', -- Ламия
'g000uu8263', -- Чернокнижница

------------- Исключения водных лидеров Barton mss
'g000uu8230', -- Чудище
'g000uu5127', -- Кракен
'g000uu5129', -- Морской змей
'g000uu7522', -- Наяда
'g000uu8138', -- Никса
'g000uu5126', -- Русалка
'g000uu7536', -- Элементаль Воды

},

forbiddenItems = {


-----------СТАНДАРТНЫЕ
-- ОСНОВНЫЕ
'g000ig6008', --Посох невидимости
'g000ig6017', --Посох дневного света
'g000ig6018', --Посох сумерек
'g000ig5092', --Свиток "terra illudere"
'g000ig0019', --Эликсир молниеносности
'g000ig0020', --Эликсир могущества
'g000ig0017', --Эликсир неуязвимости
'g001ig0126', --Эликсир Всевышнего
'g001ig0129', --Зелье вампиризма50
'g001ig0020', --Великая аура вампиризма
'g001ig0035', --Великая аура жизненной силы
'g000ig5051', --Свиток "sanctuera"
'g000ig5083', --Свиток "свет дня"
'g000ig5095', --Свиток "сумерки"
'g000ig8005', --Семимильные сапоги
'g000ig9006', --Сфера окаменения
'g000ig9039', --Сфера паралича
'g001ig0596', --Линарет

-- ПРЕДМЕТЫ НА УСКОР/РЕЗ МУВОВ
'g000ig5032', --Свиток "Песнь скорости"
'g000ig5053', --Свиток "Paraseus"
'g000ig5094', --Свиток "Псалом Смерти"
'g000ig6004', --Посох парализации
'g000ig6005', --Посох путника
'g001ig0390', --Посох терна
'g001ig0389', --Посох первооткрывателя
'g001ig0513', --Зелье твердого шага

------------------ АУТРАН
'g001ig0414', --Отравленный вороний коготь (Артефакт)--
'g000ig3015', --кристалл души (артефакт)--
'g000ig3016', --рог инкуба (артефакт)--
'g001ig0158', --ужасающий топор (артефакт)--
'g000ig3021', --кольцо колдуньи (артефакт)--
'g001ig0155', --Благословенный браслет (Артефакт)

'g000ig9040', --Сфера Полиморфа
'g000ig9043', --Сфера ярости
'g000ig9007', --Сфера понижения уровня
'g001ig0181', --Сфера Страха

'g000ig2007', --ржавые кандалы--
'g000ig1011', --сапоги мореплавания
'g001ig0044', --Сердце океана (Артефакт)

--'g001ig0153', --Знамя вампиризма 25%
--'g001ig0366', --Стяг багровых рек вампиризма 25% + вард тауматургии
'g001ig0154', -- знамя поглощения--50%
'g001ig0373', -- Знамя магического иммунитета

'g000ig5027', --свиток мореплавания
'g000ig5006', --Свиток "Ускорение"--
'g000ig5100', --Свиток "Скорость"--
'g000ig5113', --Свиток "Порыв"--
'g000ig5099', --Свиток "Опутывание"--
'g001ig0094', --Свиток "Поспешность" отступление
'g000ig5120', --Свиток "Проворство" отступление

-- ещё
'g001ig0575', --Свиток "Подавляющая жизнь
'g001ig0572', --Свиток "Неотвратимая месть"
'g000ig9140', --Талисман лесной колдуньи 800
'g001ig0006', --Эликсир маскировки

--посох
'g001ig0386', -- Посох семи ветров
'g000ig6019', -- Посох Листвы 400 (обидно ну)

--релик
'g000ig4005', -- Книга войны (цена 450 - генерится с другими реликами)

--зелья на перки генерятся с другими пермобанками
'g001ig0531', -- Зелье слова (свитки) 500
'g001ig0524', -- Зелье завоевателя (жезлы) 500
'g001ig0526', -- Зелье оруженосца (знамёна) 600
'g001ig0530', -- Зелье посмертного зова (талики)
'g001ig0527', -- Зелье постижения (релики)
'g001ig0529', -- Каталог магических сфер
'g001ig0528', -- Честный труд (сапоги)
'g001ig0525', -- Эликсир учености (арты)
'g001ig0501', -- Дары Галлеана (хождение по лесу) 750

'g001ig0317', -- Зелье дьявольских таинств  (+15% пермо вампирик) 600

'g001ig0195', --Свиток "Откровение" (для аутрана не катит)
'g001ig0439', --Свиток "Et seminibus discordiae - Уменьшает лидерство на 1 в области 5x5 (не для аутранера)
'g001ig0440', --Свиток "Проклятие безволия минус лидерство
'g001ig0092', --Свиток "Гниение леса" за 400 в ролле нафиг надо
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа за 700 в ролле нафиг надо
'g000ig5118', --Свиток "Ослепления" Уменьшает обзор противника на 3 в радиусе 5х5.
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа.
'g000ig5059', --Свиток "Incantare Avenger Illudere" (Фантом Адского Мстителя)

},
	
	getContents = getTemplateContents
}